[
  {
    "path": "posts/dimensionality-reduction-and-clustering/",
    "title": "Tired: PCA + kmeans, Wired: UMAP + GMM",
    "description": "A Different Approach to a Different Technique",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2021-06-30",
    "categories": [
      "r",
      "soccer"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nUnsupervised Evaluation\r\n“Supervised” Evaluation\r\nAside: Re-coding Clusters\r\n\r\nCase Study: PCA vs. UMAP\r\nCase Study: UMAP + GMM\r\nConclusion\r\n\r\nIntroduction\r\nCombining principal component analysis (PCA) and kmeans clustering seems to be a pretty popular 1-2 punch in data science. While there is some debate about whether combining dimensionality reduction and clustering is something we should ever do1, I’m not here to debate that. I’m here to illustrate the potential advantages of upgrading your PCA + kmeans workflow to Uniform Manifold Approximation and Projection (UMAP) + Gaussian Mixture Model (GMM), as noted in my reply here.\r\n\r\nFor this demonstration, I’ll be using this data set pointed out here, including over 100 stats for players from soccer’s “Big 5” leagues.\r\n\r\n\r\nlibrary(tidyverse)\r\ndf <- \r\n  'FBRef 2020-21 T5 League Data.xlsx' %>% \r\n  readxl::read_excel() %>% \r\n  janitor::clean_names() %>% \r\n  mutate(across(where(is.double), ~replace_na(.x, 0)))\r\n\r\n# Let's only use players with a 10 matches' worth of minutes.\r\ndf_filt <- df %>% filter(min > (10 * 90))\r\n\r\n\r\n\r\n\r\n\r\ndf_filt %>% dim()\r\n\r\n\r\n\r\n\r\n\r\n## [1] 1626  128\r\n\r\n\r\n\r\nTrying to infer something from the correlation matrix doesn’t get you very far, so one can see why dimensionality reduction will be useful.\r\n\r\nAlso, we don’t really have “labels” here (more on this later), so clustering can be useful for learning something from our data.\r\nUnsupervised Evaluation\r\nWe’ll be feeding in the results from the dimensionality reduction—either PCA or UMAP—to a clustering method—either kmeans or GMM. So, since clustering comes last, all we need to do is figure out how to judge the clustering; this will tell us something about how “good” the combination of dimensionality reduction and clustering is overall.\r\nI’ll save you from google-ing and just tell you that within-cluster sum of squares (WSS) is typically used for kmeans, and Bayesian Information Criteria (BIC) is the go-to metric for GMM. WSS and BIC are not on the same scale, so we can’t directly compare kmeans and GMM at this point. Nonetheless, we can experiment with different numbers of components—the one major “hyperparameter” for dimensionality reduction—prior to the clustering to identify if more or less components is “better”, given the clustering method. Oh, and why not also vary the number of clusters—the one notable hyperparameter for clustering—while we’re at it?\r\n\r\nFor kmeans, we see that WSS decreases with increasing number of clusters, which is typically what we see in “elbow” plots like this. Additionally, we see that WSS decreases with increasing number of components. This makes sense—additional components means more data is accounted for.2 There is definitely a point of “diminishing returns”, somewhere around 3 clusters, after which WSS barely improves.3 Overall, we observe that the kmeans models using UMAP pre-processing do better, compared to those using PCA.\r\nMoving on to GMM, we observe that BIC generally increases with the number of clusters as well. (Note that, due to the way the {mclust} package defines it’s objective function, higher BIC is “better”.)\r\n\r\nRegarding number of components, we see that the GMM models using more UMAP components do better, as we should have expected. On the other hand, we observe that GMM models using less PCA components do better than those with more components. This is a bit of an odd finding that I don’t have a great explanation for. (Someone please math-splain to me.) Nonetheless, we see that UMAP does better than PCA overall, as we observed with kmeans.\r\nFor those interested in the code, I map-ed a function across a grid of parameters to generate the data for these plots.4\r\n\r\n\r\ndo_dimr_clust <-\r\n  function(n, k,\r\n           f_dimr = c('pca', 'umap'),\r\n           f_clust = c('kmeans', 'gmm'),\r\n           ...) {\r\n    f_dimr <- match.arg(f_dimr)\r\n    f_clust <- match.arg(f_clust)\r\n    f_step <- ifelse(f_dimr == 'pca', recipes::step_pca, embed::step_umap)\r\n    f_fit <- ifelse(f_clust == 'gmm', stats::kmeans, mclust::Mclust)\r\n    \r\n    data <-\r\n      recipes::recipe(formula( ~ .), data = df_filt) %>%\r\n      recipes::step_normalize(recipes::all_numeric_predictors()) %>%\r\n      f_step(recipes::all_numeric_predictors(), num_comp = n) %>% \r\n      recipes::prep() %>% \r\n      recipes::juice() %>% \r\n      select(where(is.numeric))\r\n    fit <- f_fit(data, ...)\r\n    broom::glance(fit)\r\n  }\r\n\r\nmetrics <-\r\n  crossing(\r\n    n = seq.int(2, 8),\r\n    k = seq.int(2, 8),\r\n    f_dimr = c('pca', 'umap'),\r\n    f_clust = c('kmeans', 'mclust')\r\n  ) %>%\r\n  mutate(metrics = pmap(\r\n    list(n, k, f, g),\r\n    ~ do_dimr_clust(\r\n      n = ..1,\r\n      k = ..2,\r\n      f = ..3,\r\n      g = ..4\r\n    )\r\n  ))\r\nmetrics\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 196 x 5\r\n##        n     k f     g      metrics         \r\n##    <int> <int> <chr> <chr>  <list>          \r\n##  1     2     2 pca   kmeans <tibble [1 x 4]>\r\n##  2     2     2 pca   gmm    <tibble [1 x 7]>\r\n##  3     2     2 umap  kmeans <tibble [1 x 4]>\r\n##  4     2     2 umap  gmm    <tibble [1 x 7]>\r\n##  5     2     3 pca   kmeans <tibble [1 x 4]>\r\n##  6     2     3 pca   gmm    <tibble [1 x 7]>\r\n##  7     2     3 umap  kmeans <tibble [1 x 4]>\r\n##  8     2     3 umap  gmm    <tibble [1 x 7]>\r\n##  9     2     4 pca   kmeans <tibble [1 x 4]>\r\n## 10     2     4 pca   gmm    <tibble [1 x 7]>\r\n## # ... with 186 more rows\r\n\r\n\r\n\r\n“Supervised” Evaluation\r\nWe actually do have something that we can use to help us identify clusters—player position (pos). Let’s treat these position groups as pseudo-labels with which we can gauge the effectiveness of the clustering.\r\n\r\n\r\ndf_filt <-\r\n  df_filt %>% \r\n  mutate(\r\n    across(\r\n      pos,\r\n      ~case_when(\r\n        .x %in% c('DF,MF', 'MF,DF') ~ 'DM',\r\n        .x %in% c('DF,FW', 'FW,DF') ~ 'M',\r\n        .x %in% c('MF,FW', 'FW,MF') ~ 'AM',\r\n        .x == 'DF' ~ 'D',\r\n        .x == 'MF' ~ 'M',\r\n        .x == 'FW' ~ 'F',\r\n        .x == 'GK' ~ 'G',\r\n        .x == 'GK,MF' ~ 'G',\r\n        TRUE ~ .x\r\n      )\r\n    )\r\n  )\r\ndf_filt %>% count(pos, sort = TRUE)\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6 x 2\r\n##   pos       n\r\n##   <chr> <int>\r\n## 1 D       595\r\n## 2 M       364\r\n## 3 AM      273\r\n## 4 F       196\r\n## 5 G       113\r\n## 6 DM       85\r\n\r\n\r\n\r\nTypically we don’t have labels for clustering tasks; if we do, we’re usually doing some kind of supervised multi-label classification. But our labels aren’t “true” labels in this case, both because:\r\na player’s nominal position often doesn’t completely describe their style of play, and\r\nthe grouping I did to reduce the number of positions from 11 to 6 was perhaps not optimal.\r\nSo now let’s do the same as before—evaluate different combinations of PCA and UMAP with kmeans and GMM. But now we can use some supervised evaluation metrics: (1) accuracy and (2) mean log loss. While the former is based on the “hard” predictions, the latter is based on probabilities for each class. kmeans returns just hard cluster assignments, so computing accuracy is straightforward; since it doesn’t return probabilities, we’ll treat the hard assignments as having a probability of 1 to compute log loss.5\r\nWe can compare the two clustering methods more directly now using these two metrics. Since we know that there are 6 position groups, we’ll keep the number of clusters constant at 6. (Note that number of clusters was shown on the x-axis before; but since we have fixed number of components at 6, now we show the number of components on the x-axis.)\r\nLooking at accuracy first, we see that the best combo depends on our choice for number of components. Overall, we might say that the UMAP combos are better.\r\n\r\nNext, looking at average log loss, we see that the GMM clustering methods seem to do better overall (although this may be due to the fact that log loss is not typically used for supervised kmeans). The PCA + GMM does the best across all number of components, with the exception of 7. Note that we get a mean log loss around 28 when we predict the majority class (defender) with a probability of 1 for all observations. (This is a good “baseline” to contextualize our numbers.)\r\n\r\nUMAP shines relative to PCA according to accuracy, and GMM beats out kmeans in terms of log loss. Despite these conclusions, we still don’t have clear evidence that UMAP + GMM is the best 1-2 combo; nonetheless, we can at least feel good about its general strength.\r\nAside: Re-coding Clusters\r\nI won’t bother to show all the code to generate the above plots since it’s mostly just broom::augmment() and {ggplot2}. But, if you have ever worked with supervised stuff like this (if we can call it that), you’ll know that figuring out which of your clusters correspond to your known groups can be difficult. In this case, I started from a variable holding the predicted .class and the true class (pos).\r\n\r\n\r\nassignments\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 1,626 x 2\r\n##    .class pos  \r\n##     <int> <chr>\r\n##  1      1 D    \r\n##  2      2 D    \r\n##  3      3 M    \r\n##  4      3 M    \r\n##  5      4 AM   \r\n##  6      2 D    \r\n##  7      2 D    \r\n##  8      4 F    \r\n##  9      2 D    \r\n## 10      1 D    \r\n## # ... with 1,616 more rows\r\n\r\n\r\n\r\nI generated a correlation matrix for these two columns, ready to pass into a matching procedure.\r\n\r\n\r\ncors <-\r\n  assignments %>% \r\n  fastDummies::dummy_cols(c('.class', 'pos'), remove_selected_columns = TRUE) %>% \r\n  corrr::correlate(method = 'spearman', quiet = TRUE) %>% \r\n  filter(term %>% str_detect('pos')) %>% \r\n  select(term, matches('^[.]class'))\r\ncors\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6 x 7\r\n##   term   .class_1 .class_2 .class_3 .class_4 .class_5 .class_6\r\n##   <chr>     <dbl>    <dbl>    <dbl>    <dbl>    <dbl>    <dbl>\r\n## 1 pos_AM  -0.208   -0.241   -0.178    0.0251   0.625   -0.123 \r\n## 2 pos_D    0.499    0.615   -0.335   -0.264   -0.428   -0.208 \r\n## 3 pos_DM   0.0797   0.0330   0.0548  -0.0829  -0.0519  -0.0642\r\n## 4 pos_F   -0.171   -0.199   -0.168    0.724    0.0232  -0.101 \r\n## 5 pos_G   -0.127   -0.147   -0.124   -0.0964  -0.157    1     \r\n## 6 pos_M   -0.222   -0.267    0.724   -0.180    0.0395  -0.147\r\n\r\n\r\n\r\nThen I used clue::solve_LSAP() to do the bipartite matching magic. The rest is just pre- and post-processing.\r\n\r\n\r\nk <- 6 # number of clusters\r\ncols_idx <- 2:(k+1)\r\ncors_mat <- as.matrix(cors[,cols_idx]) + 1 # all values have to be positive\r\nrownames(cors_mat) <- cors$term\r\ncols <- names(cors)[cols_idx]\r\ncolnames(cors_mat) <- cols\r\ncols_idx_min <- clue::solve_LSAP(cors_mat, maximum = TRUE)\r\ncols_min <- cols[cols_idx_min]\r\npairs <-\r\n  tibble::tibble(\r\n    .class = cols_min %>% str_remove('^[.]class_') %>% as.integer(),\r\n    pos = cors$term %>% str_remove('pos_')\r\n  )\r\npairs\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6 x 2\r\n##   .class pos  \r\n##    <int> <chr>\r\n## 1      5 AM   \r\n## 2      2 D    \r\n## 3      1 DM   \r\n## 4      4 F    \r\n## 5      6 G    \r\n## 6      3 M \r\n\r\n\r\n\r\nThis pairs variable can be used to re-code the .class column in our assignments from before.\r\nCase Study: PCA vs. UMAP\r\nLet’s step back from the clustering techniques and focus on dimensionality reduction for a moment. One of the ways that dimensionality reduction can be leveraged in sports like soccer is for player similarity metrics.6 Let’s take a look at how this can be done, comparing the PCA and UMAP results while we’re at it.\r\nDirect comparison of the similarity “scores” we’ll compute—based on Euclidean distance between a chosen player’s components and other players’ components—is not wise given the different ranges of our PCA and UMAP components, so we’ll rely on rankings based on these scores.7 Additionally, fbref provides a “baseline” that we can use to judge our similarity rankings.8\r\nWe’ll start with Jadon Sancho, a highly discussed player at the moment (as a potential transfer).\r\n\r\nWe first need to set up our data into the following format. (This is for 2-component, 6-cluster UMAP + GMM.)\r\n\r\n\r\nsims_int\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 1,664 x 6\r\n##    player_1     player_2           comp_1 comp_2 value_1 value_2\r\n##    <chr>        <chr>               <int>  <int>   <dbl>   <dbl>\r\n##  1 Jadon Sancho Aaron Leya Iseka        1      1  -4.18  -5.14  \r\n##  2 Jadon Sancho Aaron Leya Iseka        2      2  -0.678  2.49  \r\n##  3 Jadon Sancho Aaron Ramsey            1      1  -4.18  -3.25  \r\n##  4 Jadon Sancho Aaron Ramsey            2      2  -0.678 -0.738 \r\n##  5 Jadon Sancho Abdoul Kader Bamba      1      1  -4.18  -3.40  \r\n##  6 Jadon Sancho Abdoul Kader Bamba      2      2  -0.678  0.0929\r\n##  7 Jadon Sancho Abdoulaye Doucouré      1      1  -4.18  -1.36  \r\n##  8 Jadon Sancho Abdoulaye Doucouré      2      2  -0.678 -2.66  \r\n##  9 Jadon Sancho Abdoulaye Touré         1      1  -4.18  -1.36  \r\n## 10 Jadon Sancho Abdoulaye Touré         2      2  -0.678 -2.89  \r\n## # ... with 1,654 more rows\r\n\r\n\r\n\r\nThen the Euclidean distance calculation is fairly straightforward.\r\n\r\n\r\nsims <-\r\n  sims_init %>% \r\n  group_by(player_1, player_2) %>% \r\n  summarize(\r\n    d = sqrt(sum((value_1 - value_2)^2))\r\n  ) %>% \r\n  ungroup() %>% \r\n  mutate(score = 1 - ((d - 0) / (max(d) - 0))) %>% \r\n  mutate(rnk = row_number(desc(score))) %>% \r\n  arrange(rnk) %>% \r\n  select(player = player_2, d, score, rnk)\r\nsims\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 830 x 4\r\n##    player                  d score   rnk\r\n##    <chr>               <dbl> <dbl> <int>\r\n##  1 Alexis Sánchez     0.0581 0.994     1\r\n##  2 Riyad Mahrez       0.120  0.988     2\r\n##  3 Serge Gnabry       0.132  0.986     3\r\n##  4 Jack Grealish      0.137  0.986     4\r\n##  5 Pablo Sarabia      0.171  0.983     5\r\n##  6 Thomas Müller      0.214  0.978     6\r\n##  7 Leroy Sané         0.223  0.977     7\r\n##  8 Callum Hudson-Odoi 0.226  0.977     8\r\n##  9 Jesse Lingard      0.260  0.973     9\r\n## 10 Ousmane Dembélé    0.263  0.973    10\r\n## # ... with 820 more rows\r\n\r\n\r\n\r\nDoing the same for PCA and combining all results, we get the following set of rankings.\r\n\r\nWe see that the UMAP rankings are “closer” overall to the fbref rankings. Of course, there are some caveats:\r\nThis is just one player.\r\nThis is with a specific number of components and clusters.\r\nWe are comparing to similarity rankings based on a separate methodology.\r\nOur observation here (that UMAP > PCA) shouldn’t be taken out of context to conclude that UMAP > PCA in all contexts. Nonetheless, I think this is an interesting use case for dimensionality reduction, where one can justify PCA, UMAP, or any other similar technique, depending on how intuitive the results are.\r\nCase Study: UMAP + GMM\r\nFinally, let’s bring clustering back into the conversation. We’re going to focus on how the heralded UMAP + GMM combo can be visualized to provide insight that supports (or debunks) our prior understanding.\r\nWith a 2-component UMAP + 6-cluster GMM, we can see how the 6 position groups can be identified in a 2-D space.\r\n\r\nFor those curious, using PCA instead of UMAP also leads to an identifiable set of clusters. However, uncertainties are generally higher across the board (larger point sizes, more overlap between covariance ellipsoids).\r\n\r\nIf we exclude keepers (G) and defenders (D) to focus on the other 4 positions with our UMAP + GMM approach, we can better see how some individual points —at the edges or outside of covariance ellipsoids—are classified with a higher degree of uncertainty.9\r\n\r\nNow, highlighting incorrect classifications, we can see how the defensive midfielder (DM) position group (upper left) seems to be a blind spot in our approach.\r\n\r\nA more traditional confusion matrix10 also illustrates the inaccuracy with classifying DMs. (Note the lack of dark grey fill in the DM column.)\r\n\r\nDMs are often classified as defenders instead. I think this poor result has is more so due to my lazy grouping of players with \"MF,DF' or \"DF,MF\" positions in the original data set than a fault in our approach.\r\nConclusion\r\nSo, should our overall conclusion be that we should never use PCA or kmeans? No, not necessarily. They can both be much faster to compute than UMAP and GMMs respectively, which can be a huge positive if computation is a concern. PCA is linear while UMAP is not, so you may want to choose PCA to make it easier to explain to your friends. Regarding clustering, kmeans is technically a specific form of a GMM, so if you want to sound cool to your friends and tell them that you use GMMs, you can do that.\r\nAnyways, I hope I’ve shown why you should try out UMAP and GMM the next time you think about using PCA and kmeans.\r\n\r\nIn some contexts you may want to do feature selection and/or manual grouping of data.↩︎\r\nWhile this whole thing is more about comparing techniques, I should make a note about WSS. We don’t want to increase the number of components for the sake of minimizing WSS. We lose some degree of interpretation with increasing components. Additionally, we could be overfitting the model by increasing the number of components. Although we don’t have the intention of classifying new observations in this demo, it’s still good to keep overfitting in mind.↩︎\r\nThis demo isn’t really intended to be a study in how to choose the best number of clusters, but I figured I’d point this out.↩︎\r\nI’d suggest this blog post from Julia Silge for a better explanation of clustering with R and {tidymodels}.↩︎\r\nPerhaps this is against best practice, but we’ll do it here for the sake of comparison.↩︎\r\nNormalization perhaps doesn’t help much here given the clustered nature of the reduced data.↩︎\r\nNormalization perhaps doesn’t help much here given the clustered nature of the reduced data.↩︎\r\nfbref uses a different methodology, so perhaps it’s unwise to compare to them.↩︎\r\nSure, one can argue that a player like Diogo Jota should have been classified as an attacking midfielder (AM) to begin with, in which case he might not have been misclassified here.↩︎\r\nBy the way, the autoplot() function for yardstick::conf_mat() results is awesome if you haven’t ever used it.↩︎\r\n",
    "preview": "posts/dimensionality-reduction-and-clustering/featured.png",
    "last_modified": "2021-07-01T22:14:28-05:00",
    "input_file": {},
    "preview_width": 2400,
    "preview_height": 2400
  },
  {
    "path": "posts/soccer-league-strength/",
    "title": "Quantifying Relative Soccer League Strength",
    "description": "With Atomic VAEP",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2021-06-26",
    "categories": [
      "r",
      "soccer"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nMethodology\r\nImprovements & Further Work\r\nAncillary Take-away\r\n\r\nIntroduction\r\nArguing about domestic league strength is something that soccer fans seems to never tire of. (“Could Messi do it on a cold rainy night in Stoke?”) Many of these conversations are anecdotal, leading to “hot takes” that are unfalsifiable. While we’ll probably never move away from these kinds of discussions, we can at least try to inform them with a quantitative approach.\r\nPerhaps the obvious way to do so is to take match results from international tournaments (e.g. Champions League, Europa). But such an approach can be flawed—there’s not a large sample, and match results may not be reflective of “true” team strength (e.g. one team may win on xG by a large margin, but lose the game.)\r\nMethodology\r\nBut what if we used an approach rooted in player performance? I asked myself that very question and came up with the following approach. (Thanks to Cahnzhi Ye for the data.)\r\nIdentify players who played in more than one league within the same season or across consecutive seasons. Calculate the difference in each player’s atomic VAEP1 per 90 minutes (VAEP/90) after changing leagues.\r\n\r\n\r\n## # A tibble: 2,462 x 7\r\n##    Season Player        `League A`        `League B`       `VAEP/90 A` `VAEP/90 B`   Diff.\r\n##     <dbl> <chr>         <chr>             <chr>                  <dbl>       <dbl>   <dbl>\r\n##  1   2020 Timo Werner   Bundesliga 1 (Ge~ Premier League ~       1.25        0.638  0.610 \r\n##  2   2020 Alexander Sø~ Super Lig (Turke~ Bundesliga 1 (G~       1.07        0.773  0.296 \r\n##  3   2020 Hakim Ziyech  Eredivisie (Neth~ Premier League ~       0.958       0.365  0.593 \r\n##  4   2020 Nicolás Gonz~ Bundesliga 2 (Ge~ Bundesliga 1 (G~       0.917       0.943 -0.0256\r\n##  5   2020 Fabian Klos   Bundesliga 2 (Ge~ Bundesliga 1 (G~       0.904       0.547  0.358 \r\n##  6   2020 Victor Osimh~ Ligue 1 (France)  Serie A (Italy)        0.889       1.01  -0.120 \r\n##  7   2020 Eldor Shomur~ Premier League (~ Serie A (Italy)        0.882       0.755  0.126 \r\n##  8   2020 Callum Robin~ Championship (En~ Premier League ~       0.880       0.682  0.198 \r\n##  9   2020 Jarrod Bowen  Championship (En~ Premier League ~       0.871       0.448  0.423 \r\n## 10   2020 Aleksandar M~ Championship (En~ Premier League ~       0.866       0.499  0.367 \r\n## # ... with 2,452 more rows\r\n\r\n\r\n\r\nWhy VAEP? Theoretically it should capture more about in-game actions (including defense) than other stats such as xG, which is biased in favor of attacking players. VAEP is not perfect by any means (e.g. it does not capture off-ball actions), but, in theory, it should be a better measure of overall performance. 2\r\nNotably, we give up a little in interpretability in using VAEP, since it’s not directly translatable to goals. 3 The following table of top season-long xG totals since 2012 to contextualize the magnitudes of xG and VAEP.\r\n\r\n\r\n## # A tibble: 36,857 x 5\r\n##    Season Player             Minutes    xG  VAEP\r\n##     <dbl> <chr>                <dbl> <dbl> <dbl>\r\n##  1   2015 Lionel Messi          3529  38.1  69.0\r\n##  2   2016 Luis Suárez           3294  35.6  55.7\r\n##  3   2018 Robert Lewandowski    2259  35.1  40.2\r\n##  4   2012 Lionel Messi          3425  32.4  76.2\r\n##  5   2013 Lionel Messi          2776  31.6  60.0\r\n##  6   2015 Cristiano Ronaldo     3236  30.8  58.7\r\n##  7   2018 Mohamed Salah         3080  30.4  50.5\r\n##  8   2012 Cristiano Ronaldo     3504  30.1  62.7\r\n##  9   2017 Edin Dzeko            3216  29.8  49.7\r\n## 10   2020 Robert Lewandowski    2902  29.7  49.2\r\n## # ... with 36,847 more rows\r\n\r\n\r\n\r\nAnd a scatter plot, because who doesn’t love a graph.\r\n\r\nConvert the player-level VAEP/90 differences to z-scores by position and age group.\r\n\r\n\r\n## # A tibble: 2,462 x 7\r\n##    Season Player      Position `Age Group` `League A`      `League B`    `VAEP/90 Diff. Z`\r\n##     <dbl> <chr>       <chr>    <chr>       <chr>           <chr>                     <dbl>\r\n##  1   2020 Timo Werner AM       24<=x<27    Bundesliga 1 (~ Premier Leagu~            2.28 \r\n##  2   2020 Alexander ~ FW       24<=x<27    Super Lig (Tur~ Bundesliga 1 ~            1.10 \r\n##  3   2020 Hakim Ziye~ M        27<=x<30    Eredivisie (Ne~ Premier Leagu~            3.20 \r\n##  4   2020 Nicolás Go~ M        18<=x<24    Bundesliga 2 (~ Bundesliga 1 ~           -0.148\r\n##  5   2020 Fabian Klos FW       30<=x<36    Bundesliga 2 (~ Bundesliga 1 ~            1.20 \r\n##  6   2020 Victor Osi~ FW       18<=x<24    Ligue 1 (Franc~ Serie A (Ital~           -0.439\r\n##  7   2020 Eldor Shom~ FW       24<=x<27    Premier League~ Serie A (Ital~            0.471\r\n##  8   2020 Callum Rob~ AM       24<=x<27    Championship (~ Premier Leagu~            0.740\r\n##  9   2020 Jarrod Bow~ AM       18<=x<24    Championship (~ Premier Leagu~            1.89 \r\n## 10   2020 Aleksandar~ FW       24<=x<27    Championship (~ Premier Leagu~            1.37 \r\n## # ... with 2,452 more rows\r\n\r\n\r\n\r\nWhy grouping? This is intended to account for the fact that attacking players and “peaking” players (usually age 24-30) tend to have higher VAEP/90, so their league-to-league differences have larger variation. The choice to normalize is perhaps more questionable. The mean of differences is ~0 for all groups already, but the dispersion is smaller without normalization (i.e. standard deviations are closer to 0). So, in this case, normalization should help the linear model capture variation.\r\n\r\n\r\n## # A tibble: 20 x 5\r\n##    Position Age Group N    Mean   SD\r\n##    <chr>    <chr>    <int> <dbl>  <dbl>\r\n##  1 AM       18<=x<24   138     0 0.224 \r\n##  2 AM       24<=x<27   128     0 0.268 \r\n##  3 AM       27<=x<30   118     0 0.248 \r\n##  4 AM       30<=x<36    68     0 0.248 \r\n##  5 D        18<=x<24   203     0 0.112 \r\n##  6 D        24<=x<27   268     0 0.101 \r\n##  7 D        27<=x<30   295     0 0.0930\r\n##  8 D        30<=x<36   316     0 0.0939\r\n##  9 DM       18<=x<24    30     0 0.102 \r\n## 10 DM       24<=x<27    48     0 0.0913\r\n## 11 DM       27<=x<30    20     0 0.105 \r\n## 12 DM       30<=x<36    13     0 0.0719\r\n## 13 FW       18<=x<24    26     0 0.274 \r\n## 14 FW       24<=x<27    67     0 0.268 \r\n## 15 FW       27<=x<30    50     0 0.263 \r\n## 16 FW       30<=x<36    66     0 0.297 \r\n## 17 M        18<=x<24   113     0 0.173 \r\n## 18 M        24<=x<27   130     0 0.147 \r\n## 19 M        27<=x<30   189     0 0.185 \r\n## 20 M        30<=x<36   186     0 0.171  \r\n\r\n\r\n\r\nRun a single regression where the response variable is the z-transformed VAEP/90 difference, and the features are indicators for leagues leagues, where -1 indicates player departure, a +1 indicates player arrival, and all other values are 0.4 5\r\nFor those familiar with basketball and hockey, this is similar to the set-up for an adjusted plus-minus (APM) calculation. Here, each feature column is a league (instead of a player), each row represents a player (instead of a “stint”), and the response is transformed VAEP/90 (instead of net points per possession).\r\n\r\n\r\n## tibble [2,472 x 16] (S3: tbl_df/tbl/data.frame)\r\n##  $ VAEP/90 Diff Z-Trans     : num [1:2472] -0.0825 0.3285 -0.0143 0.1137 0.1526 ...\r\n##  $ Serie A (Italy)          : int [1:2472] -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 ...\r\n##  $ Bundesliga 1 (Germany)   : int [1:2472] 1 1 0 0 0 0 0 0 0 0 ...\r\n##  $ La Liga (Spain)          : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Serie A (Brazil)         : int [1:2472] 0 0 0 0 0 1 0 0 0 0 ...\r\n##  $ Super Lig (Turkey)       : int [1:2472] 0 0 1 0 0 0 0 1 0 0 ...\r\n##  $ Premier League (England) : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Super League (China)     : int [1:2472] 0 0 0 0 0 0 0 0 0 1 ...\r\n##  $ Major League Soccer (USA): int [1:2472] 0 0 0 0 1 0 1 0 0 0 ...\r\n##  $ Primeira Liga (Portugal) : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Ligue 1 (France)         : int [1:2472] 0 0 0 1 0 0 0 0 0 0 ...\r\n##  $ Bundesliga 2 (Germany)   : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Championship (England)   : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Premier League (Russia)  : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n##  $ Superliga (Argentina)    : int [1:2472] 0 0 0 0 0 0 0 0 1 0 ...\r\n##  $ Eredivisie (Netherlands) : int [1:2472] 0 0 0 0 0 0 0 0 0 0 ...\r\n\r\n\r\n\r\nThe result is a set of coefficient estimates corresponding to each league. Notably, these are all positive (even if subtracting the intercept), and the Netherlands coefficient is NA due to multi-collinearity in the data. 6\r\n\r\n\r\n## # A tibble: 16 x 2\r\n##    League                    Estimate\r\n##    <chr>                        <dbl>\r\n##  1 Premier League (England)    0.975 \r\n##  2 La Liga (Spain)             0.869 \r\n##  3 Ligue 1 (France)            0.786 \r\n##  4 Serie A (Italy)             0.738 \r\n##  5 Serie A (Brazil)            0.724 \r\n##  6 Primeira Liga (Portugal)    0.675 \r\n##  7 Bundesliga 1 (Germany)      0.649 \r\n##  8 Championship (England)      0.641 \r\n##  9 Super Lig (Turkey)          0.617 \r\n## 10 Premier League (Russia)     0.485 \r\n## 11 Superliga (Argentina)       0.463 \r\n## 12 Super League (China)        0.360 \r\n## 13 Major League Soccer (USA)   0.281 \r\n## 14 Bundesliga 2 (Germany)      0.197 \r\n## 15 (Intercept)                 0.0747\r\n## 16 Eredivisie (Netherlands)   NA     \r\n\r\n\r\n\r\nFor hockey/basketball APM, we would say the coefficient estimate represents how much a player contributes relative to an “average” player. We might be tempted to try to interpret these coefficients directly as well. Yes, we can infer the league “power rankings” from just this singular coefficient list (Premier League as the strongest and Bundesliga 2 as the weakest), but there are some issues.\r\nWe first need to “un-transform” this back to the VAEP/90 scale. (See next step.)\r\nNote that this is not a zero-sum situation (even after un-transforming). There is no notion of a matchup between one league and another like there is in hockey/basketball with players on the ice/court. Instead, our data is more analogous to a player playing against themselves (not a set of players versus another set of players).\r\nEven if this were a zero-sum type of problem and the model returned some negative coefficient estimates, it’s unclear what the intercept (or 0) even means. Does it mean “average”? If so, what is an “average” league?\r\nWe accounted for minutes played—the “per 90” denominator—prior to subtracting rates (difference in VAEP/90), which is different than how APM works. In APM, the minutes played is directly accounted for in the response variable (net points, divided by possessions).\r\nThe take-away here is that we can only interpret the model coefficients on a relative basis.\r\n\r\n\r\n## # A tibble: 256 x 5\r\n##    `League A`               `League B`               `Estimate A` `Estimate B` Diff.\r\n##    <fct>                    <fct>                           <dbl>        <dbl> <dbl>\r\n##  1 Premier League (England) Premier League (England)        0.975        0.975 0    \r\n##  2 Premier League (England) La Liga (Spain)                 0.975        0.869 0.107\r\n##  3 Premier League (England) Ligue 1 (France)                0.975        0.786 0.189\r\n##  4 Premier League (England) Serie A (Italy)                 0.975        0.738 0.238\r\n##  5 Premier League (England) Serie A (Brazil)                0.975        0.724 0.252\r\n##  6 Premier League (England) Primeira Liga (Portugal)        0.975        0.675 0.300\r\n##  7 Premier League (England) Bundesliga 1 (Germany)          0.975        0.649 0.326\r\n##  8 Premier League (England) Championship (England)          0.975        0.641 0.334\r\n##  9 Premier League (England) Super Lig (Turkey)              0.975        0.617 0.358\r\n## 10 Premier League (England) Premier League (Russia)         0.975        0.485 0.491\r\n## # ... with 246 more rows\r\n\r\n\r\n\r\n“Un-transform” the coefficients of the regression using a “weighted-average” standard deviation and mean from the z-transformations of groups. 7 8\r\nInterpretation after this transformation can be a little tricky. The differences between a specified pair of these post-transformed coefficients represents the expected change in an “average” player’s VAEP/90 (Diff. (VAEP/90)) when moving between the specified leagues.\r\n\r\n\r\n## # A tibble: 256 x 4\r\n##    `League A`               `League B`               Diff. `Diff. (VAEP/90)`\r\n##    <fct>                    <fct>                    <dbl>             <dbl>\r\n##  1 Premier League (England) Premier League (England) 0                0     \r\n##  2 Premier League (England) La Liga (Spain)          0.107            0.0166\r\n##  3 Premier League (England) Ligue 1 (France)         0.189            0.0295\r\n##  4 Premier League (England) Serie A (Italy)          0.238            0.0371\r\n##  5 Premier League (England) Serie A (Brazil)         0.252            0.0393\r\n##  6 Premier League (England) Primeira Liga (Portugal) 0.300            0.0469\r\n##  7 Premier League (England) Bundesliga 1 (Germany)   0.326            0.0509\r\n##  8 Premier League (England) Championship (England)   0.334            0.0521\r\n##  9 Premier League (England) Super Lig (Turkey)       0.358            0.0559\r\n## 10 Premier League (England) Premier League (Russia)  0.491            0.0766\r\n## # ... with 246 more rows\r\n\r\n\r\n\r\nTo interpret these differences as a percentage (so that we can “scale” the properly for a player with a VAEP/90 of 1.5, compared to a player with a lower VAEP/90 rate), we use the median VAEP/90 across all leagues as a “baseline”. For example, for Bundesliga -> Premier League, since the overall median VAEP/90 is 0.305 and the Diff. (VAEP/90) between league A and league B is 0.0509, the % Difference is 0.0509/0.305 = 17%.\r\n\r\n\r\n## # A tibble: 256 x 5\r\n##    `League A`               `League B`               Diff. `Diff. (VAEP/90)` `% Diff.`\r\n##    <fct>                    <fct>                    <dbl>             <dbl> <chr>    \r\n##  1 Premier League (England) Premier League (England) 0                0      0%       \r\n##  2 Premier League (England) La Liga (Spain)          0.107            0.0166 5%       \r\n##  3 Premier League (England) Ligue 1 (France)         0.189            0.0295 10%      \r\n##  4 Premier League (England) Serie A (Italy)          0.238            0.0371 12%      \r\n##  5 Premier League (England) Serie A (Brazil)         0.252            0.0393 13%      \r\n##  6 Premier League (England) Primeira Liga (Portugal) 0.300            0.0469 15%      \r\n##  7 Premier League (England) Bundesliga 1 (Germany)   0.326            0.0509 17%      \r\n##  8 Premier League (England) Championship (England)   0.334            0.0521 17%      \r\n##  9 Premier League (England) Super Lig (Turkey)       0.358            0.0559 18%      \r\n## 10 Premier League (England) Premier League (Russia)  0.491            0.0766 25%      \r\n## # ... with 246 more rows\r\n\r\n\r\n\r\n\r\nImprovements & Further Work\r\nAlthough my approach does eventually get back to the original units (VAEP/90), it does feel a little convoluted. Aditya Kothari proposed re-defining the target variable in the regression to be the ratio of VAEP/minute (instead of a z-transformed difference in VAEP/90) between the leagues that a player moves to and from. (See his full post.) In my eyes, the main advantage of such an approach is that it is more direct. A player-level ratio embeds information about position and age—a forward will tend to have higher VAEP/minute than a defender, and will continue to have higher VAEP/minute than a defender after transferring—so normalizing for age and position is not necessarily justified. Additionally, the model’s league coefficients can be directly interpreted, unlike my approach. Perhaps the main disadvantage is sensitivity to low minutes played. 9\r\nAnother weakness in my approach is the assumption that relative league strengths are the same every year, which is most certainly not true. One could apply a decaying weight to past seasons to account for varying league strength.\r\nI would be hesitant to use my results to directly infer how a specific player will translate going from one league to another. My approach focuses on leagues and is more about the “average” player. One aught to include additional features about play style (e.g. touches, progressive passes, team role) if interested in predicting individual player performance with a high degree of accuracy.\r\nOne can swap out the response variable with other reasonable metrics of player performance, such as xG (which is more readily available than atomic VAEP). In fact, I did this myself and came up with the result below (showing in units of xG/90 instead of as a percentage, since most fans are accustomed to seeing xG and are used to it’s relative magnitude).\r\n\r\nOne could stay in the realm of just purely “power rankings” and focus more on the estimates and error. For example, in an earlier iteration of this methodology, I used a Bradley-Terry approach to come up with a distribution of estimates for each league.10 Here, the x-axis could be loosely interpreted as the log odds of one league winning in a match versus another league, although it’s not clear exactly what that means. (An “average” team from both leagues? A matchup of teams composed of “average” players from any team in each league?)\r\n\r\nNotably, I’m not using match results at all! Certainly a model could learn something from international and tournament matches. However, using match-level data would require a whole new approach. Also, most would agree that tournament data can be biased by atypical lineups. For example, a manager on one side may opt to rest their best players, saving them for domestic league games, while the other manager may play their side at full strength.11\r\nSample size is an issue on two levels: (1) the number of transfers (more data would be better) and (2) minutes played.\r\nRegarding (1), one could expand the data set by including all seasons played by a player that has played in more than one league, taking all combinations of seasons in different leagues (i.e. relaxing the the same-season or subsequent-season criteria). I actually did attempt this and found that overall the results were somewhat similar, but there were more questionable results overall. (Brazil’s Serie A was found to be the second strongest league overall with this approach.).\r\nRegarding (2), one has to make a choice to drop players with low minutes played to prevent outliers affecting the results of the model. However, in some cases, a loaned player coming in at the end of the season and making a huge impact can tell us a lot about the difference in strength of two leagues, so we may not want to drop some of the records after all. An empirical bayes adjustment to VAEP/90, not unlike the one described here by David Robinson, can help overcome this. Below shows how such an adjustment slightly “shrinks” VAEP/90 numbers, especially for those who played less.\r\n\r\nOn the topic of “shrinking”, we could have used ridge regression (regression with some penalty) to get more robust league estimates overall. However, there is a downside to ridge regression—we give up some level of interpretability.12 Nonetheless, the relative ranking of leagues would be more reliable with ridge regression.\r\nAncillary Take-away\r\nOne final thing I’d like to point out here: I think this whole approach really showcases the inference made possible by player stats (xG, possession value metrics like atomic VAEP, etc.) aggregated over long periods of time. While such stats are often used to evaluate player performance in single games or even for singular in-game actions, they are most effective in providing insight when employed in higher-level analyses.\r\n\r\nValuing Actions by Estimating Probabilities (VAEP) based on the atomic SPADL format.↩︎\r\nI had a Twitter thread in May 2021 describing how one could use VAEP ratings.↩︎\r\nIt’s closer to xG+xA, although the authors might disagree with that as well. It’s really best treated separately, which perhaps explains why the authors often using “rating” and “contribution” when referring to VAEP.↩︎\r\nEach row represents one player. Each row only has one +1 and one -1, and 0s for other features.↩︎\r\nWe’re including all positions and ages in this regression, even though these groupings have varying standard deviations for transformation of the response variable. (All have 0 mean, as one might expect with a feature representing the difference between values with the same distribution.)↩︎\r\nThis NA occurs even when setting the intercept to 0, which is typically the way to get around this kind of issue with lm in R. When changing the order of columns in the regression and forcing the Netherlands coefficient to be non-NA, it’s estimate is lower than that of Bundesliga 2 (and a different league’s estimate is NA).↩︎\r\n“Weighted-average”: Diff. (VAEP/90) = (Diff. * sum(SD * (N * sum(N)))) - sum(Mean * (N * sum(N)))↩︎\r\nThis is also a weakness of my approach, but arguably ratios exacerbate this.↩︎\r\nThis is also a weakness of my approach, but arguably ratios exacerbate this.↩︎\r\nHere I was treating the Champions League and Europa as their own “leagues”, purely out of curiosity.↩︎\r\nArguably you’ll have this kind of issue no matter what, due to injuries.↩︎\r\n“Un-transformation” becomes more difficult since we have to account for the ridge penalty.↩︎\r\n",
    "preview": "posts/soccer-league-strength/featured.png",
    "last_modified": "2021-07-01T22:10:58-05:00",
    "input_file": {},
    "preview_width": 4800,
    "preview_height": 2400
  },
  {
    "path": "posts/fantasy-football-schedule-problem/",
    "title": "Fantasy Football and the Classical Scheduling Problem",
    "description": "Brute Force Programming Go Brrr",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2021-01-11",
    "categories": [
      "r",
      "python",
      "football (american)"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nProblem\r\nConstraint Programming\r\nAlternative: Exhaustive Search\r\nApplication\r\nTake-away\r\n\r\nIntroduction\r\nEvery year I play in several fantasy football (American) leagues. For those who are unaware, it’s a game that occurs every year in sync with the National Football League (NFL) where participants play in weekly head-to-head games as general managers of virtual football teams. (Yes, it’s very silly.) The winner at the end of the season is often not the player with the team that scores the most points; often a fortunate sequence of matchups dictates who comes out on top.\r\nI didn’t fare so well this year in one of my leagues, but my disappointing placement was not due to my team struggling to score points; rather, I was extremely unlucky. I finished the season in 7th place despite scoring the most points!\r\nThis inspired me to quantify just how unlikely I was. The most common way to calculate the likelihood of a given team’s ranking in a league with is with a Monte Carlo simulation based on some parameterized model of scoring to generate probabilities for the final standings. FiveThirtyEight uses such a model for their soccer models, for example. For a setting in which team scores are independent of one another, such as fantasy football, another approach is to simply calculate what each team’s record would be if they had played every other team each week. (So, if your league has 10 teams and each plays each other once, each team would have a hypothetical count of 90 games played.) However, I was particularly interested in answering the question: “In how many different schedules would I have finished where I did?”\r\nProblem\r\nFiguring out how unlucky I was to finish 7th requires me to first figure out how many possible schedules there are. Formally, the problem can be put as follows1:\r\n\r\nLet \\(T={t_1, ., t_n}\\) be a set of an even \\(n\\) teams. Let \\(R\\) denote a round consisting of a set of pairs \\((t_i, t_j)\\) (denoting a match), such that \\(0 < i <j ??? n\\), and such that each team in \\(T\\) is participates exactly once in \\(R\\). Let \\(S\\) be a schedule consisting of a tuple of \\(n???1\\) valid rounds \\((R_1, ., R_{n???1})\\), such that all rounds in \\(S\\) are pair-wise disjoint (no round shares a match). How many valid constructions of \\(S\\) are there for \\(n\\) input teams?\r\n\r\nFor a small number of teams, it’s fairly simple to write out all possible combinations of matchups. For example, for a two-team league (where each team plays each other once), there is only one possible schedule (solution)—Team 1 vs. Team 2. For a four-team league, there are six possible schedules. Two are shown below.\r\n\r\nsolution\r\nround\r\nteam1\r\nteam2\r\n1\r\n1\r\n1\r\n2\r\n\r\n\r\n3\r\n4\r\n\r\n2\r\n1\r\n3\r\n\r\n\r\n2\r\n4\r\n\r\n3\r\n1\r\n4\r\n\r\n\r\n2\r\n3\r\n2\r\n1\r\n1\r\n3\r\n\r\n\r\n2\r\n4\r\n\r\n2\r\n1\r\n2\r\n\r\n\r\n3\r\n4\r\n\r\n3\r\n1\r\n4\r\n\r\n\r\n2\r\n3\r\n\r\nNote that there is no concept of “home advantage” in fantasy football, so the order of teams in a given matchup does not matter. Also, note that if our restriction (“constraint”) that each team must play each other once and only once, implies that the number of teams has to be an even number.\r\nConstraint Programming\r\nTo truly answer this question, we can turn to constraint programming. If you’re familiar with constraint programming, then you’ll notice that this set-up is similar to the canonical nurse scheduling problem and is a specific form of the tournament problem.\r\nBelow is some python code that is able to identify the number feasible solutions for four teams. I print out the first solution for illustrative purposes.\r\n\r\nfrom ortools.sat.python import cp_model\r\n\r\nclass SolutionPrinter(cp_model.CpSolverSolutionCallback):\r\n    def __init__(self, games, n_team, n_show=None):\r\n        cp_model.CpSolverSolutionCallback.__init__(self)\r\n        self._games = games\r\n        self._n_show = n_show\r\n        self._n_team = n_team\r\n        self._n_sol = 0\r\n\r\n    def on_solution_callback(self):\r\n        self._n_sol += 1\r\n        print()\r\n        if self._n_show is None or self._n_sol <= self._n_show:\r\n            print(f'Solution {self._n_sol}.')\r\n            for team1 in range(self._n_team):\r\n                for team2 in range(self._n_team):\r\n                    if team1 != team2:\r\n                        print(\r\n                            f'Team {team1 + 1} vs. Team {team2 + 1} in Round {self.Value(self._games[(team1, team2)])}'\r\n                        )\r\n        else:\r\n            print(f'Found solution {self._n_sol}.')\r\n\r\n    def get_n_sol(self):\r\n        return self._n_sol\r\n\r\nn_team = 4\r\nn_w = n_team - 1\r\nmodel = cp_model.CpModel()\r\ngames = {}\r\nfor team1 in range(n_team):\r\n    for team2 in range(n_team):\r\n        if team1 != team2:\r\n            games[(team1, team2)] = model.NewIntVar(1, n_w, f'{team1:02}_{team2:02}')\r\n\r\nfor team1 in range(n_team):\r\n    for team2 in range(n_team):\r\n        if team1 != team2:\r\n            model.Add(games[(team1, team2)] == games[(team2, team1)])\r\n\r\n\r\n# Each team can only play in 1 game each week\r\nfor t in range(n_team):\r\n    model.AddAllDifferent(\r\n        [games[(t, team2)] for team2 in range(n_team) if t != team2]\r\n    )\r\n\r\nsolver = cp_model.CpSolver()\r\nsolution_printer = SolutionPrinter(games, n_team=n_team, n_show=2)\r\nstatus = solver.SearchForAllSolutions(model, solution_printer)\r\n\r\nprint()\r\nprint(f'Solve status: {solver.StatusName(status)}')\r\nprint(f'Solutions found: {solution_printer.get_n_sol()}')\r\n\r\n\r\n# Solution 1.\r\n# Team 1 vs. Team 2 in Round 3\r\n# Team 1 vs. Team 3 in Round 2\r\n# Team 1 vs. Team 4 in Round 1\r\n# Team 2 vs. Team 1 in Round 3\r\n# Team 2 vs. Team 3 in Round 1\r\n# Team 2 vs. Team 4 in Round 2\r\n# Team 3 vs. Team 1 in Round 2\r\n# Team 3 vs. Team 2 in Round 1\r\n# Team 3 vs. Team 4 in Round 3\r\n# Team 4 vs. Team 1 in Round 1\r\n# Team 4 vs. Team 2 in Round 2\r\n# Team 4 vs. Team 3 in Round 3\r\n# \r\n# Found solution 2.\r\n# \r\n# Found solution 3.\r\n# \r\n# Found solution 4.\r\n# \r\n# Found solution 5.\r\n# \r\n# Found solution 6.\r\n# \r\n# Solve status: OPTIMAL\r\n# Solutions found: 6\r\n\r\nEasy enough to run for 10 teams and get an answer, right? WRONG. Turns out this the number of feasible solutions (schedules) starts to blow up really quickly. In fact, I believe the number of solutions for this particular problem is only known up to 14 teams. (I’ve intentionally left the numbers un-rounded to emphasize just how much the number of solutions increases as a function of the number of teams.)\r\n\r\nn\r\nsolutions\r\n2\r\n1\r\n4\r\n6\r\n6\r\n720\r\n8\r\n31,449,600\r\n10\r\n444,733,651,353,600\r\n12\r\n10,070,314,878,246,925,803,220,024\r\n14\r\n614,972,203,951,464,579,840,082,248,206,026,604,282\r\n\r\nUnless you happen to be an expert in graph theory and combinatorics, you probably wouldn’t be able to figure this out by hand; for us non-experts out there, we can refer to a known sequence of 1-factorizations of a complete graph \\(K_{2n}\\) and use our brain to figure out permutations in a given round. (Don’t worry if that makes no sense.)\r\nWhy do I bring this up? Well, I realized that generating all possible schedules for a 10-team league (such as my aforementioned league) is just not reasonable for anyone without a supercomputer and a lot of time. I enhanced the above python code a bit and tried it out for a 10-team league and was only able to generate a couple of million solutions after 3 hours.\r\nAlternative: Exhaustive Search\r\nThe failure to generate all solutions made me reconsider things a bit. If I can’t reasonably “have it all”, I should simplify things a bit. By “simplify”, I mean perform an “exhaustive” (or \"brute-force) search that stops after a specified number of solutions. And, by re-writing things in R, I can eliminate dependencies on Google’s ortools package and python. (Both are great, but, nonetheless, they are potential obstacles for R users.)\r\nWriting a script to perform an exhaustive search is not so easy itself, and, in this case, requires a completely different approach to the problem. My steps are as follows:\r\nSet up an \\(n\\) x \\(n-1\\) matrix, where the \\(n\\) rows designate teams and the \\(n-1\\) columns designate rounds.\r\n\r\n\r\nleague_size = 4\r\nrounds <- league_size - 1\r\nmat <- matrix(nrow = league_size, ncol = rounds)\r\nmat\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]   NA   NA   NA\r\n# [2,]   NA   NA   NA\r\n# [3,]   NA   NA   NA\r\n# [4,]   NA   NA   NA\r\n\r\n\r\n\r\nRandomly select the opponent of team 1 in round 1.\r\n\r\n\r\nteam_i <- 1\r\nround_i <- 1\r\nretry_i <- 1\r\nidx_team <- 1:league_size\r\nset.seed(1)\r\n\r\nteam_1_round_1 <- sample(2:league_size, 1, replace = FALSE)\r\nmat[team_i, round_i] <- team_1_round_1\r\nmat\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]    2   NA   NA\r\n# [2,]   NA   NA   NA\r\n# [3,]   NA   NA   NA\r\n# [4,]   NA   NA   NA\r\n\r\n\r\n\r\nFind a unique set of opponents for teams 2 through \\(n\\) to fill the rest of the cells in column 1.\r\n\r\n\r\nwhile(team_i <= league_size) {\r\n  if(team_i %in% teams_already_matched) {\r\n    team_i_round_i <- which(team_i == teams_already_matched)\r\n    mat[team_i, round_i] <- team_i_round_i\r\n    team_i <- team_i + 1\r\n  } else {\r\n    teams_cant_match <- unique(c(teams_already_indexed, teams_already_matched))\r\n    teams_unmatched <- setdiff(teams_possible, teams_cant_match)\r\n    n_matched <- length(teams_unmatched)\r\n    if(n_matched == 0) {\r\n      mat[2:league_size, round_i] <- NA\r\n      team_i <- 2\r\n    } else {\r\n      team_i_round_i <- if(n_matched == 1) {\r\n        teams_unmatched\r\n      } else {\r\n        sample(teams_unmatched, 1)\r\n      }\r\n\r\n      mat[team_i, round_i] <- team_i_round_i\r\n      team_i <- team_i + 1\r\n    }\r\n  }\r\n}\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]    2   NA   NA\r\n# [2,]    1   NA   NA\r\n# [3,]    4   NA   NA\r\n# [4,]    3   NA   NA\r\n\r\n\r\n\r\nIdentify a unique set of opponents for team 1 for all other rounds (rounds 2 through \\(n-1\\)).\r\n\r\n\r\nteams_possible <- setdiff(idx_team, c(1, team_1_round_1))\r\nteam1_all_rounds <- sample(teams_possible, size = length(teams_possible))\r\nmat[1, 2:rounds] <- team1_all_rounds\r\nmat\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]    2    3    4\r\n# [2,]    1   NA   NA\r\n# [3,]    4   NA   NA\r\n# [4,]    3   NA   NA\r\n\r\n\r\n\r\nRepeat step 3 for rounds 2 through \\(n-2\\) (penultimate round).\r\n\r\n\r\nwhile(round_i < rounds) {\r\n  team_i <- 2\r\n  while(team_i <= league_size) {\r\n    teams_possible <- setdiff(idx_team, team_i)\r\n    teams_already_indexed <- 1:(team_i - 1)\r\n    teams_already_matched <- mat[teams_already_indexed, round_i]\r\n    teams_already_played <- mat[team_i, 1:(round_i - 1)]\r\n    reset <- FALSE\r\n    if(team_i %in% teams_already_matched) {\r\n      team_i_round_i <- which(team_i == teams_already_matched)\r\n      if(any(team_i_round_i == teams_already_played)) {\r\n        reset <- TRUE\r\n      }\r\n    } else {\r\n      teams_cant_match <-\r\n        unique(c(teams_already_indexed, teams_already_matched, teams_already_played))\r\n      teams_unmatched <- setdiff(teams_possible, teams_cant_match)\r\n      n_matched <- length(teams_unmatched)\r\n      if (n_matched == 0) {\r\n        reset <- TRUE\r\n      } else {\r\n        team_i_round_i <- if(n_matched == 1) {\r\n          teams_unmatched\r\n        } else {\r\n          sample(teams_unmatched, 1)\r\n        }\r\n      }\r\n    }\r\n    \r\n    if(reset) {\r\n      mat[2:league_size, round_i] <- NA\r\n      team_i <- 2\r\n      retry_i <- retry_i + 1\r\n    } else {\r\n      mat[team_i, round_i] <- team_i_round_i\r\n      team_i <- team_i + 1\r\n    }\r\n  }\r\n  round_i <- round_i + 1\r\n}\r\nmat\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]    2    3    4\r\n# [2,]    1    4   NA\r\n# [3,]    4    1   NA\r\n# [4,]    3    2   NA\r\n\r\n\r\n\r\nIdentify the only valid set of matchups for the last round \\(n-1\\).\r\n\r\n\r\nidx_not1 <- 2:league_size\r\ntotal <- Reduce(sum, idx_team) - idx_not1\r\nrs <- rowSums(mat[idx_not1, 1:(rounds - 1)])\r\nteams_last <- total - rs\r\nmat[idx_not1, rounds] <- teams_last\r\nmat\r\n\r\n\r\n\r\n\r\n\r\n#      [,1] [,2] [,3]\r\n# [1,]    2    3    4\r\n# [2,]    1    4    3\r\n# [3,]    4    1    2\r\n# [4,]    3    2    1\r\n\r\n\r\n\r\nThat is the core of the solution. The rest of the work2 involves repeating the steps for however many times you want, always checking for duplicates of previous solutions, i.e. sampling without replacement. (Or, if you don’t care about schedules being unique, i.e. sampling with replacement, it’s even easier.)\r\nApplication\r\nSince generating unique schedules is something I’d like to be able to do every year for my fantasy football leagues, I wrote a package for it, called {ffsched}. The package includes functionality to retrieve your league’s fantasy scores from ESPN, which you can combine with the simulated schedules to generate a plot such as the following.\r\n\r\nIt’s immediately evident how un-lucky I (“Tony El Tigre”) was. In the 100,000 simulations, I never finished below 7th, and I only finished 7th 1.1% of the time!\r\nIn the previous year I scored the most points and finished first. “The Juggernaut” got the short end of the stick in 2019, finishing 7th. He only finished 7th or lower in 6.6% of schedules.\r\n\r\nTake-away\r\nAn exhaustive search as a work-around for true constraint programming isn’t always elegant and can be difficult to implement, but if you’re motivated enough to do it—as I was to prove my extreme lack of fortune—it can generate what you need to make a compelling point. My use case (for generating unique fantasy generating football schedules) is inconsequential, but such techniques are often immensely important in real world contexts.\r\n\r\nThis is almost directly taken from https://math.stackexchange.com/questions/284416/how-many-possible-arrangements-for-a-round-robin-tournament.↩︎\r\nIn fantasy football, teams often play each other more than once in a year (depending on your league size), so I’ve somewhat simplified the problem for the purpose of this post. More work could be done to figure out the number of possibilities when more than one game has to be scheduled for each pair of teams.↩︎\r\n",
    "preview": "posts/fantasy-football-schedule-problem/viz_standings_tile_2020.png",
    "last_modified": "2021-07-01T22:13:53-05:00",
    "input_file": {},
    "preview_width": 3600,
    "preview_height": 2400
  },
  {
    "path": "posts/decomposition-smoothing-soccer/",
    "title": "Decomposition and Smoothing",
    "description": "With data.table, reticulate, and spatstat",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2020-10-14",
    "categories": [
      "r",
      "soccer"
    ],
    "contents": "\r\n\r\nContents\r\nData\r\nNon-Equi Joining with {data.table}\r\nNon-Negative Matrix Factorization (NNMF) with {reticulate} and sklearn\r\nGaussian Smoothing with {spatstat}\r\nConclusion\r\n\r\nWhile reading up on modern soccer analytics (I’ve had an itch for soccer and tracking data recently, I stumbled upon an excellent set of tutorials written by Devin Pleuler. In particular, his notebook on non-negative matrix factorization (NNMF) caught my eye. I hadn’t really heard of the concept before, but it turned out to be much less daunting once I realized that it is just another type of matrix decomposition. Singular value decomposition (SVD), which I’m much more familiar with, belongs to the same family of calculations (although NNMF and SVD are quite different). In an effort to really gain a better understanding of NNMF, I set out to emulate his notebook.\r\nIn the process of converting his python code to R, I encountered three challenges with resolutions worth documenting.\r\nBefore the NNMF calculation, I needed to perform non-equi join with a fairly size-able data set. Unfortunately, {dplyr}1 does not have built-in support for such a join. I tossed aside any kind of personal implicit bias against {data.table}—which is certainly the go-to option in the R ecosystem for non-equi joins—and used it for this process.\r\nFor the NNMF calculation, the only R implementation (that I could find) comes with the {NMF} package2, which requires the installation of the Bioconductor-exclusive {BiocManager} package. I’m relatively unfamiliar with Bioconductor, so this was not very appealing (although I did end up downloading {NMF} and trying it out). Instead, I ended up using {reticulate} to call the skearn.decomposition.NMF() function directly (as is done in the python code). This is a perfect example of using {reticulate} for a non-trivial reason (i.e. for an algorithm).\r\nAfter the NNMF computation, I needed to perform 2-D Gaussian smoothing, which is helpful for making the output of the NNMF output more interpretable. The {spatstat} package had just the function for the job (spatstat::blur()), and it all it took for me was to write some a tidy wrapper function to integrate it nicely into my workflow.\r\nI’ve always considered myself a “whatever gets the job done” kind of person, not insistent on ignoring solutions that use “base” R, {data.table}, python, etc. Nonetheless, replicating Devin’s notebook really underscored the importance of being comfortable outside of a {tidyverse}-centric workflow.\r\nAnyways, this post outlines the code and my thought process in porting Devin’s code to R. I’ll skip some of the details, emphasizing the things that are most interesting.\r\nData\r\nWe’ll be working with the open-sourced StatsBomb data for the 2018 Men’s World Cup, which I’ve called events below. 3\r\nThis is a relatively large data set with lots of columns (and rows). However, we only need three columns for what we’re going to do: (1) a unique identifier for each player, player_id, along with their (2) x and (3) y coordinates.\r\n\r\n\r\nlibrary(tidyverse)\r\n\r\n\r\n\r\nA quick summary of the data shows that there are 603 unique players, and that the x and y coordinates range from 1 to 120 (yards) and 1 to 80 respectively.\r\n\r\n\r\nevents %>% \r\n  summarize(\r\n    n = n(),\r\n    n_player = n_distinct(player_id),\r\n    across(c(x, y), list(min = min, max = max, mean = mean))\r\n  )\r\n\r\n\r\n\r\nNon-Equi Joining with {data.table}\r\nOur first challenge is to convert the following chunk of python.\r\n\r\nimport numpy as np\r\n\r\nx_scale, y_scale = 30, 20\r\n\r\nx_bins = np.linspace(0, 120, x_scale)\r\ny_bins = np.linspace(0, 80, y_scale)\r\n\r\nplayers = {}\r\n\r\nfor e in events:\r\n    if 'player' in e.keys():\r\n        player_id = e['player']['id']\r\n        if player_id not in players.keys():\r\n            players[player_id] = np.zeros((x_scale, y_scale))\r\n        try:\r\n            x_bin = int(np.digitize(e['location'][0], x_bins[1:], right=True))\r\n            y_bin = int(np.digitize(e['location'][1], y_bins[1:], right=True))\r\n            players[player_id][x_bin][y_bin] += 1\r\n        except:\r\n            pass\r\n\r\nThis code creates a nested dict, where the keys are player id’s and the values are 20x30 matrices. Each element in the matrix is an integer that represents the count of times that the player was recorded being at a certain position on the pitch. (These counts range from 0 to 94 for this data set.)\r\nSome technical details:\r\nThe python events is actually a pretty heavily nested list4, hence the non-rectangular operations such as e['player']['id'].\r\nObservations with missing coordinates are ignored with the try-except block.\r\nx and y values (elements of the 'location' sub-list) are mapped to “bins” using numpy’s digitize() function, which is analogous to base::cut().\r\nHow can we do this same data manipulation in an idiomatic R fashion? We could certainly create a named list element and use base::cut() to closely match the python approach. However, I prefer to stick with data frames and SQL-ish operations since I think these are much more “natural” for R users.5\r\nSo, going forward with data frames and joins, it’s quickly apparent that we’ll have to do some non-equi joining. {fuzzyjoin} and {sqldf} offer functionality for such an approach, but {data.table} is really the best option. The only minor inconvenience here is that we have to explicitly coerce our events data frame to a data.table.\r\nWe’ll also need a helper, grid-like data frame to assist with the binning. The 600-row grid_xy_yards data frame (30 x bins * 20 y bins) below is essentially a tidy definition of the cells of the grid upon which we are binning the events data. (One can use whatever flavor of crossing(), expand.grid(), seq(), etc. that you prefer to create a data frame like this.)\r\nVisually, this grid looks like this.\r\n\r\nAnd if you prefer numbers instead of a chart, see the first 10 rows below.\r\n\r\n\r\ngrid_xy_yards\r\n\r\n\r\n\r\nTwo things to note about this supplementary data frame:\r\nCells aren’t evenly spaced integers, i.e. x cells are defined at 0, 4.138, 8.276, …, 80 instead of something like 0, 4, 8, …, 80, and y cells are defined at 0, 4.211, 8.421, …, 120 instead of something like 0, 4, 8, …, 120). That’s simply due to using 30 and 20 instead of 31 and 21 to split up the x and y ranges respectively. I point this out because this SQL-ish approach would have been much easier if these numbers were just integers! We could have done an inner join on an integer grid instead of non-equi-joining upon a grid of floating point numbers. Unfortunately, joining on floating point numbers as keys leads to inconsistent results, simply due to the nature of floating points.6\r\nThe index idx is important! This will come back into play when we do the NNMF procedure, at which point we’ll “flatten” out our x-y pairs into a 1-d format.\r\nOk, on to the actual data joining.\r\n\r\n\r\nevents_dt <- events %>% drop_na() %>% data.table::as.data.table()\r\ngrid_xy_yards_dt <- grid_xy_yards %>% data.table::as.data.table()\r\n\r\n# We don't even have to load `{data.table}` for this to work!\r\nevents_binned <-\r\n  events_dt[grid_xy_yards_dt, on=.(x > x, x <= next_x, y >= y, y < next_y)] %>% \r\n  as_tibble() %>% \r\n  select(player_id, idx, x, y)\r\nevents_binned\r\n\r\n\r\n\r\nIn retrospect, this join was pretty straightforward!\r\nThe rest of the code below is just doing the actual tallying.\r\nFirst, we make an intermediate data set grid_players, which is the Cartesian product of all possible cells in the grid and all players in events.\r\nSecond, we “add back” missing cells to events_binned using the intermediate data set grid_players.\r\nIn the end, we end up with a players data frame with 603 player_ids * 30 x bins * 20 y bins = 361,800 rows.\r\n\r\n\r\n# This `dummy` column approach is an easy way to do a Cartesian join when the two data frames don't share any column names.\r\ngrid_players <-\r\n  grid_xy_yards %>% \r\n  mutate(dummy = 0L) %>% \r\n  # Cartesian join of all possible cells in the grid and all players in `events`.\r\n  full_join(\r\n    events %>% \r\n      drop_na() %>% \r\n      distinct(player_id) %>% \r\n      mutate(dummy = 0L),\r\n    by = 'dummy'\r\n  )\r\n\r\nplayers <-\r\n  events_binned %>% \r\n  group_by(player_id, x, y, idx) %>% \r\n  summarize(n = n()) %>% \r\n  ungroup() %>% \r\n  # Rejoin back on the grid to 'add back' cells with empty counts (i.e. `n = 0`).\r\n  full_join(grid_players, by = c('player_id', 'x', 'y', 'idx')) %>% \r\n  select(-dummy, -next_x, -next_y) %>% \r\n  replace_na(list(n = 0L)) %>% \r\n  arrange(player_id, x, y)\r\nplayers\r\n\r\n\r\n\r\nTo make this a little bit more tangible, let’s plot Messi’s heatmap. (Is this really a blog post about soccer if it doesn’t mention Messi 😆?)\r\n\r\nNon-Negative Matrix Factorization (NNMF) with {reticulate} and sklearn\r\nNext up is the actual NNMF calculation. I don’t care if you’re the biggest R stan in the world—you have to admit that the python code to perform the NNMF is quite simple and (dare I say) elegant. The comps=30 here means\r\n\r\nfrom sklearn.decomposition import NMF\r\n\r\n# Flatten individual player matrices into shape=(600,) which is the product of the original shape components (30 by 20)\r\nunraveled = [np.matrix.flatten(v) for k, v in players.items()]\r\ncomps = 30\r\nmodel = NMF(n_components=comps, init='random', random_state=0)\r\nW = model.fit_transform(unraveled)\r\n\r\nMy understanding is that comps=30 is telling the algorithm to reduce our original data (with 603 players) to a lower dimensional space with 30 player “archetypes” that best represent the commonalities among the 603 players.7 Per Devin, the choice of 30 here is somewhat arbitrary. In practice, one might perform some cross validation to identify what number minimizes some loss function, but that’s beyond the scope of what we’re doing here.\r\nAfter re-formatting our players data into a wide format—equivalent to the numpy.matrix.flatten() call in the python code—we could use the {NMF} package for an R replication.\r\n\r\n\r\n# Convert from tidy format to wide format (603 rows x 600 columns)\r\nplayers_mat <-\r\n  players %>% \r\n  drop_na() %>% \r\n  select(player_id, idx, n) %>% \r\n  pivot_wider(names_from = idx, values_from = n) %>% \r\n  select(-player_id) %>% \r\n  as.matrix()\r\n\r\ncomps <- 30L\r\nW <- NMF::nmf(NMF::rmatrix(players_mat), rank = comps, seed = 0, method = 'Frobenius')\r\n\r\n\r\n\r\nHowever, I found that the results weren’t all that comparable to the python results. (Perhaps I needed to define the arguments in a different manner.) So why not use {reticulate} and call the sklearn.decomposition.NMF() function to make sure that we exactly emulate the python decomposition?\r\n\r\n\r\nsklearn <- reticulate::import('sklearn')\r\n# Won't work if `n_components` aren't explicitly defined as integers!\r\nmodel <- sklearn$decomposition$NMF(n_components = comps, init = 'random', random_state = 0L)\r\nW <- model$fit_transform(players_mat)\r\n\r\n\r\n\r\nThe result includes 30 20x30 matrices—one 30x20 x-y matrix for each of the 30 components (comps). We have some wrangling left to do to gain anything meaningful from this NNMF procedure, but we have something to work with!\r\nGaussian Smoothing with {spatstat}\r\nThe last thing to do is to post-process the NNMF results and, of course, make pretty plots. The python plotting is pretty standard matplotlib, with the exception of the Gaussian smoothing performed on each component’s matrix model.component_ in the loop to make sub-plots.\r\n\r\nfrom scipy.ndimage import gaussian_filter\r\n\r\nfor i in range(9):\r\n    # ... Excerpted\r\n    z = np.rot90(gaussian_filter(model.components_[i].reshape(x_scale, y_scale), sigma=1.5), 1)\r\n    # ... Excerpted\r\n\r\nThe first 9 smoothed component matrices come out looking like this. 8\r\n\r\nThere’s a couple of steps involved to do the same thing in R.\r\nFirst, we’ll convert the components matrices to a tidy format, decomp_tidy\r\nSecond, we’ll join our tidied components matrices with our tidy grid of cells, grid_xy_yards, and convert our x and y bins to integers in preparation of the matrix operation performed in the subsequent step.\r\nLastly, we’ll perform the Gaussian smoothing on nested data frames with a custom function, smoothen_dimension, that wraps spatstat::blur(). This function also maps idx back to field positions (in meters instead of yards) using the supplementary grid_xy_rev_m9 data frame (which is a lot like grid_xy_yards)\r\n\r\n\r\n## 1\r\ndecomp_tidy <-\r\n  model$components_ %>% \r\n  as_tibble() %>% \r\n  # \"Un-tidy\" tibble with 30 rows (one for each dimension) and 600 columns (one for every `idx`)\r\n  mutate(dimension = row_number()) %>% \r\n  # Convert to a tidy tibble with dimensions * x * y rows (30 * 30 * 20 = 18,000)\r\n  pivot_longer(-dimension, names_to = 'idx', values_to = 'value') %>% \r\n  # The columns from the matrix are named `V1`, `V2`, ... `V600` by default, so convert them to an integer that can be joined on.\r\n  mutate(across(idx, ~str_remove(.x, '^V') %>% as.integer()))\r\n\r\n## 2\r\ndecomp <-\r\n  decomp_tidy %>% \r\n  # Join on our grid of x-y pairs.\r\n  inner_join(\r\n    # Using `dense_rank` because we need indexes here (i.e. 1, 2, ..., 30 instead of 0, 4.1, 8.2, ..., 120 for `x`).\r\n    grid_xy_yards %>% \r\n      select(idx, x, y) %>% \r\n      mutate(across(c(x, y), dense_rank))\r\n  )\r\n\r\n## 3\r\nsmoothen_component <- function(.data, ...) {\r\n  mat <-\r\n    .data %>% \r\n    select(x, y, value) %>% \r\n    pivot_wider(names_from = x, values_from = value) %>% \r\n    select(-y) %>% \r\n    as.matrix()\r\n  \r\n  mat_smoothed <-\r\n    mat %>% \r\n    spatstat::as.im() %>% \r\n    # Pass `sigma` in here.\r\n    spatstat::blur(...) %>% \r\n    # Could use `spatstat::as.data.frame.im()`, but it converts directly to x,y,value triplet of columns, which is not the format I want.\r\n    pluck('v')\r\n  \r\n  res <-\r\n    mat_smoothed %>% \r\n    # Convert 20x30 y-x matrix to tidy format with 20*30 rows.\r\n    as_tibble() %>% \r\n    mutate(y = row_number()) %>% \r\n    pivot_longer(-y, names_to = 'x', values_to = 'value') %>% \r\n      # The columns from the matrix are named `V1`, `V2`, ... `V30` by default, so convert them to an integer that can be joined on.\r\n    mutate(across(x, ~str_remove(.x, '^V') %>% as.integer())) %>% \r\n    arrange(x, y) %>% \r\n    # \"Re-index\" rows with `idx`, ranging from 1 to 600.\r\n    mutate(idx = row_number()) %>% \r\n    select(-x, -y) %>% \r\n    # Convert `x` and `y` indexes (i.e. 1, 2, 3, ..., to meters and flip the y-axis).\r\n    inner_join(grid_xy_rev_m) %>% \r\n    # Re-scale smoothed values to 0-1 range.\r\n    mutate(frac = (value - min(value)) / (max(value) - min(value))) %>% \r\n    ungroup()\r\n  res\r\n}\r\n\r\ndecomp_smooth <-\r\n  decomp %>% \r\n  nest(data = -c(dimension)) %>% \r\n  # `sigma` passed into `...` of `smoothen_component()`. (`data` passed as first argument.)\r\n  mutate(data = map(data, smoothen_component, sigma = 1.5)) %>% \r\n  unnest(data)\r\ndecomp_smooth\r\n\r\n\r\n\r\nWith the data in the proper format, the plotting is pretty straightforward {ggplot2} code (so it’s excerpted).\r\n\r\nViola! I would say that our R version of the python plot is very comparable (just by visual inspection). Note that we could achieve a similar visual profile without the smoothing—see below—but the smoothing undoubtedly makes pattern detection a little less ambiguous.\r\n\r\nFrom the smoothed contours, we can discern several different player profiles (in terms of positioning).\r\nComponents 1, 5, 9: left back\r\nComponents 2: right midfielder\r\nComponent 3: attacking right midfielder\r\nComponent 4: wide left midfielder\r\nComponent 6: central left midfielder\r\nComponents 7, 8: goalkeeper\r\nThe redundancy with left back and goalkeeper is not ideal. That’s certainly something we could fine tune with more experimentation with components. Anyways, the point of this post wasn’t so much about the insights that could be gained (although that’s ultimately what stakeholders would be interested in if this were a “real” analysis).\r\nConclusion\r\nTranslating python code can be challenging, throwing us off from our typical workflow (for me, being {tidyverse}-centric). But hopefully one can see the value in “doing whatever it takes”, even if it means using “non-tidy” R functions (e.g. {data.table}, matrices, etc.) or a different language altogether.\r\n\r\nthe go-to package for data manipulation and all SQL-ish things↩︎\r\nNon-negative matrix factorization may also be abbreviated just as NMF, hence the package name.↩︎\r\nThere’s nothing too interesting about the data retrieval—I’ve essentially just called StatsBombR::FreeCompetitions(), StatsBombR::FreeMatches(),StatsBombR::FreeEvents(), and StatsBombR::allclean() in succession for competition_id = 43.↩︎\r\nminimally converted from the original JSON format↩︎\r\ncompared to dict and lists or python users↩︎\r\nA potential solution would be to round the floating point numbers before joining and “restore” them after the join, but that’s just kluge-y and inelegant.↩︎\r\nI believe the number of components is analogous to the number of components that one would define in performing principal components analysis (PCA).↩︎\r\nThere is nothing stopping us from plotting all 30 components—and, in fact, Devin does in his notebook—but I think it’s easier to digest a fraction of the components (for pedagogical purposes).↩︎\r\nStatsBomb data treats the origin as the top-left corner of the pitch, which I find inconvenient for plotting since I prefer the origin to be the bottom left. Thus, this grid also flip the y-axis of the grid, hence the _rev part of the variable name.↩︎\r\n",
    "preview": "posts/decomposition-smoothing-soccer/viz_nnmf_dimensions_1to9_r_smooth.png",
    "last_modified": "2021-07-01T22:08:27-05:00",
    "input_file": {},
    "preview_width": 3000,
    "preview_height": 2000
  },
  {
    "path": "posts/soccer-pitch-control-r/",
    "title": "Creating a Soccer Pitch Control Model",
    "description": "With S3 Classes and vctrs",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2020-09-23",
    "categories": [
      "r",
      "soccer"
    ],
    "contents": "\r\n\r\nContents\r\nIntro\r\nContructor\r\nValidator\r\nHelper\r\nAside\r\nPrinting\r\nBasic Usage\r\nPseudo-Encapsulation\r\nAdvanced Usage\r\nConclusion\r\n\r\nNote: This post was update on 2020-09-24 to correct field dimension translations that were previously distorting the pitch control contours. The R analogues now match up much more closely with the python versions after the updates.\r\nIntro\r\nThere’s never been a better time to be involved in sports analytics. There is a wealth of open-sourced data and code (not to mention well-researched and public analysis) to digest and use. Both people working for teams and people just doing at as a hobby are publishing new and interesting analyses every day.\r\nIn particular, the FriendsOfTracking (FOT) group, co-led by Professor and author David Sumpter1 have put together an awesome series of videos on YouTube discussing modern soccer analytics, along with a collection of repositories on GitHub sharing the code shown in videos.\r\nLaurie Shaw has shared code that implements the pitch control model described in William Spearman’s paper “Beyond Expected Goals” is interesting to me. The model is different than the one that I used to create some animations on Twitter. Those were based on the pitch control model described by Javier Fernandez and Luke Bornn in their paper “Wide Open Spaces” (code courtesy of Rob Hickman). (Apologies for the onslaught of links!)\r\nNow, I am not one for language wars—and, in fact, I use python often—but I thought it would be awesome to be able to plot Spearman’s pitch control model directly with {ggplot2} and friends. Thus, I set out to convert Laurie’s code to R, attempting to give it a “native” R feel while I was at it.\r\nMost of the process of translating python to R was relatively straightforward (slicing and dicing data frames and arrays/vectors is just part of data cleaning), so I won’t detail them here. However, there was one part that was particularly interesting—the conversion of a python class object. This was actually the key (and most challenging part) of the conversion process.\r\nThere are some great resources for describing how to implement object-orientated programming (OOP) in R, including a couple of chapter’s from Hadley Wickham’s Advanced R book and a very practical write-up from Earo Wang. Every object-oriented task has its unique aspects, so hopefully my discussion here has something to add to what has already been written on the subject matter.\r\nFor demonstration purposes, I’m going to walk through my steps for converting the python class object as if I were doing it for the first time.\r\nContructor\r\nBelow is a stripped down version of Laurie’s code, showing the “essence” of what we need to replicate.2\r\n\r\nclass player(object):\r\n    def __init__(self,player_id,frame):\r\n        self.id = player_id\r\n        self.get_position(frame)\r\n        self.get_velocity(frame)\r\n        \r\n    def get_position(self,frame):\r\n        self.position = np.array(frame[self.player_id + 'x', self.player_id + 'y'])\r\n        \r\n    def get_velocity(self,frame):\r\n        self.velocity = np.array(frame[self.player_id + 'x_v', self.player_id + 'y_v'])\r\n    \r\n    def tti(self,final_position):\r\n        reaction_time = 0.7 # in s\r\n        vmax = 5 # in m/s\r\n        reaction_position = self.position + self.velocity * reaction_time\r\n        self.tti = reaction_time + np.linalg.norm(final_positon - reaction_position)/vmax\r\n\r\n    def p_intercept(self,t):\r\n        tti_sigma = 0.45\r\n        den = 1 + np.exp(-np.pi/np.sqrt(3.0)/tti_sigma * (t-self.tti)))\r\n        return 1 / den\r\n\r\nLet’s make some notes and come back to these as we develop our R class.\r\nWe need a unique identifier: player_id. This is really just a “best practice” thing for object-oriented programming and makes sense given our context. For a sport like soccer, a unique identifier could just be the player’s name, a combination of the team name and the player jersey number, a league unique identifier, etc.\r\nA single-row data frame frame is passed to several of the methods, including the constructor __init__. This single row data frame is sourced from a much larger tracking data frame, with rows for every 0.04 second time interval (25 frames per second, or one frame per 0.04 seconds) in the game.\r\nThe python code stores both the player’s position and velocity as 2x1 arrays. This works well with the unpacking that is done in other places in Laurie’s code.\r\ntti, short for “time to intercept (a target location)”, uses the player’s position and velocity to define the attribute tti (not to be confused with the method itself). This implies that position and velocity should be defined before tti() is ever called, as they are in __init__. tti needs the position_final 2x1 array to calculate tti which is not known upon instantiation; rather, tti can only be properly defined when called to do a specific calculation relating the player’s position and velocity (both defined implicitly in the class, without needing user-specification) with a user-supplied position_final pair of x and y values.\r\np_intercept, short for “probability to intercept (a target location)” depends on tti and an additional parameter t, a user-specified value representing how much time is allotted to reach the ball. Like tti, p_intercept is only “properly” defined when actually doing a calculation on the player’s attributes. Unlike tti, there is no attribute in the player instance that stores this probability; it’s value must be saved in a variable external to the player class if the user wants to use it for something other than an ephemeral calculation.3\r\nTime to intercept a “target” location (tti) may not be intuitive to comprehend immediately. The plot4 below annotates the tti of a “target” location on the pitch (which does not have to be where the ball actually is). tti assumes that the player continues moving at their current speed (annotated by the arrows) for reaction_time seconds before running at vmax (full speed) to the target position. tti for each player is independent of the tti of all other players, which is a relatively reasonable assumption. 5\r\n\r\nThe probability of reaching the “target” location (p_intercept) is directly related to the player’s tti. Uncertainty about how long it will take the player to reach the target location is quantified by the constant tti_sigma in the calculation. (tti is the mean and tti_sigma is the standard deviation of the distribution for a player’s time to arrive at the target location.)\r\n\r\nNotably, this probability is independent of all other players’ probabilities (which explains how it is possible that both players are shown to have probabilities greater than 50% when t = 6 above). When adjusting for all players’ probabilities (by dividing by the sum of all probabilities), the numbers change. This probability adjustment is key when we calculate pitch control.\r\n\r\nOk, on to the R code. We’ll be using S3 and the {vctrs} package to help create our player class. (As with the python class, I’ve simplified the actual implementation for demonstration purposes.)\r\nFirst, we start with the constructor new_player(). Note that there is no direct __init__ equivalent in R. Here we will make a function that is prefixed with new_ and ends with the name of our class (player).\r\n\r\n\r\nnew_player <-\r\n  function(player_id = integer(),\r\n           x = double(),\r\n           y = double(),\r\n           x_v = double(),\r\n           y_v = double()) {\r\n    vctrs::new_rcrd(\r\n      list(\r\n        player_id = player_id,\r\n        x = x,\r\n        y = y,\r\n        x_v = x_v,\r\n        y_v = y_v,\r\n        tti = -1 # dummy value\r\n      ),\r\n      class = 'player'\r\n    )\r\n  }\r\n\r\n\r\n\r\nNow let’s reflect upon our prior notes.\r\nWe have the player_id in this constructor.\r\nWe don’t pass the data frame tracking here. We’ll do it in our helper function. We might say that our constructor is “low-level”, not intended for the user to call directly.\r\nWe split the position and velocity vectors into their individual x and y components, resulting in four total variables instead of two. I don’t think a vector (unnamed or named), list, or matrix are particularly compelling data types to use for an x-y pair of values in R. None natively support unpacking (although R vectors do have some form of “broadcasting” with their recycling behavior).\r\nWe assign a “dummy” value (-1) to tti when initializing the class instance. We will have a method to update tti based on x and y components.\r\nLike tti, we will need a separate p_intercept method to be used to calculate the probabililty of intercepting a ball given a player’s position, speed, and the final position of the ball (all fed as inputs to tti), as well as the additional user-specified t, representing how much time is allotted to reach the ball.\r\nValidator\r\nLet’s proceed by creating a validator function to, you guessed it, validate fields in the player class. It is good practice to check the values used to construct the class. The python code did not have any validation like this, but I don’t think it was ever expected to be extremely robust to any user input.\r\n\r\n\r\nvalidate_player <- function(player) {\r\n  vctrs::vec_assert(vctrs::field(player, 'player_id'), integer())\r\n  vctrs::vec_assert(vctrs::field(player, 'x'), double())\r\n  vctrs::vec_assert(vctrs::field(player, 'y'), double())\r\n  vctrs::vec_assert(vctrs::field(player, 'tti'), double())\r\n  player\r\n}\r\n\r\n\r\n\r\nNote that we could have simply done this validation in the constructor function, but I think it makes sense to put the validation in its own function so that the constructor is more direct (especially if the validation checks are complex).\r\nHelper\r\nFinally, we’ll create a helper player() function, which is our “user-facing” function that we expect/want users to use to instantiate objects.\r\n\r\n\r\nplayer <- \r\n  function(player_id, frame, tracking) {\r\n    \r\n    player_id <- as.integer(player_id)\r\n    frame <- as.integer(frame)\r\n\r\n    assertthat::assert_that(is.data.frame(tracking))\r\n    nms_req <- c('player_id', 'frame', 'x', 'y', 'x_v', 'y_v')\r\n    assertthat::assert_that(all(nms_req %in% names(tracking)))\r\n    \r\n    # `!!` to make sure that we filter using the integer values, not the column itself.\r\n    tracking_filt <- tracking %>% filter(player_id == !!player_id, frame == !!frame)\r\n    assertthat::assert_that(nrow(tracking_filt) == 1L)\r\n    \r\n    player <-\r\n      new_player(\r\n        player_id = player_id,\r\n        x = tracking_filt[['x']],\r\n        y = tracking_filt[['y']],\r\n        x_v = tracking_filt[['x_v']],\r\n        y_v = tracking_filt[['y_v']]\r\n      )\r\n    validate_player(player)\r\n  }\r\n\r\n\r\n\r\nNote the following:\r\nWe coerce player_id and frame to integers instead of doubles (particularly since they are expected to be integers in the constructor). This ensures that the new player is instantiated properly by the constructor and passes our validation.\r\nWe pass in our entire tracking data frame (that has rows for every 0.04 second interval in the game), as well as the frame to slice out of it. (player_id is also used to filter tracking.) This makes it convenient for user to instantiate new player objects when operating on the tracking data frame. There is no need to extract the singular initial position and velocity components “manually”; instead, the helper function does it for the user.\r\nAside\r\nR’s S3 framework is not a formal OOP framework (not even close really). Note that it does not have a reserved keyword to represent the instance of the class like self in python. Also, it is not actually necessary to much of what is done above (with the constructor, validator, and helper).\r\nFor example, we don’t actually have to create a formal-ish constructor prefixed with new_. We don’t even need a constructor function at all in S3. We could do something like class(var) <- 'player' to create a a player object. Of course, this is prone to errors down the line, so we don’t do that. Likewise with the validator and helper functions. The point of these constructs is to add clarity to our class code. They aren’t strictly necessary.\r\nPrinting\r\nLet’s do one more thing for our player class—create a custom print method. (Writing a custom print method is not required whatsoever, but it can be very helpful for debugging.) If we weren’t using {vctrs} and just S3, we would do this by writing a print.player function. However, {vctrs} provides a “pretty” header for us auto-magically (that looks like <player[1]>) if we use it to write our print method.\r\nTo take advantage of the pretty-printing functionality offered by {vctrs}, we write a format.player() method that will be called by a subclass of the generic vctrs::obj_print_data method6, which itself is called whenever we print out an object (whether explicitly with print or just by typing the name of the variable representing our player instance). We’ll add the player’s position and velocity components to the print out.\r\n\r\n\r\nformat.player <- function(player, ...) {\r\n  if(vctrs::field(player, 'in_frame')) {\r\n    suffix <- \r\n      sprintf(\r\n        'with `position = (%.2f, %.2f)` and `velocity = <%.1f, %.1f>`', \r\n        vctrs::field(player, 'player_id'), \r\n        vctrs::field(player, 'y'), \r\n        vctrs::field(player, 'x_v'),\r\n        vctrs::field(player, 'y_v')\r\n      )\r\n  } else {\r\n    suffix <- 'is not on the pitch'\r\n  }\r\n  prefix <- sprintf('`player_id = %s` ', vctrs::field(player, 'player_id'))\r\n  msg <- sprintf('%s%s', prefix, suffix)\r\n  paste(msg, sep = '\\n')\r\n}\r\n\r\nobj_print_data.player <- function(player) {\r\n  cat(format(player), sep = '\\n')\r\n}\r\n\r\n\r\n\r\nBasic Usage\r\nOk, so that is all fine and dandy, but how would we go about instantiating players in a normal workflow?\r\nLet’s say that we want to calculate the pitch control for a single frame in the tracking data (called tracking_start below).7\r\n\r\n\r\ntracking_start\r\n\r\n\r\n\r\nLet’s convert players with id’s 10 through 12 (on the home team) to player instances and see how they look when printed out.\r\n\r\n\r\n10L:12L %>% map(~player(player_id = .x, frame = 53027L, tracking = tracking_start))\r\n\r\n\r\n\r\nPseudo-Encapsulation\r\nWe still need to implement analogues for the tti and p_intercept methods in the python player class. Starting with tti, let’s use some pseudo-encapsulation (with getters and setters) for a player’s tti value.\r\n\r\n\r\n# Frobenious norm\r\neuclidean_norm <- function(x1, x2, y1, y2) {\r\n  m <- matrix(c(x1, y1)) - matrix(c(x2, y2))\r\n  sqrt(sum(m^2))\r\n}\r\n\r\n.get_tti.player <- function(player, x2, y2) {\r\n  ri <- 0.7 # in s\r\n  vmax <- 5 # in m/s\r\n  x1 <- vctrs::field(player, 'x') + vctrs::field(player, 'x_v') * ri\r\n  y1 <- vctrs::field(player, 'y') + vctrs::field(player, 'y_v') * ri\r\n  ri + euclidean_norm(x1, x2, y1, y2) / vmax\r\n}\r\n\r\n.msg_cls_err <- function(player, f) {\r\n  cls <- class(player)[1]\r\n  sprintf('`%s()` doesn\\'t know how to handle class `%s`!', f, cls) \r\n}\r\n\r\n.get_tti.default <- function(player, ...) {\r\n  stop(.msg_cls_err(player, '.get_tti'), call. = FALSE)\r\n}\r\n\r\n.get_tti <- function(player, ...) {\r\n  UseMethod('.get_tti')\r\n}\r\n\r\n`.set_tti<-.player` <- function(player, value) {\r\n  vctrs::field(player, 'tti') <- value\r\n  player\r\n}\r\n\r\n`.set_tti<-.default` <- function(player, ...) {\r\n  stop(.msg_cls_err(player, '.set_tti'), call. = FALSE)\r\n}\r\n\r\n`.set_tti<-` <- function(player, ...) {\r\n  UseMethod('.set_tti<-')\r\n}\r\n\r\n\r\n\r\nThere’s a couple of things going on here:\r\nThe .get_tti and .set_tti functions that call UseMethod are true S3 generics that perform method dispatch, i.e. find the correct method for the object passed to the generic (based on the class of the object). The .get_tti.player and .set_tti.player with the .player “suffix” so that they only work in their defined manners when passed in a player instance. (They won’t be called with an object that is not of the player class.)\r\nThe ellipses (...) in the S3 generic function signatures may be a bit mysterious since they aren’t passed explicitly to UseMethod. Any non-player arguments are captured in these ellipses and passed to whatever method that is called from the generic (e.g. .get_tti.player method called from the .get_tti generic). For .get_tti, the ellipses is intended to capture x2 and y2, and for .set_tti, it captures value.\r\nWe must use the “strange” syntax .set_tti<-.player (instead of just .set_tti.player, which may seem more “natural”) in order to update an attribute in an already instantiated class. 8\r\nWe define the function euclidean_norm() outside of .get_tti.player simply because it is not something that is specific to the time to intercept calculation for a player; it can work with any two pairs of x and y coordinates.9\r\nri and vmax, representing a player’s reaction time and a player’s maximum velocity respectively, are constants defined in the Spearman paper. We could change these if we wanted to, or even make them dynamic (i.e. configurable via other function parameters, or even at instantiation time).\r\nTo really complete our getter and setter methods for tti, we should write methods to handle the case when a non-player object is passed to them. The generic .get_tti and .set_tti methods will dispatch to these functions if the object passed to them (the first argument named player) doesn’t actually inherit from the player class.\r\n\r\n\r\n.get_tti.default <- function(player, ...) {\r\n  stop(.msg_cls_err(player, '.get_tti'), call. = FALSE)\r\n}\r\n\r\n.set_tti.default <- function(player, ...) {\r\n  stop(.msg_cls_err(player, '.get_tti'), call. = FALSE)\r\n}\r\n\r\n\r\n\r\nLet’s see how our pseudo-encapsulation looks in action.\r\n\r\n\r\nplayers <- 8L:10L %>% map(~player(player_id = .x, frame = 53027L, tracking = tracking_start))\r\nmap(players, ~vctrs::field(.x, 'tti'))\r\n\r\n\r\n\r\n\r\n\r\ntarget_x <- 94\r\ntarget_y <- 63\r\nfor(i in seq_along(players)) {\r\n  value <- .get_tti(players[[i]], x2 = target_x, y2 = target_y)\r\n  .set_tti(players[[i]]) <- value\r\n}\r\nmap(players, ~vctrs::field(.x, 'tti'))\r\n\r\n\r\n\r\nNote how the player tti values changed after we defined them for a specified target_x and target_y.\r\nOur approach to p_intercept is very similar to that for tti, so I don’t show most of it here. As before, we define getters and setters, as well as generics for the class (the intended target of method dispatch), as well as a default class to handle unexpected inputs. Probably the only interesting part is the calculation itself, as shown below. If you compare it to the p_intercept method in the python object definition, you’ll see it’s basically identical.\r\n\r\n\r\n.get_p_intercept.player <- function(player, t) {\r\n  tti_sigma <- 0.45\r\n  den <- 1 + exp((-base::pi / sqrt(3) / tti_sigma) * (t - vctrs::field(player, 'tti')))\r\n  1 / den\r\n}\r\n\r\n\r\n\r\nThere is certainly more to show, especially for what is needed to calculate pitch control. (We need to integrate probabilities across all players over time, and do it for the entire pitch.) Nonetheless, the player class and the pseudo-encapsulation that we’ve implemented with S3 and {vctrs} is really the key component underlying the whole pitch control calculation.\r\nAdvanced Usage\r\nTo really motivate the reader, let’s see what this implementation allows us to do.\r\nFirst, let’s emulate the pitch control plot of event 823, which is a pass by the away (blue) team in the home (red) team’s penalty area preceding a successful shot.\r\n\r\nCompare this to the python version.\r\n\r\nIt’s not a perfect replication, but I think it’s very close overall.\r\nSecond, let’s replicate the expected possession value (EPV) plot of the same event, including the EPV added by the pass.\r\n\r\nAgain, we can compare this plot to the python equivalent.\r\n\r\nCool, my R version seems to very close to the python original. We do have a small discrepancy in the EPV added calculation. (This EPV is actually an “expected” EPV calculation that uses pitch control to weight the pre-learned EPV grid). I believe this is probably due to discrepancies in the integration done in the pitch control calculation and not due to a significant a code issue.\r\nThe code to prepare the data for these plots gets more complex, which is why I have excluded it here.10 However, none of it is unreasonably difficult to understand or implement once we have a properly defined player object.\r\nConclusion\r\nThus, we see that there is a huge payoff to creating a sound and robust player object—we can calculate pitch control and EPV, and feed them into pretty visualizations that can provide insight. I believe that the code here could be easily adapted to fit whatever one would like to study. For example, the valuation grid used here could be easily swapped out with expected threat (xT), which is a more modern and probably a better valuation framework than the one used here.11 Furthermore, one could calculate EPV across the entire game. The possibilities for analyses really open up.\r\nauthor of one of my favorite books Soccermatics↩︎\r\nIf you actually browse Laurie’s code, you’ll notice that I’ve changed some of the names of these functions, e.g. tti() here instead of simple_time_to_intercept() there, tracking_df instead of team there. Don’t worry about that. I just wanted to make things as comparable as possible for the diligent reader, and I tried to make variable names that were either (or both) more succinct or more clear.↩︎\r\nOne might argue that we should be consistent with tti and p_intercept and store them in the same way—either both as attributes or neither as attributes—given that both are dependent on some user-specified values (final_position for tti and t for p_intercept). I’m just showing how it is done in Laurie’s code. I think it is simple enough as is and there is no compelling functional reason why we should change the implementation.↩︎\r\nData for this plot and all that follow from post-processed Metrica Sports sample game 2 data.↩︎\r\nauthor of one of my favorite books Soccermatics↩︎\r\nvctrs::obj_print_data that can also handle Unicode easily, although we are not using any Unicode characters here. Also, it is able to handle extra NULLs and [1] that may be printed out if we just use cat or print directly.↩︎\r\nThis is the same data used to generate the first handful of plots.↩︎\r\nR6 is probably a better OOP system to use for this whole use case. The capability to update instance attributes is more native to that framework.↩︎\r\nIt’s best to separate out logic in functions like this where it makes sense to do so. It ultimately makes re-factoring and debugging a lot easier.↩︎\r\nFeel free to check out the source the code used in the full implementation, as well as the code to generate the plots.↩︎\r\nHere is a CSV with the grid for xT.\r\n\r\n↩︎\r\n",
    "preview": "posts/soccer-pitch-control-r/viz_pc_823_combined.png",
    "last_modified": "2021-07-01T22:10:22-05:00",
    "input_file": {},
    "preview_width": 1536,
    "preview_height": 642
  },
  {
    "path": "posts/variable-importance-compare/",
    "title": "Comparing Variable Importance Functions (For Modeling)",
    "description": "Permuation, SHAP, and More",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2020-07-13",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nSetup\r\nResults\r\nConclusion\r\n\r\nI’ve been doing some machine learning recently, and one thing that keeps popping up is the need to explain the models and their components. There are a variety of ways to go about explaining model features, but probably the most common approach is to use variable (or feature) importance scores. Unfortunately, computing variable importance scores isn’t as straightforward as one might hope—there are a variety of methodologies! Upon implementation, I came to the question “How similar are the variable importance scores calculated using different methodologies?” 1 I think it’s important to know if the different methods will lead to drastically different results. If so, then the choice of method is a source of bias in model interpretation, which is not ideal.\r\nThis post isn’t intended to be a deep-dive into model interpretability or variable importance, but some concepts should be highlighted before attempting to answer this question. Generally, variable importance can be categorized as either being “model-specific” or “model-agnostic”. Both depend upon some kind of loss function, e.g. root mean squared error (RMSE), classification error, etc. The loss function for a model-specific approach will generally be “fixed” by the software and package that are used2, while model-agnostic approaches tend to give the user flexibility in choosing a loss function. Finally, within model-agnostic approaches, there are different methods, e.g. permutation and SHAP (Shapley Additive Explanations).\r\nSo, to summarize, variable importance “methodologies” can be broken down in several ways:\r\nmodel-specific vs. model-agnostic approach\r\nloss function 3 . model agnostic method (given a model agnostic approach)\r\nI’m going to attempt to address (1) and (3) above. I’m leaving (2) out because (a) I think the results won’t differ too much when using different loss functions (although I haven’t verified this assumption) and (b) for the sake of simplicity, I don’t want to be too exhaustive in this analysis. 3\r\nI also want to evaluate how variable importance scores differ across more than one of each of the following:\r\nmodel type (e.g. linear regression, decision trees, etc.)\r\ntype of target variables (continuous or discrete )\r\ndata set\r\nWhile evaluating the sensitivity of variable importance score to different methodologies is the focus of this analysis, I think it’s important to test how the findings hold up when (1) varying model types, (2) varying target variables, and (3) varying the data itself. This should help us highlight any kind of bias in the results due to choice of model type and type of target variable. Put another way, it should help us quantify the robustness the conclusions that are drawn. If we find that the scores are similar under variation, then we can be more confident that the findings can be generalized.\r\nAdditionally, I’m going to use more than one package for computing variable importance scores. As with varying model types, outcome variables, and data, the purpose is to highlight and quantify possible bias due to choices in this analysis—in this case, the choice of package. Are the results of a permutation-based variable importance calculation the same when using different packages (holding all else equal)?\r\nSpecifically, I’ll be using the {vip} and {DALEX} packages. The {vip} package is my favorite package to compute variable importance scores using Ris because it is capable of doing both types of calculations (model-specific and model-agnostic) for a variety of model types. But other packages are also great. {DALEX} package specializes in model-agnostic model interpretability and can do a lot more than just variable importance calculations.\r\nSetup\r\nFor data, I’m going to be using two data sets from {ggplot2}. 4\r\nincrease computation time. (b) I’ve excluded two of the categorical features—clarity and color, both of which are categorical with a handful of levels. I’ve done this in order to reduce the number of variables involved and, consequently, to speed up computation. (This is just an example after all!) (c) To test how variable importance scores differ for a continuous target variable, I’ll be defining models that predict price as a function of all other variables. (d) For discrete predictions, the target is a binary variable grp that I’ve added. It is equal to '1. Good' when cut %in% c('Idea', 'Premium') and 2. Bad' otherwise. It just so happens that grp is relatively evenly balanced between the two levels, so there should not be any bias in the results due to class imbalance.\r\nI made modifications to both, so see the footnotes and/or code if you’re interested in the detailI made modifications to both, so see the footnotes and/or code if you’re interested in the details.\r\n\r\nFor model types, I’m going to trial the following:\r\ngeneralized linear model (linear and logistic regression) with stats::lm() and stats::glm() respective ly\r\ngeneralized linear model with regularization using the {glmnet} package\r\nbagged tree (random forest) using the {ranger} package\r\nboosted tree (extreme gradient boosting) using the {xgboost} package\r\nWith glmnet::glmnet(), I’m actually not going to use a penalty, so (I think) it should return the same results as lm()/glm(). 5 For {ranger} and {xgboost}, I’m going to be using defaults for all parameters. 6\r\n{vip}’s model-specific scores with (vip::vip(method = 'mod l'))\r\n{vip}’s permutation-based scores (with vip::vip(method = 'permute'))\r\n{vip}’s SHAP-based values (with vip::vip(method = 'shap'))\r\n{DALEX}’s permutation-based scores (with DALEX::variable_importance())\r\nNote that the model-specific vs. model-agnostic concern is addressed in comparing method (1) vs. methods (2)-(4). I’ll be consistent with the loss function in variable importance computations for the model-agnostic methods–minimization of RMSE for a continuous target variable and sum of squared errors (SSE) for a discrete target variable. 7\r\nResults\r\nThe following handful of plots illustrate normalized variable importance scores and ranks derived from the scores by data set and type of target variable.\r\nFirst up is the results for the diamonds data set with a continuous target variable.\r\nme: the model-specific scores differ relatively strongly from the rest of the scores given a specific model type. (See the numbers in the parentheses in the first column in each facet labeled vip_model compared to those in the other columns of each facet. 8 For example, the model-specific variable importance score for the carat feature for the {glm} model type is 49%, while the same score for the SHAP variable importance method (vip_shap) is 35%. To be honest, this is not too surprising. The model-specific methods are exactly that—specific to the model type—which suggests that they may strongly dissimilar to the model-agnostic approaches. Nonetheless, despite the scores themselves having some notable variance, the rankings derived from the scores are relatively similar across a given model type (and, arguably, across all model types).\r\nAs a second observation, there is some disagreement between the {glm} and {glmnet} model types and the {ranger} and {xgboost} model types about which feature is the most important: the former two identify carat has being the most important, while the latter two prioritize y.\r\nThirdly–and lastly for this plot—it’s nice to see that the vip_permute and dalex methods produce nearly identical results for each model type, with the exception of {glmnet}. (Hypothetically, these should have nearly identical results since they are both permutation based methods.) Notably, I implemented the explain() function for {glmnet} myself since the {DALEX} package does not export one, so that is probably the reason for the discrepancy.\r\nNow let’s look at the the results when predicting a discrete target variable with the same data set.\r\n\r\nCompared to the results for a continuous target variable, we see greater variation across the model types—the rankings from {glm} and {glmnet} are nearly identical, but they are different from those of {xgboost}, and all are different from those of {ranger}. {ranger} has an additional level of variation—lack of agreement among the methodologies.\r\nAdditionally, we observe that the scores for our two permutation implementations— vip_permute and dalex—are very different. I think this might have to do with how I’ve chosen to normalize scores (i.e. using absolute value to convert negative scores to positive ones prior to 0-1 normalization) or something I’ve over-looked that is specific to classification settings. If something that can be attributed to me (and not the underlying methods) is really the source of discrepancies, then we should be less concerned with the variation in scores and ranks since it seems most strongly associated with the vip_permute-dalex differences.\r\nBefore we can begin to generalize any deductions (possibly biased by our single data set), let’s take a look at the results for the second data set, mpg. First is the results for the continuous target variable.\r\n\r\nThere is consensus on what the most important variable is—cyl—but beyond that, the results are somewhat varied across the board. One might argue that there is going to be lack of agreement among methods (and model types), it’s preferable that the discrepancies occur among lower ranks, as seen here. On the other hand, we’d surely like to see more consensus among variables ranked among the top half or so.\r\nAnd now for the results when ranking with models targeting a discrete variable.\r\n\r\nThere is some pretty strong variation in the {ranger} results. Also, there are discrepancies between the two permutation methods (vip_permute and dalex), which we also noted in the discrete results for diamonds as well. This makes me think again that the issue is due to something I’ve done and not something that could be attributed to the underlying methods. Aside from these, I would say that the results within each model type are pretty coherent (more so than those with the continuous outcome.)\r\nEven without performing any kind of similarity evaluation, we can argue that, in general, the rankings computed by the different methods are relatively similar across the two data sets (diamonds and mpg) and the two types of target variables (continuous and discrete). But why stop there? After all, we can quantify the similarities between ranks.\r\n\r\nThe plot above shows the pairwise correlations among the variable importance ranks computed for each package-function combo, averaged over the two data sets and over the models for the two types of target variables—continuous and discrete. 9 While nothing immediately jumps out from this plot, I think the most notable thing is that the {ranger} scores seem to vary the most across the different variable importance methodologies, bottoming out at 74% for the correlation between the SHAP (vip_shap) and model-specific (vip_model) methodologies. On the other hand, {xgboost} seems to have the most “agreement” and least variance in its scores.\r\nConclusion\r\nOverall, we might say that rankings of variable importance based on normalized variable importance scores in this analysis showed that differences will arise when evaluating different methodologies, but the differences may not be strong enough to change any deductions that one might draw. Of course, this will depend on the context. A small differences could make a huge difference in a field like medicine!\r\nI wouldn’t go so far as to say that these insights can be generalized—among other things, I think I would need to evaluate a much larger variety of data sets—but I think it’s good to be conscious how much the results can vary. It’s ultimately up to the user whether the differences are significant.\r\n\r\nAfter all, I want to make sure my results aren’t sensitive to some kind of bias (unintentional in this case).↩︎\r\nThis isn’t an academic paper after all!↩︎\r\nThis isn’t an academic paper after all!↩︎\r\nModifications include the following: (a) I’ve excluded manufacturer, model, trans, and class. (b) For continuous predictions, I’ll predict displ as a function of all other variables. (c) For discrete predictions, I’ve created a binary variable grp based on class.↩︎\r\n(I haven’t actually checked the source for {glmnet} and compared it to that of lm()/glm(). Differences may arise due to underlying differences in the algorithm for least squares.)↩︎\r\nI should say that I’m using the {tidymodels} package to assist with all of this. It really shows off its flexibility here, allowing me to switch between models only having to change-out one line of code!Finally, for variable importance scores (which is really the focus), I’m going to use the following packages and functi ons.↩︎\r\nYes, SSE is certainly not the best measure of loss for classification. Nonetheless, when dealing with a binary outcome variable, as is done here, it can arguably be cceptable.↩︎\r\nDon’t be deceived by the fill contours, which are based on the rankings–the number in front of the parentheses.↩︎\r\nI could have split (or “facetted”) in a different way–e.g. by type of target variable instead of by package-function combo—but I think splitting in this way makes the most sense because the type of model—{glm}, {ranger}, etc.—is likely the biggest source of variation.↩︎\r\n",
    "preview": "posts/variable-importance-compare/viz_diamonds_c_rnks.png",
    "last_modified": "2021-07-01T22:07:15-05:00",
    "input_file": {},
    "preview_width": 2400,
    "preview_height": 2400
  },
  {
    "path": "posts/bayesian-statistics-english-premier-league/",
    "title": "Ranking English Premier League Teams",
    "description": "With a Bayesian Approach",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2019-12-13",
    "categories": [
      "r",
      "soccer"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nData Collection\r\n\r\nModeling\r\nInterpretation & Discussion\r\nPredictions\r\n\r\nConclusion\r\nFuture Work\r\n\r\n\r\nI haven’t had as much time (since summer of 2018) to write due to taking classes in pursuit of a degree from Georgia Tech’s Online Master of Science in Analytics (OMSA) program. On the other hand, the classes have given me some ideas for future content. And, in the case of the Bayesian Statistics class that I took this past fall, there’s content that translates well to a blog post directly. What follows is a lightly edited version of the report that I submitted at the end of the semester for this class.\r\nIntroduction\r\nI model and predict English Premier League (EPL) game outcomes using Bayesian methods. Specifically, I estimated goals scored by each team in a given game as independent Poisson processes, taking the difference of the estimated points scored on each side to determine game winners. More broadly, one may call this a hierarchical Bayesian Poisson model.\r\nWhy model goals scored using a Poisson distribution? By definition, it “is a discrete probability distribution that expresses the probability of a given number of events occurring in a fixed interval of time with a known constant rate.” In the context of soccer, the fixed interval of time is the 90 minutes of a game (disregarding injury time and over time), and the known constant rate is the expected number of goals scored per minute. Importantly, I must make the assumption that the rate of scored goals is the same across all minutes of a game. 1 Additionally, when computing the difference between Poisson distributions, I must assume that the two distributions are independent of one another. 2\r\nUsing Poisson distributions to model soccer scores is certainly not a novel concept. 3 4 In particular, I would like to acknowledge the work of Rasmus Baath’s, whose series of blog posts exemplifying the use of R and JAGS to model scores in La Liga games between the 2008-09 to 2012-13 season served as a guide for the analysis that I conduct here. 5 6\r\nData Collection\r\nFor this project I retrieved game scores and outcomes for the previous three seasons of EPL games (i.e. from the 2016-17 season through the 2018-2019 season).\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nModeling\r\nMy model is formally defined as follows.\r\n\\[\r\n\\begin{array}{c}\r\ng_h \\sim \\mathcal{Pois}(\\lambda_{h,i,j}) \\\\\r\ng_a \\sim \\mathcal{Pois}(\\lambda_{a,i,j}) \\\\\r\n\\log(\\lambda_{h,i,j}) = \\text{baseline}_h + (z_i - z_j) \\\\\r\n\\log(\\lambda_{a,i,j}) = \\text{baseline}_a + (z_j - z_i). \\\\\r\n\\end{array}\r\n\\]\r\nThis model estimates the goals scored by the home team, \\(g_h\\), and the goals scored by the away team, \\(g_a\\), in a given game between home team, \\(\\text{tm}_h\\), and away team, \\(\\text{tm}_a\\), as random variables coming from independent Poisson processes, \\(\\mathcal{Pois}(\\lambda_{h,i,j})\\) and \\(\\mathcal{Pois}(\\lambda_{a,i,j})\\). The log of the rate of goals scored by the home team, \\(\\lambda_{h,i,j}\\), in a game between \\(\\text{tm}_i\\) and \\(\\text{tm}_j\\) is modeled as the sum of a “baseline” average of goals scored by any given team playing at home, \\(\\text{baseline}_h\\), and the difference between the team “strength” \\(z\\) of teams \\(i\\) and \\(j\\) in a given game. I define the log of the goal rate by the away team, \\(\\lambda_{a,i,j}\\), in a similar fashion. 7 It is important to distinguish the baseline levels for home and away so as to account for “home field advantage”. (One should expect to find that \\(\\text{baseline}_h > \\text{baseline}_a\\) in the posterior estimates.)\r\nSince I am employing a Bayesian approach, I need to model priors as well. I define them as follows.\r\n\\[\r\n\\begin{array}{c}\r\n\\text{baseline}_h \\sim \\mathcal{N}(0, 2^2) \\\\\r\n\\text{baseline}_a \\sim \\mathcal{N}(0, 2^2) \\\\\r\nz_{i} \\sim \\mathcal{N}(z_{\\text{all}} , \\sigma^2_{\\text{all}}) \\quad \\text{tm}_i > 1 \\\\\r\nz_{\\text{all}} \\sim \\mathcal{N}(0, 2^2) \\\\\r\n\\sigma_{\\text{all}} \\sim \\mathcal{U}(0, 2).\r\n\\end{array}\r\n\\]\r\nThere are a couple of things to note about these priors. First, I must “zero”-anchor the strength estimate \\(z\\) of one team. (This is manifested by \\(\\text{tm}_i > 1\\).) Here, I choose the first team alphabetically—Arsenal. Second, the priors are intentionally defined to be relatively vague (although not too vauge) so as to allow the posterior estimates to be heavily defined by the data rather than the priors. Note that the standard deviation of the overall team strength parameter \\(z_{\\text{all}}\\), defined as \\(2\\) on a log scale, corresponds to an interval of \\(\\left[e^{-2}, e^2\\right] = \\left[0.13, 7.40\\right]\\) on an unstransformed scale, i.e. goals scored per game.\r\nI leverage the {R2OpenBUGs} package to create this model with R on the “frontend” and generate the results using the OpenBUGS engine on the “backend”. Regarding the implementation itself, note that I run 100,000 simulations (n.iter), minus 1,000 “burn-in” runs (n.burn).\r\nThe raw results are as follows. (As a quick “validation” of these results, note that \\(\\text{baseline}_h > \\text{baseline}_a\\), as hypothesized.)\r\nInterpretation & Discussion\r\nNext, I correspond the strength estimates \\(z\\) to teams. Notably, I must “re-add” the zero-anchored team—Arsenal (whose \\(z\\) is assigned a dummy value of 1). To do this, I impute its credible set quantiles using the values of the overall strength term \\(z_{\\text{all}}\\).\r\n\r\nIt’s not surprising to see that the strength (\\(z\\)) corresponding to all but three teams—Liverpool, Man City, and Tottenham—is negative. These three teams, followed closely by Arsenal have been regarded as the best teams for the past two or three EPL seasons. So, relative to Arsenal, all other teams (aside from the top three) are viewed as “worse” by the model.\r\nNote that the \\(z\\) estimates above should not be interpreted as goals scored by the teams because they are relative to the strength of Arsenal. To facilitate such an interpretation, I need to translate \\(z\\) to goals scored per game. To do this, for each \\(z\\), I (1) subtract the average value of all \\(z\\)’s, (2) add the posterior mean of \\(\\text{baseline}_{h}\\), and (3) exponentiate.\r\nThe plot below shows the results of this transformation.\r\n\r\nPredictions\r\nI can make predictions of game results for the historical data, given the model. Specifically, I simulate the score for both teams in each matchup (1,140 in all) 1,000 times, choosing the result inferred by the mode of each side’s simulated score. (For example, if the mode of the 1,000 simulated scores for the away team is 1 and that of the home team is 2, then the predicted outcome is a win for the home team.) A breakdown of the predicted and actual outcomes is shown below.\r\n\r\nI make a couple of observations:\r\nThe most common outcome is an actual win by the home team and a predicted win by the home team.\r\nThe model never predicts a tie. (This may seem “unreasonable”, but BÃ¥Ã¥th also found this to be true for his final model.)\r\nThe model predicts the outcome correctly in 447 + 216 = 663 of 1,140 games (i.e., 58%).\r\nThe next couple of visuals provide more details regarding the simulated outcomes.\r\n\r\nFrom the above graph of the mode of goals scored by both sides, it’s apparent that a 2-1 scores in favor of the home side is the most common outcome.\r\n\r\nThe above histogram illustrating the mean (instead of the mode) of the simulated goals provides a bit more nuance to our understanding of modes shown before.\r\n\r\nFinally, the above visual shows the predicted outcomes (inferred from the prior graph of predicted modes).\r\nTo better understand how the model works on a team-level basis, let’s look at how well it predicts for each team.\r\n\r\n\r\n\r\nTeam\r\n# of Wins\r\nWin %\r\nArsenal\r\n46\r\n80.70%\r\nMan City\r\n45\r\n78.95%\r\nTottenham\r\n43\r\n75.44%\r\nLiverpool\r\n41\r\n71.93%\r\nChelsea\r\n39\r\n68.42%\r\nCardiff\r\n12\r\n63.16%\r\nEverton\r\n36\r\n63.16%\r\nFulham\r\n12\r\n63.16%\r\nMan United\r\n35\r\n61.40%\r\nHuddersfield\r\n23\r\n60.53%\r\nBurnley\r\n34\r\n59.65%\r\nStoke\r\n22\r\n57.89%\r\nBournemouth\r\n30\r\n52.63%\r\nCrystal Palace\r\n30\r\n52.63%\r\nSunderland\r\n10\r\n52.63%\r\nSwansea\r\n20\r\n52.63%\r\nWest Ham\r\n30\r\n52.63%\r\nWatford\r\n29\r\n50.88%\r\nNewcastle\r\n19\r\n50.00%\r\nLeicester\r\n28\r\n49.12%\r\nMiddlesbrough\r\n9\r\n47.37%\r\nWest Brom\r\n18\r\n47.37%\r\nWolves\r\n9\r\n47.37%\r\nBrighton\r\n15\r\n39.47%\r\nSouthampton\r\n22\r\n38.60%\r\nHull\r\n6\r\n31.58%\r\nIn most cases, the model predicts the outcome correctly (see is_correct) with greater than 50% accuracy, although there are also teams for which its accuracy is less than 50%.\r\nConclusion\r\nIn summary, I have created a hierarchical Poisson model to predict scores—and, consequently, game outcomes—for EPL games for the three seasons starting in 2016 and ending in 2018. The model has an training set prediction accuracy of 66.3%. Baath, whose work inspired mine, achieved an accuracy of 56% with his final model.\r\nFuture Work\r\nMy model can certainly be improved. One major flaw of the model is that it does not account for temporal effects, i.e. differences in team strength across seasons. 8 The consequences of this flaw are compounded by the fact that the pool of teams in each EPL season changes. At the end of each season, the three “worst” EPL teams (by win-loss-tie record) are “relegated” to a secondary league, and, in turn, three secondary league teams are “promoted” to the EPL in their place. 9 Consequently, one might say that the estimates of the teams that do not appear in all seasons are exaggerated.\r\n\r\nThis is arguably a “bad” assumption. Research has shown that goal rate per minute increases in the last 15 minutes of a game.↩︎\r\nThis may also be perceived to be a questionable assumption. One may argue that a matchup of “styles”—e.g. an aggressive team against another aggressive team—may distort the results from what would otherwise be expected.↩︎\r\nThis approach is arguably too “simplistic”, but it is certainly a valid approach.↩︎\r\nSee this Pinnacle blog post for a discussion of the topic. (Undoubtedly there are many more articles and papers that explore a similar notion.)↩︎\r\nThere are several notable differences with my work compared to that of BÃ¥Ã¥th: (1) I use the OpenBUGS software (and the {R2OpenBUGS} package) instead of JAGS; (2) I evaluate EPL teams instead of La Liga teams, and over a different time period; (3) I use a “tidy” approach (in terms of packages, plotting, coding style, etc.) instead of a more traditional “base R” approach; (4) I implement a modified version of the second of Baath’s three proposed models (notably, using different priors).↩︎\r\nBaath’s work is licensed under the Creative Commons license, which allows for others to adapt the work of another.↩︎\r\nNote that I substitute the baseline home average goal rate with a baseline for away teams, \\(\\text{baseline}_a\\), and I swap the order of the \\(z_j\\) and \\(z_i\\) teams since the relationship is not bi-directional. Also, note that I am careful to distinguish between subscript pair \\(_h\\) and \\(_a\\) for home and away and pair \\(_i\\) and \\(_j\\) for team \\(i\\) and team \\(j\\). The latter pair is independent of the notion of home or away.↩︎\r\nThere are certainly also changes in team strength within seasons, which are even more difficult to model.↩︎\r\nThis explains why there are more than 20 teams in thee data set even though there are only 20 teams in the EPL in a given season.↩︎\r\n",
    "preview": "posts/bayesian-statistics-english-premier-league/viz_summ_1_z_adj.png",
    "last_modified": "2021-07-01T22:12:33-05:00",
    "input_file": {},
    "preview_width": 2100,
    "preview_height": 1500
  },
  {
    "path": "posts/cheat-sheet-rmarkdown/",
    "title": "Making a Cheat Sheet",
    "description": "With Rmarkdown",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2019-07-07",
    "categories": [
      "r",
      "latex"
    ],
    "contents": "\r\n\r\nContents\r\nThe Template\r\nUsage\r\nWhy This Way?\r\nWhat Works for Me May Not Work For You\r\n\r\n\r\nfigure img {\r\n  width: 50%;\r\n}\r\nUnfortunately, I haven’t had as much time to make blog posts in the past year or so. I started taking classes as part of Georgia Tech’s Online Master of Science in Analytics (OMSA) program last summer (2018) while continuing to work full-time, so extra time to code and write hasn’t been abundant for me.\r\nAnyways, I figured I would share one neat thing I learned as a consequence of taking classes—writing compact “cheat sheets” with {rmarkdown}. 1\r\nWriting with {rmarkdown} is fairly straightforward—mostly thanks to an abundance of freely available learning resources, like the R Markdown: The Definitive Guide—and using CSS to customize your Rmarkdown output to your liking is not too difficult either. (By the way, huge shout-out to Yihui Xie and everyone else who has contributed to the development of the {rmarkdown} package.) My objective was to make an extremely compact PDF that minimizes all white space 2. Despite my knowledge of CSS, I had a hard time getting an output that I liked purely from CSS, so I looked online to see if I could find some good LaTex templates. (After all, I would be knitting the Rmarkdown document to PDF, and LaTex would be incorporated via the equations on the cheat sheet.) Some templates I found worked fine but weren’t completely to my liking. 3\r\nIn my search for an “ideal” template, I stumbled upon a small tidbit in the very last portion of the PDF chapter of the R Markdown book stating “You can also replace the underlying pandoc template using the template option”.\r\nAt first, I was a bit intimidated by the idea of writing my own template. (“I have to write my own template from scratch using a framework (LaTeX) that I’ve hardly even touched before now!”) But alas, the task became less intimidating when I realized that I could use the tried-and-true method of copying-pasting-modifying from Stack Overflow!\r\nThe Template\r\nUsing the template from this Stack Overflow post 4 as a basis, I ended up creating a relatively minimal template. For the curious reader, see this GitHub repo, for the latest version of my template. It also includes an example cheat sheet.\r\n\r\nThe “gist” of my template is shown below.\r\n\r\n% Packages and preamble\r\n% ...\r\n\r\n\\begin{document}\r\n\r\n\\begin{multicols*}{4}\r\n\r\n$body$\r\n\r\n\\end{multicols*}\r\n\r\n\\end{document}\r\n\r\nThe key for me was to understand how pandoc variables like $body$ are used as placeholders for user-supplied content. (I know I haven’t mentioned pandoc up to this point, but suffice it to say that it—along with the R package {knitr}—are what power the {rmarkdown} package.)\r\nThe multicols command shown in the snippet above is also noteworthy. This LaTex command provides the functionality for I wanted most for my cheat sheet—multiple columns of content! I should point out that there are in_header, before_body, and after_body YAML options for customizing PDF output with {rmarkdown}. 5\r\nThese options are probably sufficient for most people’s customization needs (so using a custom template would not be necessary). But for me personally, the appeal of having “complete” control of my output by using a template convinced me to forego these options. 6\r\nUsage\r\nSo, exactly how do you use a custom template with {rmarkdown}? It’s as simple as specifying the path to your template file with the template option in the YAML header of your Rmarkdown document. 7\r\nWhy This Way?\r\nBefore I was using Rstudio and {rmarkdown} to write my cheat sheets, I tried out a couple of LaTex editors 8. First, I tried the very popular Overleaf. It is well known and commonly used because it is web-based, allows the user to collaborate in real-time, and provides real-time previewing 9. However, there was just something that felt “clunky” about the editor, and the ambiguity over package versions and usage was bothersome to me. 10 The other editor I tried for some time was TeXworks (with the pdftex distribution) Using the “Typset” command to generate my PDF output on an ad-hoc basis seemed to me to be a satisfactory workflow, but, among other things, I felt limited by the customization offered by TeXworks. 11\r\nAnd so I turned to Rstudio and {rmarkdown} and didn’t look back. While learning how to create a custom template was a (minor) inconvenience, it has paid off in a number of ways:\r\nI can use a familiar editor—Rstudio.\r\nI can use a familiar workflow—writing in an Rmarkdown document and knitting to create my desired output.\r\nBecause I’m using {rmarkdown}, I can use {rmarkdown} functionality that is not available when solely writing in LaTex.\r\nThis last point is huge. The whole world of markdown syntax is valid! For example, I can add emphasis to text with markdown’s ** and __ tokens (instead of LaTex’s more “verbose” syntax); I can use # to define section headers (which I just think is super “elegant”); and I can use HTML comments to comments out multiple lines of text. (Note that native LaTex only has a single-line comment token—%. 12) Additionally, beyond just the markdown functionality, I can include R code thanks to added layer of functionality offered by {rmarkdown}.\r\nThe one big thing that I feel like I “sacrificed” by moving to Rstudio and {rmarkdown} is the live preview feature that comes with Overleaf (and can be emulated with some configuration in other LaTex editors). Nonetheless, I feel like I get a reasonable facsimile of this feature with Rstudio’s functionality for inline previews of equations. 13 Below are examples of the preview capabilities for both single- and multi-line equations.\r\nA single-line equation previewA multi-line equation previewWhat Works for Me May Not Work For You\r\nAlthough what I’ve described in this post has been working well for me—and I’d encourage others to try it out—I don’t claim it to be the “best” solution for all of your cheat sheet needs. 14 If you’ve got a workflow that works for you, that’s great! Keep using it! Be pragmatic.\r\nFor those unfamiliar with the concept of a cheat sheet, there’s no malice in it, despite what the moniker implies. From my experience, it is relatively common for teachers to let students use self-created note sheets (i.e. cheat sheets) for aid with taking exams.↩︎\r\nin order to maximize the amount of space used for content, of course↩︎\r\nOne of the ones that I really liked was this one. However, it’s a bit more complex than I wanted. (This one implements a “structure” in which one “main” tex file references several others with the \\input Latex command.)↩︎\r\nwhich was super helpful for a LaTex noob like me because it has comments explaining what specific lines/sections are doing↩︎\r\nSee the PDF chapter of the R Markdown book for some guidance with these.↩︎\r\nI’m sure I could create a perfectly fine cheat sheet using just these options, or, even re-create the output that I have achieved with my template.↩︎\r\nYou can specify other options as well, such as keep_latex: true for an alternative LaTex engine with latex_engine.↩︎\r\nand there are lots of them out there↩︎\r\nThe live preview feature is probably my favorite of all.↩︎\r\nOthers may view the hands-off approach to package management as an advantage of using Overleaf.↩︎\r\nPerhaps this is the fault of my own. Perhaps all the customization that I would like exists and I just have not discovered how to enable it.↩︎\r\nI realize that you can define custom commands or use a package to create multi-line comments in LaTex, but that ruins the point that I’m trying to make.↩︎\r\nSee the “Show equation and image previews” option in Tools > Global Options… > R Markdown.↩︎\r\nI wouldn’t be surprised if I find a better workflow for myself in the future.\r\n\r\n↩︎\r\n",
    "preview": "posts/cheat-sheet-rmarkdown/cheat-sheet-example.png",
    "last_modified": "2021-07-01T22:07:44-05:00",
    "input_file": {},
    "preview_width": 654,
    "preview_height": 925
  },
  {
    "path": "posts/text-parsing-analysis-periodic-report/",
    "title": "Text Parsing and Analysis of a Periodic Report",
    "description": "With tidytext and Friends",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2019-06-29",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nA Brief Outline of the “Process”\r\nThe Analysis\r\nTable of Contents (TOC)\r\nSentences\r\nWords\r\n\r\nThe End\r\n\r\nIntroduction\r\nThose of you non-academia folk who work in industry are probably conscious of any/all periodic reports that an independent entity publishes for your company’s industry. For example, in the insurance industry in the United States, the Federal Insurance Office of the U.S. Department of the Treasury publishes several reports on an annual basis discussing the industry at large, like this past year’s Annual Report on the Insurance Industry. (Admittedly, these kinds of reports are not always the most interesting things to read, but they are (usually) very informative.)\r\nThe same goes for the electricity grid and markets operated by the Electric Reliability Council of Texas (ERCOT) in Texas. Potomac Economics publishes an annual report “providing an independent assessment of the competitive performance and operational efficiency of the market” operated by ERCOT. This report tends to be pretty long—over 160 pages in every reports since 2016. A relatively large amount of the content is replication of language, figures, and tables from the prior years’ report, substituting and updating numbers from the past year. 1 As an annual reader of said report, I wish it were easier to “parse out” the most important things from a given year’s report. 2\r\nWith that in mind, I thought I would take a shot at using text analysis to compare Potomac Economics’ annual reports on ERCOT for three years—2016, 2017, and 2018—to, among other things, identify the most “unique” things in each report. This kind of analysis can enhance one’s understanding of current grid and market trends, as well as make one aware of things to look out for in the future.\r\nA Brief Outline of the “Process”\r\nWhile I initially planned on doing some kind of code tutorial with this project (primarily to demonstrate techniques for parsing and cleaning PDF text with R), I found that the code became more complex than I would have liked 3. (Let’s just say that regular expressions were my best friend.) Instead, I decided to focus this post the visuals I created, providing some brief commentary where needed.\r\nNonetheless, I think a high-level description of my “process” may be useful to the reader, as I think it is probably generalizable to any project of this likeness (i.e. text analysis of similarly structured documents). (For those who are interested in the code, it can all be found in this GitHub repo.) My approach (using R, of course can be simplified to the following set of steps.\r\nDownload the reports to a local directory and create a data frame with the year and file location of the report.\r\nImport the raw text for each report to create a singular data frame with nested data frames storing the text for each year’s report.\r\n“Unnest” the singular data frame to create a “long” data frame where each row represents a page in the reports.\r\nSplit this long data frame (with pages as observations) into two data frames, one for the table of contents (TOC) for each report and another for the body of each report.\r\nClean the two data frames (for TOC and body content) separately.\r\nCreate “child” data frames as needed for analysis, and make plots for key insights from this analysis.\r\nFrom this breakdown of the steps, it is evident that the effort that goes into the data pre-processing (i.e. steps 1 through 5) makes up most of the work! What most people perceive to be “data analysis” is all in step 6. In this case, the saying about “80% of data science is really data cleaning” could not be any truer.\r\nThe Analysis\r\nSo, what exactly does this report look like? Well, you could always open up one of the reports yourself and peruse the 160+ pages 4, but maybe the following screenshot of the 2018 report can provide some visual context. (If for nothing else, I thought this would be fun to look at.) I borrowed some code that data visualization phenom Nathan Yau demonstrated in a short write-up at his awesome website FlowingData.\r\n\r\nYou can really get an idea of the vast amount of charts and tables that make up each one of these reports just from this one figure!\r\nTable of Contents (TOC)\r\nNext, let’s begin to shape out this initial holistic perspective of the reports with some analysis of the table of contents (TOC). This may seem trivial, but I assure you that it’s not! With a large document like this, we really ought to have a solid understanding of the content that the document discusses.\r\nEach document’s TOC is broken down into a couple of sections, including:\r\nAn outline for the executive summary (on the first page of the TOC);\r\nAn outline of the first- and second-level sections of the body of the document (also starting on the first page of the TOC);\r\nA list of figures (starting on the second page of the TOC);\r\nA list of tables (on the fourth page).\r\nScreenshots of parts of the TOC of the 2018 report are shown below.\r\n\r\n\r\n\r\nA first question we might ask is “How do (counts of) the lists of figures and tables correspond to the sections of the text?” (For the sake of readability, I’ve truncated some of the section labels, e.g. “Review of Real-Time Market Outcomes” was truncated to just “RTM”, which is an abbreviation for Real-Time Market.)\r\n\r\nSo we see that the Real-Time Market (RTM) and Day-Ahead Market (DAM) sections seem to make a larger-than-equal share of the reports in terms of simple counts of figures and tables. We might hypothesize that these things are arguably the “easiest” things to track in a graphical or quantitative manner among the many aspects of electricity markets and grid operations. Conversely, we see that the Analysis section (truncated from “Analysis of Competitive Performance”) leverages plots and tables the least. We might say that this supports our hypothesis that, in a few words, may be stated as “easy-to-quantify topics have more figures and tables”. The section labels “Analysis” (shortend from “Analysis of Competitive Performance” for visualization purposes) suggests that its content is “deeper” in nature, and that its may not be quite as easy to illustrate via figures and tables.\r\nOur initial hypothesis—that easy-to-quantify topics have more figures and tables—seems reasonable enough, but is it just a direct consequence of the sections having more pages? We can plot the number of pages per section against the count of sections to help us answer this question.\r\n\r\nSo it seems that those sections having more pages do NOT necessarily have more figures and tables. So our hypothesis still seems reasonable.\r\nYou might have noticed that the first plot (the “treemap”) only showed data for the 2018 report. I didn’t deem it necessary/helpful to make the same plot for each of the three reports from 2016 through 2018 because, as it turns out, the TOC of the three reports are nearly identical in composition! (Really, this is probably unsurprising.) That is, they have identical—or near identical—names and indexes for sections, figures, and tables. From an analysis point of view, this is good–the structure of the three reports facilitates direct comparison.\r\nBut note that I say that the TOCs as nearly identical, not exactly identical. What exactly are the differences between the three? More specifically, we might be curious to know which figures and tables were only in one of the three reports.\r\n\r\nAha! We see that the 2016 and 2018 reports had more than a handful of figures and tables that were unique to those reports. The table below lists exactly which figures and tables those are.\r\nYear\r\nSection\r\nType\r\nLabel\r\n2016\r\nRTM\r\nfigure\r\nimplied heat rate duration curve top 2 percent of hours\r\n2016\r\nRTM\r\nfigure\r\naggregated peak hour generation offer stack\r\n2016\r\nRTM\r\nfigure\r\nload, reserves and prices in august\r\n2016\r\nSupply/Demand\r\nfigure\r\nload duration curve top five percent of hours\r\n2016\r\nSupply/Demand\r\nfigure\r\nhistoric coal generation and capacity factor\r\n2016\r\nSupply/Demand\r\nfigure\r\ntop and bottom ten percent of net load\r\n2016\r\nReliability\r\nfigure\r\nfrequency of reliability unit commitments\r\n2016\r\nReliability\r\nfigure\r\naverage on-line summer reserves\r\n2016\r\nReliability\r\nfigure\r\npotential for combined cycle capacity available to ruc in houston\r\n2016\r\nAnalysis\r\nfigure\r\nsurplus capacity\r\n2016\r\nRTM\r\ntable\r\n15-minute price changes as a percentage of annual average prices\r\n2016\r\nCongestion\r\ntable\r\nirresolvable elements\r\n2017\r\nSupply/Demand\r\nfigure\r\nload duration curve top five percent of hours with highest load\r\n2017\r\nSupply/Demand\r\nfigure\r\nenergy transacted across dc ties in august\r\n2018\r\nRTM\r\nfigure\r\nercot rena analysis\r\n2018\r\nRTM\r\nfigure\r\naverage real-time energy price spikes\r\n2018\r\nRTM\r\nfigure\r\nmonthly load exposure\r\n2018\r\nDAM\r\nfigure\r\ndaily collateral\r\n2018\r\nDAM\r\nfigure\r\naverage costs of procured sasm ancillary services\r\n2018\r\nDAM\r\nfigure\r\nercot-wide net ancillary service shortages\r\n2018\r\nDAM\r\nfigure\r\nqse-portfolio net ancillary service shortages\r\n2018\r\nCongestion\r\nfigure\r\n[year] crr auction revenue\r\n2018\r\nSupply/Demand\r\nfigure\r\nload duration curve top 5% of hours with highest load\r\n2018\r\nSupply/Demand\r\nfigure\r\nannual energy transacted across dc ties\r\n2018\r\nReliability\r\nfigure\r\ncapacity commitment timing july and august hour ending 17\r\n2018\r\nReliability\r\nfigure\r\nreal-time to cop comparisons for renewable capacity\r\n2018\r\nReliability\r\nfigure\r\nreal-time to cop comparisons for thermal capacity\r\n2018\r\nReliability\r\nfigure\r\nstandard deviations of real-time to cop capacity differences\r\n2018\r\nResource Adequacy\r\nfigure\r\nwest zone net revenues\r\n2018\r\nResource Adequacy\r\nfigure\r\nnet revenues by generation resource type\r\n2018\r\nAnalysis\r\nfigure\r\nderating, planned outages and forced outages\r\n2018\r\nReliability\r\ntable\r\nruc settlement\r\nOk, enough about the TOC. Let’s see what kind of things we can learn about the text.\r\nSentences\r\nWe saw that some sections have many more figures and tables than others and that this does not necessarily correlate with the number of pages in the section. Is there some kind of correlation with the number of sentences of text in each section?\r\n\r\nIt may (or may not) be surprising to find a lack of a relationship here. Given our previous finding that the number of figures and tables and the number of pages in a given section are not really related. 5\r\nNext, I think it is interesting to look at how the counts of sentences per section has changed over time.\r\n\r\nThe first thing we might notice from the plot is that the number of sentences has increased across all sections from their totals in 2016. Ok, so maybe that’s not so interesting—I think it’s reasonable to assume that an annual report like this incrementally adds on its “foundation” from the prior year(s).\r\nPerhaps the most interesting that we might observe from this graph is the “leaps” in the sentence counts from 2017 to 2018 for the Reliability and Resource Adequacy sections. One might draw a connection between this and what we observed earlier when looking at the figures and tables that were unique to a single report. There were more than a handful of observations for Resource Adequacy and Reliability (2 and 5 respectively) exclusive to the 2018 report.\r\nA final takeaway that I have from this chart is the “evenness” of the counts across the sections (which wasn’t quite as obvious in the previous plot depicting sentence counts). The difference between the maximum and the minimum number of sentences per section in a given year is always below 50. Personally, I might have expected greater variation. Either way, it doesn’t really say anything about the “goodness” of the content; this is just something—the count of sentences in a section of a long document—for which I don’t really have a strong prior knowledge. 6\r\nOk, so the prior plot wasn’t so complex, so let’s now look at something more complicated and which deserves some explanation.\r\nOne of the things that I really wanted to investigate when I started this analysis was “text similarity”—just how much of each report is “boiler-plate, copy-paste” text? There are lots of ways of going about quantifying this. (Just do an Internet search for Natural Language Processing (NLP) and word embeddings and see what kind of rabbit hole that takes you down.) I decided to use cosine similarity 7 of sentences. 8\r\nTo provide a kind of “baseline” expectation of what these cosine similarity values might be, see the table below. It provides a handful of simple examples of the cosine similarity for singular strings of characters. 9\r\nCase\r\nDescription\r\nString 1\r\nString 2\r\nCosine Similarity\r\n1\r\nIdentical strings.\r\nabcde\r\nabcde\r\n1.00\r\n2\r\nOne different character (“z” in String 2 instead of “a”).\r\nabcde\r\nzbcde\r\n0.80\r\n3\r\nTwo different characters (“z” and “y” in String 2 instead of “a” and “b”).\r\nabcde\r\nzycde\r\n0.60\r\n4\r\nAll different characters.\r\nabcde\r\nfghij\r\n0.00\r\n5\r\nDifferent ordering of characters, but identical characters.\r\nabcde\r\nbaecd\r\n1.00\r\n6\r\nRepeated characters (“a” in String 2), one-character difference in string lengths.\r\nabcde\r\naabcde\r\n0.95\r\n7\r\nRepeated characters (“a” twice in String 2), two-character difference in string lengths.\r\nabcde\r\naaabcde\r\n0.87\r\n8\r\nSame characters, one additional character (“z” in String 2) in one string.\r\nabcde\r\nabcdef\r\n0.91\r\n9\r\nSame characters, one additional character (“e” in String 1) in one string.\r\nabcde\r\nabcd\r\n0.89\r\nCases 2 and 3 in the table above are probably the most illustrative of the cosine similarity calculation. In case 2, a one-character difference in two strings having five characters total results in a value of 0.8. (i.e. Four of five characters matched.) In case 3, a two-character difference (given the same setup) results in a value of 0.6. (i.e. Three of five characters matched.)\r\nNote that the cosine similarity calculation is identical for different types of text tokens (i.e. sentences, paragraphs, etc.). In general, the calculated values are likely to be smaller for longer tokens.\r\nOk, so given the above examples and explanation, we now have some context for understanding (and appreciating) the high degree of sentence similarity demonstrated across the reports, as illustrated in the figure below.\r\n\r\nIf you have read the reports, you’ll realize that there are lots of “repeated” sentences across the documents. For example, take the description of the first figure in 2018: “Figure 1 summarizes changes in energy prices and other market costs by showing the all-in price of electricity, which is a measure of the total cost of serving load in ERCOT for 2016 through 2018.” The “same” sentence in the 2017 report is “Figure 1 summarizes changes in energy prices and other market costs by showing the all-in price of electricity, which is a measure of the total cost of serving load in ERCOT for 2015 through 2017.” Just by inspection, you can tell that these two sentences would have a cosine similarity almost equal to 1. In fact, I did some extra text-processing—most notably, replacing year and months with generic labels, e.g. “[year]” and “[month]”—that would make these two sentences appear exactly identical (and, consequently, have a cosine similarity of exactly 1). This whole effort to quantify of sentence similarity was probably the most interesting thing to me out of this entire analysis. 10\r\nI think that’s enough about sentences. Let’s next explore what we might learn from just the words.\r\nWords\r\nOne of the best ways to gauge “importance” of words (or any kind of text token) across multiple documents is term-frequency, inverse-document-frequency (TF-IDF). 11\r\nFirst, let’s use TFIDF to identify which sections have the most “unique” words (aggregating across the three reports).\r\n\r\nSo we see that the Analysis section appears to be the most unique from this perspective. This deduction can be interpreted as an extension of the hypothesis developed earlier—that easy-to-quantify topics have more figures and tables. The extension of this notion can be stated explicitly as “easy-to-quantify topics” have less unique words.\r\nWhat exactly are some of the words that were identified as the most unique?\r\n\r\nThe “chatter” plot 12 above depicts the most unique words identified by TFIDF (after applying common text processing techniques such as “stemming” and dropping “stop words”). Several of the words shown happen to be words associated with sources of high electric transmission congestion 13 in the Texas grid during the year for the which the report was made. This set of words could be potentially leveraged as a starting point for an ambitious reader who is curious to learn more about the Texas electricity grid.\r\nThe End\r\nI had a really fun time exploring this topic. I encourage any readers to do something similar with periodic or standardized reports that are relevant to you in some way. If they are boring to you (yet you must read them for whatever reason), then a text analysis like that demonstrated here can really spark some life into your consumption of the report!\r\n\r\nThis is not a knock on the report whatsoever—annual reports will inevitably have redundancy like this! In fact, I really do enjoy the report. The explanations of the various (and sometimes complex) aspects of the electric reliability and market operation are fantastic.↩︎\r\nThe executive summary section at the beginning of each report actually does a very good job of this already, but I was curious if we could identify “highlights” from a given year in a more quantitative/rigorous manner.↩︎\r\nNot to say that it is extremely complex, but it’s not exactly trivial.↩︎\r\nThe 2016 report has 160 pages total, and the 2017 and 2018 reports are even longer, so we can say 160 pages is a lower bound for our purposes. These totals include the title page, blank pages, and the table of contents, so its an overestimation of the actual content presented in the report.↩︎\r\nA similar plot could have been made for the counts of figures and tables, but, as I hinted at before, doing so was would have been trivial since those totals weren’t much different across the three reports. (That’s why it was more interesting to look at the differences in the figures and tables included in the reports.)↩︎\r\nThat’s the cool thing about plotting this kind of data—you gain an understanding of something that you wouldn’t have known otherwise, which often invites further questions and insight. This is true of data visualization in general↩︎\r\nalso employing normalization and penalization↩︎\r\nI might have instead tried using Jaccard Similarity, word mover’s distance, or one of the several others described eloquently in this blog post; and, furthermore, I could have used other forms of text tokens, such as words (more granular) or paragraphs (less granular).↩︎\r\nThese calculations employ the {tidystringdist} package, written by the one-and-only Colin Fay.↩︎\r\nIf nothing else, this part of the analysis was a great opportunity to experiment with the wonderful {text2vec} package.↩︎\r\nIf you’re looking to do text analysis using R, then I highly recommend reading through the wonderful Tidy Text Mining with R book by David Robinson and Julia Silge↩︎\r\nwhich, in my opinion, is a better format for illustrating word importance compared to a word cloud↩︎\r\nThis concept is analogous to traffic congestion, but for electricity.↩︎\r\n",
    "preview": "posts/text-parsing-analysis-periodic-report/viz_words_section_tfidf.PNG",
    "last_modified": "2021-07-01T22:09:47-05:00",
    "input_file": {},
    "preview_width": 3600,
    "preview_height": 2400
  },
  {
    "path": "posts/rstudio-conf-2019-summary/",
    "title": "Summarizing rstudio conf 2019 Summaries",
    "description": "A Meta Analysis Using Tidy Text Techniques",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2019-01-27",
    "categories": [
      "r"
    ],
    "contents": "\r\nTo be honest, I planned on writing a review of this past weekend’s rstudio::conf 2019, but several other people have already done a great job of doing that—just check out Karl Broman’s aggregation of reviews at the bottom of the page here! (More on this in a second.) In short, my thoughts on the whole experience are captured perfectly by Nick Strayer’s tweet the day after the conference ended.\r\n\r\nAnyways, I figured that this was the perfect opportunity to do some text analysis. Why not extract the text from the reviews of others—linked in Karl’s repo—and make my own summary of the event? Plotting word frequencies and sentiments, while not exactly “cutting edge” compared to robust natural language processing techniques, is perfect for getting a nice, simple overview of the conference. (I have applied some of the techniques described by David Robinson and Julia Silge in their Tidy Text Mining with R book\r\nMoreover, after reading Bob Rudis’s recent post and discovering his work-in-progress \" {curl} +{httr} + {rvest}\" package called {reapr}, I realized that the work of cleaning the HTML and text for each person’s blog post would not be so bad. In fact, it turned out to be as easy as reapr::reap_url() %>% reapr::mill() (with only a little bit of extra work :smile:).\r\nAfter trying a couple of different approaches (e.g. bigrams, topic modeling, etc.) and experimenting with some different visualizations, I ended up making the two plots below. (To the interested reader, I’ve included all of the code at the bottom of this post.) From the second plot—where positive sentiment heavily outweighs negative sentiment—one thing is clear: the R community is super supportive and positive, just as Nick alluded to in his tweet.\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/rstudio-conf-2019-summary/headliner.jpg",
    "last_modified": "2021-07-01T22:11:28-05:00",
    "input_file": {}
  },
  {
    "path": "posts/nested-json-to-tidy-data-frame-r/",
    "title": "Converting nested JSON to a tidy data frame with R",
    "description": "Web Scraping Made Easier",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2018-10-20",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nGetting the data\r\nParsing the data\r\nPost-processing the data\r\nSign-off\r\n\r\nUPDATE: The data retrieval demonstrated in this post no longer seems to work due to a change in the ESPN’S “secret” API. In any matter, the techniques for working with JSON data are still valid.\r\nIn this “how-to” post, I want to detail an approach that others may find useful for converting nested (nasty!) json to a tidy (nice!) data.frame/tibble that is should be much easier to work with. 1\r\nFor this demonstration, I’ll start out by scraping National Football League (NFL) 2018 regular season week 1 score data from ESPN, which involves lots of nested data in its raw form. 2\r\nThen, I’ll work towards getting the data in a workable format (a data.frame!). (This is the crux of what I want to show.) Finally, I’ll filter and wrangle the data to generate a final, presentable format.\r\nEven if one does not care for sports and knows nothing about the NFL, I believe that the techniques that I demonstrate are generalizable to a broad set of JSON-related “problems”.\r\nGetting the data\r\nLet’s being with importing the package(s) that we’ll need.\r\nNext, we’ll create a variable for the url from which we will get the data. The url here will request the scores for week 1 of the 2018 NFL season from ESPN’s “secret” API. 3\r\n\r\n\r\nurl <- \"http://site.api.espn.com/apis/site/v2/sports/football/nfl/scoreboard?&dates=2018&seasontype=2&week=1\"\r\n\r\n\r\n\r\nAnd now, the actual HTTP GET request for the data (using the {httr} package’s appropriately named GET() function).\r\n\r\n\r\nresp <- httr::GET(url)\r\nresp\r\n\r\n\r\n\r\n\r\n\r\n## Response [http://site.api.espn.com/apis/site/v2/sports/football/nfl/scoreboard?&dates=2018&seasontype=2&week=1]\r\n##   Date: 2018-10-24 18:41\r\n##   Status: 200\r\n##   Content-Type: application/json;charset=UTF-8\r\n##   Size: 189 kB\r\n\r\n\r\n\r\nEverything seems to be going well. However, after using another handy {httr} function—content()—to extract the data, we see that the data is an nasty nested format! (I only print out some of the top-level elements to avoid cluttering the page.)\r\n\r\n\r\ncont_raw <- httr::content(resp)\r\nstr(cont_raw, max.level = 3, list.len = 4)\r\n\r\n\r\n\r\n\r\n\r\n## List of 4\r\n##  $ leagues:List of 1\r\n##   ..$ :List of 11\r\n##   .. ..$ id                 : chr \"28\"\r\n##   .. ..$ uid                : chr \"s:20~l:28\"\r\n##   .. ..$ name               : chr \"National Football League\"\r\n##   .. ..$ abbreviation       : chr \"NFL\"\r\n##   .. .. [list output truncated]\r\n##  $ season :List of 2\r\n##   ..$ type: int 2\r\n##   ..$ year: int 2018\r\n##  $ week   :List of 1\r\n##   ..$ number: int 1\r\n##  $ events :List of 16\r\n##   ..$ :List of 9\r\n##   .. ..$ id          : chr \"401030710\"\r\n##   .. ..$ uid         : chr \"s:20~l:28~e:401030710\"\r\n##   .. ..$ date        : chr \"2018-09-07T00:55Z\"\r\n##   .. ..$ name        : chr \"Atlanta Falcons at Philadelphia Eagles\"\r\n##   .. .. [list output truncated]\r\n##   ..$ :List of 9\r\n##   .. ..$ id          : chr \"401030718\"\r\n##   .. ..$ uid         : chr \"s:20~l:28~e:401030718\"\r\n##   .. ..$ date        : chr \"2018-09-09T17:00Z\"\r\n##   .. ..$ name        : chr \"Pittsburgh Steelers at Cleveland Browns\"\r\n##   .. .. [list output truncated]\r\n##   ..$ :List of 9\r\n##   .. ..$ id          : chr \"401030717\"\r\n##   .. ..$ uid         : chr \"s:20~l:28~e:401030717\"\r\n##   .. ..$ date        : chr \"2018-09-09T17:00Z\"\r\n##   .. ..$ name        : chr \"Cincinnati Bengals at Indianapolis Colts\"\r\n##   .. .. [list output truncated]\r\n##   ..$ :List of 9\r\n##   .. ..$ id          : chr \"401030716\"\r\n##   .. ..$ uid         : chr \"s:20~l:28~e:401030716\"\r\n##   .. ..$ date        : chr \"2018-09-09T17:00Z\"\r\n##   .. ..$ name        : chr \"Tennessee Titans at Miami Dolphins\"\r\n##   .. .. [list output truncated]\r\n##   .. [list output truncated]\r\n\r\n\r\n\r\nParsing the data\r\nGiven the nature of the data, we might hope that the {jsonlite} package will save us here. However, straightforward usage of it’s fromJSON() package only reduces the mess a bit.\r\n\r\n\r\ndf_raw_ugly <- jsonlite::fromJSON(rawToChar(resp$content))\r\nglimpse(df_raw_ugly, max.level = 3, list.len = 4)\r\n\r\n\r\n\r\n\r\n\r\n## List of 4\r\n##  $ leagues:'data.frame': 1 obs. of  11 variables:\r\n##   ..$ id                 : chr \"28\"\r\n##   ..$ uid                : chr \"s:20~l:28\"\r\n##   ..$ name               : chr \"National Football League\"\r\n##   ..$ abbreviation       : chr \"NFL\"\r\n##   .. [list output truncated]\r\n##  $ season :List of 2\r\n##   ..$ type: int 2\r\n##   ..$ year: int 2018\r\n##  $ week   :List of 1\r\n##   ..$ number: int 1\r\n##  $ events :'data.frame': 16 obs. of  9 variables:\r\n##   ..$ id          : chr [1:16] \"401030710\" \"401030718\" \"401030717\" \"401030716\" ...\r\n##   ..$ uid         : chr [1:16] \"s:20~l:28~e:401030710\" \"s:20~l:28~e:401030718\" \"s:20~l:28~e:401030717\" \"s:20~l:28~e:401030716\" ...\r\n##   ..$ date        : chr [1:16] \"2018-09-07T00:55Z\" \"2018-09-09T17:00Z\" \"2018-09-09T17:00Z\" \"2018-09-09T17:00Z\" ...\r\n##   ..$ name        : chr [1:16] \"Atlanta Falcons at Philadelphia Eagles\" \"Pittsburgh Steelers at Cleveland Browns\" \"Cincinnati Bengals at Indianapolis Colts\" \"Tennessee Titans at Miami Dolphins\" ...\r\n##   .. [list output truncated]\r\n\r\n\r\n\r\nOne could go on and try some other functions from the {jsonlite} package (or another JSON-related package), but, in my own attempts, I was unable to figure out a nice way of getting a data.frame(). (This is not to say that there is something wrong with the package—I simply could not figure out how to use it to get the result that I wanted.)\r\nSo, what to do now? Well, after some struggling, I stumbled upon the following solution to put me on the right path.\r\n\r\n\r\ndf_raw <- enframe(unlist(cont_raw))\r\ndf_raw\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6,629 x 2\r\n##    name                     value                   \r\n##    <chr>                    <chr>                   \r\n##  1 leagues.id               28                      \r\n##  2 leagues.uid              s:20~l:28               \r\n##  3 leagues.name             National Football League\r\n##  4 leagues.abbreviation     NFL                     \r\n##  5 leagues.slug             nfl                     \r\n##  6 leagues.season.year      2018                    \r\n##  7 leagues.season.startDate 2018-08-02T07:00Z       \r\n##  8 leagues.season.endDate   2019-02-06T07:59Z       \r\n##  9 leagues.season.type.id   2                       \r\n## 10 leagues.season.type.type 2                       \r\n## # ... with 6,619 more rows\r\n\r\n\r\n\r\nCombining unlist() and tibble::enframe(), we are able to get a (very) long data.frame without any nested elements! Note that the would-have-been-nested elements are joined by “.” in the “name” column, and the values associated with these elements are in the “value” column. (These are the default column names that tibble::enframe() assigns to the tibble that it creates from a list.)\r\nWhile this tibble is still not in a tidy format—there are variables implicitly stored in the “name” column rather than in their own columns—–it’s in a much more user-friendly format (in my opinion). (e.g The variable \"leagues.season.startDate\" implicitly encodes three variables—\"leagues\", \"season\", and \"startDate\"—each deserving of their own column.)\r\nGiven the format of the implicit variable sin the “name” column, We can use tidyr::separate() to create columns for each.\r\n\r\n\r\ndf_raw %>% separate(name, into = c(paste0(\"x\", 1:10)))\r\n\r\n\r\n\r\n\r\n\r\n## Warning: Expected 10 pieces. Missing pieces filled with `NA` in 6629\r\n## rows [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,\r\n## 20, ...].\r\n\r\n## # A tibble: 6,629 x 11\r\n##    x1     x2      x3    x4    x5    x6    x7    x8    x9    x10   value   \r\n##    <chr>  <chr>   <chr> <chr> <chr> <chr> <chr> <chr> <chr> <chr> <chr>   \r\n##  1 leagu~ id      <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  28      \r\n##  2 leagu~ uid     <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  s:20~l:~\r\n##  3 leagu~ name    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  Nationa~\r\n##  4 leagu~ abbrev~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  NFL     \r\n##  5 leagu~ slug    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  nfl     \r\n##  6 leagu~ season  year  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2018    \r\n##  7 leagu~ season  star~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2018-08~\r\n##  8 leagu~ season  endD~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2019-02~\r\n##  9 leagu~ season  type  id    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2       \r\n## 10 leagu~ season  type  type  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2       \r\n## # ... with 6,619 more rows\r\n\r\n\r\n\r\nWe get a warning indicating when using separate() because we have “over-estimated” how many columns we will need to create. Note that, with my specification of (dummy) column names with the into argument, I guessed that there we would need 10 columns. Why 10? Because I expected that 10 would be more than I needed, and it’s better to over-estimate and remove the extra columns in a subsequent step than to under-estimate and lose data because there are not enough columns to put the “separated” data in.\r\nWe can get rid of the warning by providing an appropriate value for separate()’s fill argument. (Note that \"warn\" is the default value of the fill argument.)\r\n\r\n\r\ndf_raw %>% separate(name, into = c(paste0(\"x\", 1:10)), fill = \"right\")\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6,629 x 11\r\n##    x1     x2      x3    x4    x5    x6    x7    x8    x9    x10   value   \r\n##    <chr>  <chr>   <chr> <chr> <chr> <chr> <chr> <chr> <chr> <chr> <chr>   \r\n##  1 leagu~ id      <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  28      \r\n##  2 leagu~ uid     <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  s:20~l:~\r\n##  3 leagu~ name    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  Nationa~\r\n##  4 leagu~ abbrev~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  NFL     \r\n##  5 leagu~ slug    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  nfl     \r\n##  6 leagu~ season  year  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2018    \r\n##  7 leagu~ season  star~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2018-08~\r\n##  8 leagu~ season  endD~ <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2019-02~\r\n##  9 leagu~ season  type  id    <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2       \r\n## 10 leagu~ season  type  type  <NA>  <NA>  <NA>  <NA>  <NA>  <NA>  2       \r\n## # ... with 6,619 more rows\r\n\r\n\r\n\r\nHowever, while this action gets rid of the warning, it does not actually resolve the underlying issue—specifying the correct number of columns to create with separate(). We can do that by identifying the name with the most number of “dots” (i.e. .s).\r\n\r\n\r\nrgx_split <- \"\\\\.\"\r\nn_cols_max <-\r\n  df_raw %>%\r\n  pull(name) %>% \r\n  str_split(rgx_split) %>% \r\n  map_dbl(~length(.)) %>% \r\n  max()\r\nn_cols_max\r\n\r\n\r\n\r\n\r\n\r\n## [1] 7\r\n\r\n\r\n\r\nWith this number (7) identified, we can now choose the “correct” number of columns to create with separate(). Note that we’ll still be left with lots of NA values (corresponding to rows that don’t have the maximum number of variables). This is expected.\r\n\r\n\r\nnms_sep <- paste0(\"name\", 1:n_cols_max)\r\ndf_sep <-\r\n  df_raw %>% \r\n  separate(name, into = nms_sep, sep = rgx_split, fill = \"right\")\r\ndf_sep\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 6,629 x 8\r\n##    name1   name2      name3    name4 name5 name6 name7 value              \r\n##    <chr>   <chr>      <chr>    <chr> <chr> <chr> <chr> <chr>              \r\n##  1 leagues id         <NA>     <NA>  <NA>  <NA>  <NA>  28                 \r\n##  2 leagues uid        <NA>     <NA>  <NA>  <NA>  <NA>  s:20~l:28          \r\n##  3 leagues name       <NA>     <NA>  <NA>  <NA>  <NA>  National Football ~\r\n##  4 leagues abbreviat~ <NA>     <NA>  <NA>  <NA>  <NA>  NFL                \r\n##  5 leagues slug       <NA>     <NA>  <NA>  <NA>  <NA>  nfl                \r\n##  6 leagues season     year     <NA>  <NA>  <NA>  <NA>  2018               \r\n##  7 leagues season     startDa~ <NA>  <NA>  <NA>  <NA>  2018-08-02T07:00Z  \r\n##  8 leagues season     endDate  <NA>  <NA>  <NA>  <NA>  2019-02-06T07:59Z  \r\n##  9 leagues season     type     id    <NA>  <NA>  <NA>  2                  \r\n## 10 leagues season     type     type  <NA>  <NA>  <NA>  2                  \r\n## # ... with 6,619 more rows\r\n\r\n\r\n\r\nBy my interpretation, this df_sep variable is in tidy format. (Of course, there is still lots of cleaning to be done before it can actually be useful!)\r\nPost-processing the data\r\nGetting the raw data in the format that df_sep is what I primarily wanted to show. Nonetheless, there’s more to the story! (Reminder: We’re seeking to get the scores from the 16 games in week 1 of the NFL’s 2018 regular season.) How can we work with the NAs to get a final format that is actually presentable?\r\nWe continue by filter the tibble for only the rows that we will need.\r\n\r\n\r\ndf_filt <-\r\n  df_sep %>%\r\n  filter(\r\n    (\r\n      name1 == \"events\" &\r\n        name2 == \"shortName\"\r\n    ) |\r\n      (\r\n        name1 == \"events\" &\r\n          name2 == \"competitions\" &\r\n          name3 == \"date\"\r\n      ) | (\r\n        name1 == \"events\" &\r\n          name2 == \"competitions\" &\r\n          name3 == \"status\" &\r\n          name4 == \"type\" &\r\n          name5 == \"name\"\r\n      ) |\r\n      (\r\n        name1 == \"events\" &\r\n          name2 == \"competitions\" &\r\n          name3 == \"competitors\" &\r\n          name4 == \"score\"\r\n      )\r\n  )\r\ndf_filt\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 80 x 8\r\n##    name1  name2        name3      name4 name5 name6 name7 value           \r\n##    <chr>  <chr>        <chr>      <chr> <chr> <chr> <chr> <chr>           \r\n##  1 events shortName    <NA>       <NA>  <NA>  <NA>  <NA>  ATL @ PHI       \r\n##  2 events competitions date       <NA>  <NA>  <NA>  <NA>  2018-09-07T00:5~\r\n##  3 events competitions competito~ score <NA>  <NA>  <NA>  18              \r\n##  4 events competitions competito~ score <NA>  <NA>  <NA>  12              \r\n##  5 events competitions status     type  name  <NA>  <NA>  STATUS_FINAL    \r\n##  6 events shortName    <NA>       <NA>  <NA>  <NA>  <NA>  PIT @ CLE       \r\n##  7 events competitions date       <NA>  <NA>  <NA>  <NA>  2018-09-09T17:0~\r\n##  8 events competitions competito~ score <NA>  <NA>  <NA>  21              \r\n##  9 events competitions competito~ score <NA>  <NA>  <NA>  21              \r\n## 10 events competitions status     type  name  <NA>  <NA>  STATUS_FINAL    \r\n## # ... with 70 more rows\r\n\r\n\r\n\r\nNext, we’ll create appropriately named columns for the values that we filtered for in the step above. 4\r\n\r\n\r\ndf_clean1 <-\r\n  df_filt %>%\r\n  select(name3, name4, name5, value) %>%\r\n  mutate(status = if_else(name5 == \"name\", value, NA_character_)) %>%\r\n  mutate(isscore = if_else(name4 == \"score\", TRUE, FALSE)) %>%\r\n  mutate(datetime = if_else(\r\n    name3 == \"date\",\r\n    str_replace_all(value, \"\\\\s?T\\\\s?\", \" \") %>% str_replace(\"Z$\", \"\"),\r\n    NA_character_\r\n  )) %>%\r\n  mutate(gm = if_else(\r\n    is.na(isscore) &\r\n      is.na(datetime) & is.na(status),\r\n    value,\r\n    NA_character_\r\n  ))\r\ndf_clean1\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 80 x 8\r\n##    name3    name4 name5 value       status    isscore datetime     gm     \r\n##    <chr>    <chr> <chr> <chr>       <chr>     <lgl>   <chr>        <chr>  \r\n##  1 <NA>     <NA>  <NA>  ATL @ PHI   <NA>      NA      <NA>         ATL @ ~\r\n##  2 date     <NA>  <NA>  2018-09-07~ <NA>      NA      2018-09-07 ~ <NA>   \r\n##  3 competi~ score <NA>  18          <NA>      TRUE    <NA>         <NA>   \r\n##  4 competi~ score <NA>  12          <NA>      TRUE    <NA>         <NA>   \r\n##  5 status   type  name  STATUS_FIN~ STATUS_F~ FALSE   <NA>         <NA>   \r\n##  6 <NA>     <NA>  <NA>  PIT @ CLE   <NA>      NA      <NA>         PIT @ ~\r\n##  7 date     <NA>  <NA>  2018-09-09~ <NA>      NA      2018-09-09 ~ <NA>   \r\n##  8 competi~ score <NA>  21          <NA>      TRUE    <NA>         <NA>   \r\n##  9 competi~ score <NA>  21          <NA>      TRUE    <NA>         <NA>   \r\n## 10 status   type  name  STATUS_FIN~ STATUS_F~ FALSE   <NA>         <NA>   \r\n## # ... with 70 more rows\r\n\r\n\r\n\r\nWith these columns created, we can use tidyr::fill() and dplyr::filter() in a strategic manner to get rid of all the NAs cluttering our tibble. Additionally, we can drop the dummy name columns that we created with the tidyr::separate() call before.\r\n\r\n\r\ndf_clean2 <-\r\n  df_clean1 %>% \r\n  fill(status, .direction = \"up\") %>%\r\n  filter(status == \"STATUS_FINAL\") %>%\r\n  fill(gm, .direction = \"down\") %>%\r\n  fill(datetime, .direction = \"down\") %>%\r\n  filter(name3 == \"competitors\") %>% \r\n  select(-matches(\"name[0-9]\"))\r\ndf_clean2\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 32 x 5\r\n##    value status       isscore datetime         gm       \r\n##    <chr> <chr>        <lgl>   <chr>            <chr>    \r\n##  1 18    STATUS_FINAL TRUE    2018-09-07 00:55 ATL @ PHI\r\n##  2 12    STATUS_FINAL TRUE    2018-09-07 00:55 ATL @ PHI\r\n##  3 21    STATUS_FINAL TRUE    2018-09-09 17:00 PIT @ CLE\r\n##  4 21    STATUS_FINAL TRUE    2018-09-09 17:00 PIT @ CLE\r\n##  5 23    STATUS_FINAL TRUE    2018-09-09 17:00 CIN @ IND\r\n##  6 34    STATUS_FINAL TRUE    2018-09-09 17:00 CIN @ IND\r\n##  7 27    STATUS_FINAL TRUE    2018-09-09 17:00 TEN @ MIA\r\n##  8 20    STATUS_FINAL TRUE    2018-09-09 17:00 TEN @ MIA\r\n##  9 24    STATUS_FINAL TRUE    2018-09-09 17:00 SF @ MIN \r\n## 10 16    STATUS_FINAL TRUE    2018-09-09 17:00 SF @ MIN \r\n## # ... with 22 more rows\r\n\r\n\r\n\r\nFinally, we can use a chain of {dplyr} actions to get a pretty output. I should note that it is likely that everything up to this point would have an analogous action no matter what the data set is that you are working with. However, these final actions are unique to this specific data.\r\n\r\n\r\ndf_clean3 <-\r\n  df_clean2 %>% \r\n  group_by(gm) %>%\r\n  mutate(rn = row_number()) %>%\r\n  ungroup() %>%\r\n  mutate(tm_dir = if_else(rn == 1, \"pts_home\", \"pts_away\")) %>%\r\n  select(datetime, gm, tm_dir, value) %>%\r\n  spread(tm_dir, value) %>%\r\n  separate(gm, into = c(\"tm_away\", \"tm_home\"), sep = \"(\\\\s+\\\\@\\\\s+)|(\\\\s+vs.*\\\\s+)\") %>% \r\n  mutate_at(vars(matches(\"pts\")), funs(as.integer)) %>%\r\n  mutate(date = datetime %>% str_remove(\"\\\\s.*$\") %>% lubridate::ymd()) %>%\r\n  mutate(time = datetime %>% lubridate::ymd_hm()) %>%\r\n  select(date, time, tm_home, tm_away, pts_home, pts_away)\r\ndf_clean3\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 16 x 6\r\n##    date       time                tm_home tm_away pts_home pts_away\r\n##    <date>     <dttm>              <chr>   <chr>      <int>    <int>\r\n##  1 2018-09-07 2018-09-07 00:55:00 PHI     ATL           18       12\r\n##  2 2018-09-09 2018-09-09 17:00:00 BAL     BUF           47        3\r\n##  3 2018-09-09 2018-09-09 17:00:00 IND     CIN           23       34\r\n##  4 2018-09-09 2018-09-09 17:00:00 NE      HOU           27       20\r\n##  5 2018-09-09 2018-09-09 17:00:00 NYG     JAX           15       20\r\n##  6 2018-09-09 2018-09-09 17:00:00 CLE     PIT           21       21\r\n##  7 2018-09-09 2018-09-09 17:00:00 MIN     SF            24       16\r\n##  8 2018-09-09 2018-09-09 17:00:00 NO      TB            40       48\r\n##  9 2018-09-09 2018-09-09 17:00:00 MIA     TEN           27       20\r\n## 10 2018-09-09 2018-09-09 20:05:00 LAC     KC            28       38\r\n## 11 2018-09-09 2018-09-09 20:25:00 CAR     DAL           16        8\r\n## 12 2018-09-09 2018-09-09 20:25:00 DEN     SEA           27       24\r\n## 13 2018-09-09 2018-09-09 20:25:00 ARI     WSH            6       24\r\n## 14 2018-09-10 2018-09-10 00:20:00 GB      CHI           24       23\r\n## 15 2018-09-10 2018-09-10 23:10:00 DET     NYJ           17       48\r\n## 16 2018-09-11 2018-09-11 02:20:00 OAK     LAR           13       33\r\n\r\n\r\n\r\nAnd there we have it! A nice, tidy tibble with the scores of the first week of regular season games in the 2018 NFL regular season.\r\nSign-off\r\nHopefully someone out there will find the technique(s) shown in this post to be useful for an endeavor of their own.\r\nPersonally, I find web scraping to be fascinating, so I doubt this will be the last time I write about something of this nature.\r\n\r\nI use data.frame and tibble interchangeably. See this chapter of the R for Data Science for more details about the differences/similarities between the two.↩︎\r\n(See the webpage here: http://www.espn.com/nfl/scoreboard/_/year/2018/seasontype/2/week/1. Note that we won’t be scraping the html, but, instead, the underlying JSON from which the html is generated.)↩︎\r\nI say that it’s a secret because it’s API documentation is out of date.↩︎\r\nI don’t recommend suffixing variable names with numbers as I do in the next couple of step (i.e. variables suffixed with 1, 2, …) (It’s ugly!) In practice, you might do this during your exploratory phase of data scraping/analysis, but you should come up with more informative names and combine actions in a logical manner for your final script/package (in my opinion).↩︎\r\n",
    "preview": "posts/nested-json-to-tidy-data-frame-r/featured.jpg",
    "last_modified": "2021-07-01T22:12:00-05:00",
    "input_file": {}
  },
  {
    "path": "posts/using-flexdashboard/",
    "title": "Thoughts on Using Flexdashboard",
    "description": "Examples and Alternatives",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2018-04-30",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nThe Alternatives\r\nSome Other Opinions\r\nConclusion\r\n\r\nI’ve experimented with the {flexdashboard} package for a couple of things after first trying out not so long ago. In particular, I found the storyboard format to be my favorite. I used it to create the storyboard for tracking the activity of NBA team Twitter accounts.\r\n\r\nRecently, I’ve been experimenting with the storyboard {flexdashboard} format for visualizing the weekly NFL picks that my brother and I do.\r\n\r\nThe Alternatives\r\nIn all, I have found {flexdashboard}s to be an extremely effective format. It functions as a good compromise among a number of different alternatives.\r\nA “standard” document knitted from a .Rmd file (e.g. HTML, Markdown, Word, or PDF). In my opinion, the main advantage of {flexdashboard} compared to the traditional .Rmd-knitr-Rmarkdown workflow is the ease with which shiny apps and other interactive formats (e.g. htmlwidgets can be integrated. 1\r\nA presentation knitted from a .Rmd file (i.e. a beamer_presentation, ioslides_presentation, slidy_presentation, or a revealjs::revealjs_presentation). Compared to these formats, I have found that modifying the default styling of the base CSS is much simpler with the themes in the {flexdashboard} package.\r\nA “standard” R presentation (with the .Rpres extension). I must admit that I don’t have much experience with the .Rpres format–I prefer Rmarkdown and the capability that it offers to create different kinds of output from a single “base” file.\r\nA {shinydashboard}. In comparison to shinydashboards, I like the “light-weight” framework offered by {flexdashboard}. While shinydashboard is certainly a better option for developing a complex dashboard (perhaps for a business purpose), this is not typically my use case.\r\nSome Other Opinions\r\nHere’s a couple of my other thoughts and tips for using {flexdashboard}:\r\nAdding JavaScript functionality is straightforward.\r\nFor example, I have used the following snippet of code to add functionality for a “toggle” button to show/hide code.\r\n<script>\r\n  $(\".toggle\").click(function() {\r\n    $(this).toggleClass(\"open\");\r\n  });\r\n<\/script>\r\nCustomizing the colors and styles (with .css) is also simple.\r\nWhen modifying a theme’s CSS, the typical/recommended approach is to use the browser’s “Inspect” tool (or some browser extension such as Selector Gadget to identify which specific styles to adjust.\r\nFor example, if the theme that is chosen for the {flexdashboard} (in particular, the storyboard format) uses the same styling for code and its output, the following CSS code can be used to distinguish the two.\r\npre.sourceCode.r {\r\n  background-color: #ffffff;\r\n}\r\nTo add to this technique, because the CSS files in the {flexdashboard} package, it’s not too difficult to simply pick out the file for the theme that is being used (see the resources/ folder in the package’s GitHub repo) and quickly identify what to modify.\r\nConclusion\r\nAs if I need to re-iterate it again, I would highly recommend trying out the {flexdashboard} package. If anything, you’ll learn that you don’t like it.\r\n\r\nThese can also be be embedded into .html files knitted from a .Rmdfile, but I think that it’s more natural in the {flexdashboard} context. Also, I believe that the HTML format is the only standard .Rmd output format that has interactive capability, so other output formats cannot be used if opting for the knitr-Rmarkdown combo.↩︎\r\n",
    "preview": "posts/using-flexdashboard/featured.jpg",
    "last_modified": "2021-07-01T22:08:53-05:00",
    "input_file": {}
  },
  {
    "path": "posts/text-analysis-rweekly/",
    "title": "A Meta Analysis of R Weekly Posts",
    "description": "With Tidy Text Techniques",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2018-03-05",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nScraping and Cleaning\r\nAnalyzing\r\nLines and Links\r\nWords\r\nMost Unique Words\r\n\r\n\r\nIntroduction\r\nI’m always intrigued by data science “meta” analyses or programming/data-science. For example, Matt Dancho’s analysis of renown data scientist David Robinson. David Robinson himself has done some good ones, such as his blog posts for Stack Overflow highlighting the growth of “incredible” growth of python, and the “impressive” growth of R in modern times.\r\nWith that in mind, I thought it would try to identify if any interesting trends have risen/fallen within the R community in recent years. To do this, I scraped and analyzed the “weekly roundup” posts put together by R Weekly, which was originated in May 2016. These posts consist of links and corresponding descriptions, grouped together by topic. It should go without saying that this content serves as a reasonable heuristic for the interests of the R community at any one point in time. (Of course, the posts of other aggregate R blogs such as R Bloggers or Revolution Analytics might serve as better resources since they post more frequently and have been around for quite a bit longer than R Weekly.)\r\nScraping and Cleaning\r\nAs always, it’s good to follow the best practice of importing all needed packages before beginning.\r\n\r\n\r\nlibrary(tidyverse)\r\nlibrary(gh)\r\nlibrary(viridisLite)\r\n\r\n\r\n\r\nFor the scraping, I drew upon some the principles shown by Maelle Salmon in her write-up detailing how she scraped and cleaned the blog posts of the Locke Data blog. 1\r\n\r\n\r\n# Reference: https://itsalocke.com/blog/markdown-based-web-analytics-rectangle-your-blog/\r\nposts <-\r\n  gh::gh(\r\n    endpoint = \"/repos/:owner/:repo/contents/:path\",\r\n    owner = \"rweekly\",\r\n    repo = \"rweekly.org\",\r\n    path = \"_posts\"\r\n  )\r\n\r\nposts_info <-\r\n  dplyr::data_frame(\r\n    name = purrr::map_chr(posts, \"name\"),\r\n    path = purrr::map_chr(posts, \"path\")\r\n  )\r\n\r\n\r\n\r\nIn all, R Weekly has made 93 (at the time of writing).\r\nNext, before parsing the text of the posts, I add some “meta-data” (mostly for dates) that is helpful for subsequent exploration and analysis.\r\n\r\n\r\nconvert_name_to_date <- function(x) {\r\n  x %>% \r\n    stringr::str_extract(\"[0-9]{4}-[0-9]+-[0-9]+\") %>% \r\n    strftime(\"%Y-%m-%d\") %>% \r\n    lubridate::ymd()\r\n}\r\n\r\nposts_info <-\r\n  posts_info %>% \r\n  mutate(date = convert_name_to_date(name)) %>% \r\n  mutate(num_post = row_number(date)) %>% \r\n    mutate(\r\n    yyyy = lubridate::year(date) %>% as.integer(),\r\n    mm = lubridate::month(date, label = TRUE),\r\n    wd = lubridate::wday(date, label = TRUE)\r\n  ) %>% \r\n  select(date, yyyy, mm, wd, num_post, everything())\r\n\r\nposts_info <-\r\n  posts_info %>% \r\n  mutate(date_min = min(date), date_max = max(date)) %>% \r\n  mutate(date_lag = date - date_min) %>% \r\n  mutate(date_lag30 = as.integer(round(date_lag / 30, 0)), \r\n         date_lag60 = as.integer(round(date_lag / 60, 0)), \r\n         date_ntile = ntile(date, 6)) %>% \r\n  select(-date_min, -date_max) %>% \r\n  select(date_lag, date_lag30, date_lag60, date_ntile, everything())\r\n\r\n\r\n\r\nLet’s quickly look at whether or not R Weekly has been consistent with its posting frequency since its inception. The number of posts across 30-day windows should be around 4 or 5.\r\n\r\nNow, I’ll do the dirty work of cleaning and parsing the text of each post.\r\n\r\n\r\nget_rweekly_post_data <-\r\n  function(filepath) {\r\n    # This would be necessary if downloading directly from the repo.\r\n    # path <-\r\n    #   gh::gh(\r\n    #     \"/repos/:owner/:repo/contents/:path\",\r\n    #     owner = \"rweekly\",\r\n    #     repo = \"rweekly.org\",\r\n    #     path = path\r\n    #   )\r\n\r\n    path_prefix <- \"data-raw\"\r\n    path <- file.path(path_prefix, path)\r\n    rgx_rmv <- \"Â|Å|â€|œ|\\u009d\"\r\n    rgx_detect_link <- \"^\\\\+\\\\s+\\\\[\"\r\n    rgx_detect_head <- \"^\\\\s*\\\\#\"\r\n    rgx_link_post <- \"(?<=\\\\+\\\\s\\\\[).*(?=\\\\])\"\r\n    rgx_link_img <- \"(?<=\\\\!\\\\[).*(?=\\\\])\"\r\n    rgx_url <- \"(?<=\\\\().*(?=\\\\))\"\r\n    rgx_head <- \"(?<=\\\\#\\\\s).*$\"\r\n    \r\n    lines <- readLines(path)\r\n    lines_proc <-\r\n      lines %>%\r\n      # This would be necessary if downloading directly from the repo.\r\n      # base64enc::base64decode() %>%\r\n      # rawToChar() %>%\r\n      stringr::str_split(\"\\n\") %>%\r\n      purrr::flatten_chr() %>%\r\n      as_tibble() %>%\r\n      rename(text = value) %>%\r\n      transmute(line = row_number(), text) %>%\r\n      filter(text != \"\") %>%\r\n      mutate(text = stringr::str_replace_all(text, rgx_rmv, \"\")) %>%\r\n      mutate(text = stringr::str_replace_all(text, \"&\", \"and\")) %>% \r\n      mutate(\r\n        is_link = ifelse(stringr::str_detect(text, rgx_detect_link), TRUE, FALSE),\r\n        is_head = ifelse(stringr::str_detect(text, rgx_detect_head), TRUE, FALSE)\r\n      ) %>%\r\n      mutate(\r\n        link_post = stringr::str_extract(text, rgx_link_post),\r\n        link_img = stringr::str_extract(text, rgx_link_img),\r\n        url = stringr::str_extract(text, rgx_url),\r\n        head = \r\n          stringr::str_extract(text, rgx_head) %>% \r\n          stringr::str_to_lower() %>% \r\n          stringr::str_replace_all(\"s$\", \"\") %>% \r\n          stringr::str_replace_all(\" the\", \"\") %>% \r\n          stringr::str_trim()\r\n      ) %>%\r\n      mutate(\r\n        is_head = ifelse(line == 1, TRUE, is_head),\r\n        head = ifelse(line == 1, \"yaml and intro\", head)\r\n      )\r\n\r\n    # Couldn't seem to get `zoo::na.locf()` to work properly.\r\n    lines_head <-\r\n      lines_proc %>%\r\n      mutate(line_head = ifelse(is_head, line, 0)) %>%\r\n      mutate(line_head = cumsum(line_head))\r\n    \r\n    out <-\r\n      lines_head %>%\r\n      select(-head) %>%\r\n      inner_join(\r\n        lines_head %>%\r\n          filter(is_head == TRUE) %>%\r\n          select(head, line_head),\r\n        by = c(\"line_head\")\r\n      ) %>% \r\n      select(-line_head)\r\n    out\r\n  }\r\n\r\ndata <-\r\n  posts_info %>% \r\n  tidyr::nest(path, .key = \"path\") %>% \r\n  mutate(data = purrr::map(path, get_rweekly_post_data)) %>% \r\n  select(-path) %>% \r\n  tidyr::unnest(data)\r\ndata\r\n\r\n\r\n\r\nAnalyzing\r\nLines and Links\r\nNow, with the data in a workable format, we can explore some of the content.\r\n\r\n\r\nmetrics_bypost <-\r\n  data %>% \r\n  group_by(name, date) %>% \r\n  summarize(\r\n    num_lines = max(line),\r\n    num_links = sum(!is.na(is_link)),\r\n    num_links_post = sum(!is.na(link_post)),\r\n    num_links_img = sum(!is.na(link_img))\r\n  ) %>% \r\n  ungroup() %>% \r\n  arrange(desc(num_lines))\r\n\r\n\r\n\r\nHave the number of links per post increased over time?\r\n\r\nIt looks like there has been a correlated increase in the overall length of the posts (as determined by non-empty lines) and the number of links in each post.\r\n\r\n\r\ncorrr::correlate(metrics_bypost %>% select(num_lines, num_links))\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 2 x 3\r\n##   rowname   num_lines num_links\r\n##   <chr>         <dbl>     <dbl>\r\n## 1 num_lines    NA         0.970\r\n## 2 num_links     0.970    NA\r\n\r\n\r\n\r\n\r\n\r\nbroom::tidy(lm(num_lines ~ num_links, data = metrics_bypost))\r\n\r\n\r\n\r\n\r\n\r\n##          term  estimate  std.error statistic      p.value\r\n## 1 (Intercept) 12.317353 4.93345168  2.496701 1.433479e-02\r\n## 2   num_links  1.796912 0.04754462 37.794219 2.016525e-57\r\n\r\n\r\n\r\nLet’s break down the increase of the number of links over time. Are there more links simply due to an increased use of images?\r\n\r\nIt is evident that the increase in the number of links is not the result of increased image usage, but, instead, to increased linkage to non-trivial content.\r\n\r\n\r\ncorrr::correlate(metrics_bypost %>% select(num_links, num_links_img, num_links_post))\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 3 x 4\r\n##   rowname        num_links num_links_img num_links_post\r\n##   <chr>              <dbl>         <dbl>          <dbl>\r\n## 1 num_links         NA             0.324          0.865\r\n## 2 num_links_img      0.324        NA              0.264\r\n## 3 num_links_post     0.865         0.264         NA\r\n\r\n\r\n\r\n\r\n\r\nbroom::tidy(lm(num_links ~ num_links_img + num_links_post, data = metrics_bypost))\r\n\r\n\r\n\r\n\r\n\r\n##             term  estimate std.error statistic      p.value\r\n## 1    (Intercept) 29.094312 4.7262724  6.155869 2.040398e-08\r\n## 2  num_links_img  1.008073 0.5275685  1.910790 5.921483e-02\r\n## 3 num_links_post  1.168952 0.0749660 15.593093 2.586469e-27\r\n\r\n\r\n\r\nR Weeklyuses a fairly consistent set of “topics” (corresponding to the head variable in the scraped data) across all of their posts.\r\n\r\n\r\nhead_rmv <- \"yaml and intro\"\r\ndata %>%\r\n  distinct(head, name) %>%\r\n  filter(!(head %in% head_rmv)) %>% \r\n  count(head, sort = TRUE)\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 44 x 2\r\n##    head                   n\r\n##    <chr>              <int>\r\n##  1 r in real world       92\r\n##  2 tutorial              92\r\n##  3 upcoming event        92\r\n##  4 highlight             89\r\n##  5 r project update      89\r\n##  6 r in organization     80\r\n##  7 resource              71\r\n##  8 quotes of week        63\r\n##  9 insight               55\r\n## 10 videos and podcast    55\r\n## # ... with 34 more rows\r\n\r\n\r\n\r\nIs there a certain topic (or topics) in the RWeekly posts that are causing the increased length of posts?\r\n\r\nThe steady increase in the length of the tutorial section stands out. (I suppose the R community really enjoys code-walkthroughs (like this one).) Also, the introduction of the new package header about a year after the first RWeekly post suggests that R developers really care about what their fellow community members are working on.\r\nWords\r\nThe words used in the short descriptions that accompany each link to external content should provide a more focused perspective on what specifically is of interest in the R community. What are the most frequently used words in these short descriptions?\r\n\r\nSome unsurprising words appear at the top of this list, such as data and analysis. Some words that one would probably not see among the top of an analogous list for another programming community are rstudio, shiny, ggplot2, and tidy. It’s interesting that shiny actually appears as the top individual package–this could indicate that bloggers like to share their content through interactive apps (presumably because it is a great way to captivate and engage an audience).\r\nIt’s one thing to look at individual words, but it is perhaps more interesting to look at word relationships.\r\n\r\nThis visual highlights a lot of the pairwise word correlations that we might expect in the data science realm: data and science, time and series, machine and learning, etc. Nonetheless, there are some that are certainly unique to the R community: purrr with mapping; community with building; shiny with interactive and learning; and rstudio with (microsoft) server.\r\nThe numerical values driving this correlation network not only is useful for quantifying the visual relationships, but, in this case, it actually highlights some relationships that get a bit lost in the graph (simply due to clustering). In particular, the prominence of the words tutorial, conf, user, and interactive stand out.\r\n\r\n\r\nunigram_corrs <-\r\n  unigrams %>%\r\n  tetext::compute_corrs_at(\r\n    word = \"word\",\r\n    feature = \"name\",\r\n    num_top_ngrams = 100,\r\n    num_top_corrs = 100\r\n  )\r\nunigram_corrs %>% head(20)\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 20 x 4\r\n##    item1       item2     correlation  rank\r\n##    <chr>       <chr>           <dbl> <int>\r\n##  1 tutorials   html            0.966     1\r\n##  2 user2016    tutorials       0.955     2\r\n##  3 user2016    html            0.950     3\r\n##  4 machine     learning        0.726     4\r\n##  5 user        user2016        0.708     5\r\n##  6 slides      html            0.698     6\r\n##  7 time        series          0.695     7\r\n##  8 slides      tutorials       0.695     8\r\n##  9 rstudio     conf            0.691     9\r\n## 10 user        tutorials       0.690    10\r\n## 11 user        html            0.687    11\r\n## 12 user2016    slides          0.687    12\r\n## 13 interactive html            0.668    13\r\n## 14 text        mining          0.659    14\r\n## 15 interactive user            0.658    15\r\n## 16 interactive user2016        0.653    16\r\n## 17 interactive tutorials       0.650    17\r\n## 18 earl        london          0.594    18\r\n## 19 network     building        0.582    19\r\n## 20 interactive slides          0.550    20\r\n\r\n\r\n\r\nMost Unique Words\r\nLet’s try to identify words that have risen and fallen in popularity. While there are many ways of doing, let’s try segmenting the R Weekly posts into intervals of 60 days and computing the [term-frequency, inverse-document-frequency]((https://www.tidytextmining.com/tfidf) (TF-IDF) of words across these intervals. (I apologize if the resolution is sub-par.)\r\n\r\nA couple of things stand out:\r\nPosts were heavily influenced by user2016 conference content in the early days of R Weekly (light blue and blue).\r\nThere was clearly a 20 theme in the 60 days between 2017-02-20 and 2017-04-10 (red).\r\nThe “tabs vs. spaces” debate rose to prominence during the late summer days of 2017 (orange), presumably after David Robinson’s Stack Overflow post on the topic.\r\nR’s ongoing global influence is apparent with the appearance of euro with the user2016 conference (light blue and blue); poland and satrdays (presumably due to the Cape Town R conference of the namesake in late 2016 (green), and several Spanish words in January 2018 (yellow).\r\nI tried some different methods, but did not find much interesting regarding change in word frequency over time (aside from the TF-IDF approach). When using the method discussed in the Tidy Text Mining book for identifying change in word usage across 60-day intervals, I found only two non-trivial “significant” changes among the top 5% of most frequently used words, which are for user and tutorials. user has dropped off a bit since the useR2016 conference, and tutorials has grown in usage, which is evident with the increasing length of the tutorial section in posts.\r\nThat’s all I got for this subject. As I mentioned at the top, there are many of other great “meta” analyses like this one that are worth looking at, so definitely check them out!\r\n\r\nActually, I downloaded the data locally so that I would not have to worry about GitHub API request limits. Thus, in addition to other custom processing steps that I added, my final code does not necessarily resemble hers.↩︎\r\n",
    "preview": "posts/text-analysis-rweekly/featured.jpg",
    "last_modified": "2021-07-01T21:54:22-05:00",
    "input_file": {}
  },
  {
    "path": "posts/interval-data-nycflights13/",
    "title": "Dealing with Interval Data and the nycflights13 package",
    "description": "Dates, ANOVAs, and More",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2018-02-17",
    "categories": [
      "r"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nMinute-Level Data\r\nAn Example (With the nycflights13 Package)\r\n\r\nFinal Thoughts\r\n\r\nIntroduction\r\nIn my job, I often work with data sampled at regular intervals. Samples may range from 5-minute intervals to daily intervals, depending on the specific task. While working with this kind of data is straightforward when its in a database (and I can use SQL), I have been in a couple of situations where the data is spread across .csv files. In these cases, I lean on R to scrape and compile the data. Although some other languages might be superior for such a task, I often need to produce some kind of visualization or report at the end, so choosing to handle all of the data with R is a no-brainer for me–I can easily transition to using {ggplot2} and {rmarkdown} to generate some pretty output.\r\nMinute-Level Data\r\nWhen working with data sampled at 5-minute intervals (resulting in 288 intervals in a day), I’ve found that I’ve used a common “idiom” to generate a time-based “dictionary”. For example, here’s how I might create such a date dictionary for the year 2013. 1\r\n\r\n\r\nlibrary(dplyr)\r\n\r\ndate_1 <- lubridate::ymd(\"2013-01-01\")\r\ndate_2 <- lubridate::ymd(\"2013-12-31\")\r\n\r\nymd_seq <- seq.Date(date_1, date_2, by = \"day\")\r\nymd_grid <-\r\n  data_frame(\r\n    ymd = lubridate::ymd(ymd_seq),\r\n    yyyy = lubridate::year(ymd_seq),\r\n    mm = lubridate::month(ymd_seq),\r\n    dd = lubridate::day(ymd_seq)\r\n  )\r\n\r\nhhmmss <-\r\n  expand.grid(\r\n    hh = seq(1L, 24L, 1L), \r\n    min = seq(5L, 60L, by = 5L), \r\n    sec = 0L) %>% \r\n  as_tibble()\r\n\r\ndates_dict <-\r\n  ymd_grid %>%\r\n  right_join(hhmmss %>% mutate(yyyy = lubridate::year(date_1), by = \"year\")) %>% \r\n  arrange(yyyy, mm, dd, hh, min)\r\ndates_dict\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 105,120 x 8\r\n##    ymd         yyyy    mm    dd    hh   min   sec by   \r\n##    <date>     <dbl> <dbl> <int> <int> <int> <int> <chr>\r\n##  1 2013-01-01  2013     1     1     1     5     0 year \r\n##  2 2013-01-01  2013     1     1     1    10     0 year \r\n##  3 2013-01-01  2013     1     1     1    15     0 year \r\n##  4 2013-01-01  2013     1     1     1    20     0 year \r\n##  5 2013-01-01  2013     1     1     1    25     0 year \r\n##  6 2013-01-01  2013     1     1     1    30     0 year \r\n##  7 2013-01-01  2013     1     1     1    35     0 year \r\n##  8 2013-01-01  2013     1     1     1    40     0 year \r\n##  9 2013-01-01  2013     1     1     1    45     0 year \r\n## 10 2013-01-01  2013     1     1     1    50     0 year \r\n## # ... with 1.051e+05 more rows\r\n\r\n\r\n\r\nAnd, just to prove that there are 288 5-minute intervals for each day in the year, I can use dplyr::count() twice in succession.\r\n\r\n\r\ndates_dict %>% count(yyyy, mm, dd) %>% count()\r\n\r\n\r\n\r\n\r\n\r\n## # A tibble: 1 x 1\r\n##      nn\r\n##   <int>\r\n## 1   365\r\n\r\n\r\n\r\nI then extract data (from individual files) using the time-based dictionary as a “helper” for custom functions for creating file paths and processing the data after importing it.\r\nAfter the dirty work of is done, I can transition to the fun part–exploring and interpreting the data. This process often turns out to be a cycle of visualization, data transformation, and modeling.\r\n\r\nAn Example (With the nycflights13 Package)\r\nTo provide an example, I’ll use the flights data set from the {nycflight13} package. This package includes information regarding all flights leaving from New York City airports in 2013, as well as information regarding weather, airlines, airports, and planes.\r\nLet’s say that I that I’m interested in the average flight departure delay time at the JFK airport. I might hypothesize that there is a relationship between departure delay time with different time periods, such as hour in the day and days in the week.\r\nFirst, I’ll perform the necessary transformation to the flights data to investigate my hypothesis. Specifically, I need to create columns for hour and weekday. (For hour (hh), I simply use the scheduled departure time (sched_dep_time).)\r\n\r\n\r\nlibrary(nycflights13)\r\n\r\nflights_jfk <-\r\n  nycflights13::flights %>% \r\n  filter(origin == \"JFK\") %>% \r\n  mutate(hh = round(sched_dep_time / 100, 0) - 1) %>% \r\n  mutate(ymd = lubridate::ymd(sprintf(\"%04.0f-%02.0f-%02.0f\", year, month, day))) %>% \r\n  mutate(wd = lubridate::wday(ymd, label = TRUE))\r\n\r\n\r\n\r\nNext, I might create a heat map plotting hours against weekdays.\r\n\r\nTo investigate the patterns more “scientifically”, I might perform a one-way Analysis of Variance (ANOVA) on different time variables. I would make sure to test time periods other than just weekday (wd) and mhour (hh), such as month and day.\r\n\r\n\r\nsummary(aov(dep_delay ~ month, data = flights_jfk))\r\n\r\n\r\n\r\n\r\n\r\n##                 Df    Sum Sq Mean Sq F value   Pr(>F)    \r\n## month            1     55213   55213   36.25 1.74e-09 ***\r\n## Residuals   109414 166664445    1523                     \r\n## ---\r\n## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n## 1863 observations deleted due to missingness\r\n\r\n\r\n\r\n\r\n\r\nsummary(aov(dep_delay ~ day, data = flights_jfk))\r\n\r\n\r\n\r\n\r\n\r\n##                 Df    Sum Sq Mean Sq F value Pr(>F)\r\n## day              1        40    40.2   0.026  0.871\r\n## Residuals   109414 166719617  1523.8               \r\n## 1863 observations deleted due to missingness\r\n\r\n\r\n\r\n\r\n\r\nsummary(aov(dep_delay ~ wd, data = flights_jfk))\r\n\r\n\r\n\r\n\r\n\r\n##                 Df    Sum Sq Mean Sq F value Pr(>F)    \r\n## wd               6    246401   41067   26.99 <2e-16 ***\r\n## Residuals   109409 166473256    1522                   \r\n## ---\r\n## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n## 1863 observations deleted due to missingness\r\n\r\n\r\n\r\n\r\n\r\nsummary(aov(dep_delay ~ hh, data = flights_jfk))\r\n\r\n\r\n\r\n\r\n\r\n##                 Df    Sum Sq Mean Sq F value Pr(>F)    \r\n## hh               1   5701754 5701754    3874 <2e-16 ***\r\n## Residuals   109414 161017904    1472                   \r\n## ---\r\n## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n## 1863 observations deleted due to missingness\r\n\r\n\r\n\r\nThe “statistically significant” p values for the wd and hh variables provides incentive to investigate them more closely. I might try an ANOVA F-statistic test comparing linear regression models using each variable as a lone predictor with a linear model where both are used as predictors.\r\n\r\n\r\nlm_wd <- lm(dep_delay ~ wd, data = flights_jfk)\r\nlm_hh <- lm(dep_delay ~ hh, data = flights_jfk)\r\nlm_both <- lm(dep_delay ~ wd + hh, data = flights_jfk)\r\nanova(lm_both, lm_wd, test = \"F\")\r\n\r\n\r\n\r\n\r\n\r\n## Analysis of Variance Table\r\n## \r\n## Model 1: dep_delay ~ wd + hh\r\n## Model 2: dep_delay ~ wd\r\n##   Res.Df       RSS Df Sum of Sq      F    Pr(>F)    \r\n## 1 109408 160778456                                  \r\n## 2 109409 166473256 -1  -5694800 3875.2 < 2.2e-16 ***\r\n## ---\r\n## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n\r\n\r\n\r\n\r\n\r\nanova(lm_both, lm_hh, test = \"F\")\r\n\r\n\r\n\r\n\r\n\r\n## Analysis of Variance Table\r\n## \r\n## Model 1: dep_delay ~ wd + hh\r\n## Model 2: dep_delay ~ hh\r\n##   Res.Df       RSS Df Sum of Sq      F    Pr(>F)    \r\n## 1 109408 160778456                                  \r\n## 2 109414 161017904 -6   -239447 27.157 < 2.2e-16 ***\r\n## ---\r\n## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n\r\n\r\n\r\nOf course, this process would go on. For instance, I would certainly need to investigate if there is a relationship between departure delay and specific airlines.\r\nFinal Thoughts\r\nWorking with interval data was initially a challenge for me, but after working with it more and more often, I find that it’s not so bad after all. It gets more interesting when there is missing data or data samples at irregular intervals, but that’s a story for another day.\r\n\r\nThe technique that I show here would have to be adjusted slightly if working with more than one year at a time, but it wouldn’t be difficult to do so. I tend to only use this design pattern for one year at a time anyways.↩︎\r\n",
    "preview": "posts/interval-data-nycflights13/featured.jpg",
    "last_modified": "2021-07-01T22:13:15-05:00",
    "input_file": {}
  },
  {
    "path": "posts/visualizing-nba-team-schedule/",
    "title": "Visualizing an NBA Team's Schedule Using R",
    "description": "A Calendar Heatmap with ggplot2",
    "author": [
      {
        "name": "Tony ElHabr",
        "url": "https://twitter.com/TonyElHabr"
      }
    ],
    "date": "2017-11-26",
    "categories": [
      "r"
    ],
    "contents": "\r\nIf you’re not completely new to the data science community (specifically, the #rstats community), then you’ve probably seen a version of the “famous” data science workflow diagram. 1\r\n\r\nIf one is fairly familiar with a certain topic, then one might not spend much time with the initial “visualize” step of the workflow. Such is the case with me and NBA data–as a relatively knowledgeable NBA follower, I don’t necessarily need to spend much of my time exploring raw NBA data prior to modeling.\r\nAnyways, as a break from experimenting with predictive models, I decided to make a visualization just for the sake of trying something I hadn’t done before. 2 In particular, I was inspired by the calendar heat map visualization that I saw in the Top 50 ggplot visualizations post on the https://r-statistics.co website.\r\n\r\nTo implement a plot of this nature, I decided to look at how my hometown team, the San Antonio Spurs, fared last season (2016) in terms of point differential. In case it’s not immediately obvious, lots of green is good. (This is not surprising to those of us who follow the NBA–the Spurs have been consistently good since the end of the 1990s.)\r\n\r\n\r\nlibrary(dplyr)\r\nlibrary(ggplot2)\r\n\r\nresults_prepared <- 'game_results-prepared.csv' %>% read_csv()\r\n\r\ncolnames_base <- c('date', 'season', 'tm')\r\ncolnames_calc_dates <- c('yyyy', 'mm', 'dd', 'wd', 'mm_yyyy', 'mm_w')\r\n# Look at a couple of different metrics.\r\n# Specifically, look at games played to date (g_td) and point differential (pd).\r\ncolnames_viz <- c('g_td', 'pd')\r\n\r\nresults_calendar_tm <-\r\n  results_prepared %>%\r\n  filter(tm == 'SAS') %>%\r\n  mutate(\r\n    yyyy = year(date),\r\n    mm = lubridate::month(date),\r\n    dd = lubridate::day(date),\r\n    wd = lubridate::wday(date, label = TRUE, abbr = TRUE),\r\n    mm_yyyy = zoo::as.yearmon(date)\r\n  ) %>%\r\n  group_by(mm_yyyy) %>%\r\n  mutate(mm_w = ceiling(dd / 7)) %>%\r\n  ungroup() %>%\r\n  select(one_of(colnames_base, colnames_calc_dates, colnames_viz)) %>%\r\n  arrange(season, g_td, tm)\r\nresults_calendar_tm\r\n\r\n# Tidy up because I was experimenting with different metrics, not just point differential.\r\nresults_calendar_tm_tidy <-\r\n  results_calendar_tm %>%\r\n  tidyr::gather(metric, value, colnames_viz)\r\n\r\nseason <- 2016\r\nwd_labels <- levels(results_calendar_tm$wd)\r\nwd_labels[2:6] <- ''\r\ntitle <- str_c('San Antonio Spurs Point Differential in ', season, ' NBA Season')\r\n\r\nviz_pd_sas_2016 <-\r\n  results_calendar_tm_tidy %>%\r\n  filter(season %in% seasons) %>%\r\n  filter(metric == 'pd') %>%\r\n  ggplot() +\r\n  geom_tile(aes(x = wd, y = mm_w, fill = value), colour = 'white') +\r\n  scale_y_reverse() +\r\n  scale_x_discrete(labels = wd_labels) +\r\n  theme(axis.text.x = element_text(angle = 90, vjust = 0.5)) +\r\n  scale_fill_gradient2(low = 'red', mid = 'grey', high = 'green') +\r\n  theme(legend.position = 'bottom') +\r\n  labs(x = '', y = '', title = title) +\r\n  facet_wrap( ~ mm_yyyy, nrow = 2)\r\nviz_pd_sas_2016\r\n\r\n\r\n\r\n\r\nThere are an infinite number of ways to visualize data like this, but I thought this was interesting because of the temporal nature of the data.\r\n\r\nThe figure shown here comes from the introductory chapter of the R for Data Science book↩︎\r\nHere, I use the NBA data that I have already scraped and cleaned.↩︎\r\n",
    "preview": "posts/visualizing-nba-team-schedule/featured.jpg",
    "last_modified": "2021-07-01T21:58:21-05:00",
    "input_file": {}
  }
]
